Repository: xbmc/xbmc
Catalog: addons/metadata.themoviedb.org.python/resources/language/resource.language.*/strings.po
Languages: af_za, ca_es, hr_hr, it_it, lv_lv, my_mm, uk_ua

# Addon Summary
source: Python TMDB Movie Scraper
af_za: TMDB Fliek Skraper
ca_es: Raspador Python de pel·lícules de TMDB
hr_hr: TMDB filmski sakupljač informacija
it_it: Scraper per Python TMDB Movie
lv_lv: Python The Movie Database (TMDb) filmu skrāpis
my_mm: TMDB Movie Scraper
uk_ua: TMDB — джерело інформації про фільми

# Addon Description
source: themoviedb.org is a free and open movie database. It's completely user driven by people like you. TMDb is currently used by millions of people every month and with their powerful API, it is also used by many popular media centers like Kodi to retrieve Movie Metadata, Posters and Fanart to enrich the user's experience.
af_za: themoviedb.org is 'n verniet en oop fliek databasis. Dit is totaal gebruiker gedryf deur mense soos jy. TMDB word huidiglik deur miljoene mense elke maand gebruik, en met hulle kragtige API word dit ook deur baie gewilde media sentrums soos Kodi gebruik om Fliek Metadata, Plakkate en Ondersteunerkuns te onttrek om die gebruiker se ondervinding te verryk.
ca_es: themoviedb.org és una base de dades gratuïta i oberta. Es manté completament per usuaris com tu. TMDb es fa servir per milions de persones cada mes i amb la seva potent API també és utilitzada per molts reproductors multimèdia com el Kodi per obtenir les metadades de pel·lícules, pòsters i fan art per enriquir l'experiència d'usuari.
hr_hr: themoviedb.org je besplatna i otvorena baza filmskih podataka. TMDb trenutno koriste milijuni ljudi svaki mjesec uz pomoću njegovog snažnog API-ja, isto tako se koristi u mnogim popularnim medijskim centrima poput Kodija, kako bi mogli prikupljati informacije o filmovima, filmske plakate, omote filmova i na kraju obogatiti korisničko iskustvo.
it_it: themovedb.org è un database di film gratuito e aperto. È completamente creato da persone come te. TMDb è attualmente utilizzato da milioni di persone ogni mese e con la loro potente API, è utilizzato anche da molti centri multimediali popolari come Kodi per recuperare metadati di film, poster e fanart per arricchire l'esperienza dell'utente.
lv_lv: themoviedb.org ir bezmaksas un publiski pieejama filmu datubāze. To to uztur tādi cilvēki kā jūs. Pašlaik TMDb izmanto miljoniem cilvēku katru mēnesi, un, pateicoties tā jaudīgajam API, tas tiek izmantots daudzos populāros multimedijas centros. Piemēram, Kodi, lai iegūtu filmu datus, vāka plakātus un fanu veidotos attēlus, lai bagātinātu Kodi lietotāja pieredzi.
my_mm: themoviedb.org သည် အခမဲ့ဖြစ်ပြီး ပွင့်လင်းသော ရုပ်ရှင်ဒေတာဘေ့စ်တစ်ခုဖြစ်သည်။ TMDb ကို ၎င်း၏အားကောင်းသော API ဖြင့် လစဉ်လတိုင်း လူသန်းပေါင်းများစွာက အသုံးပြုလျက်ရှိပြီး Kodi ကဲ့သို့ နာမည်ကြီး မီဒီယာစင်တာများတွင်လည်း ရုပ်ရှင်အချက်အလက်၊ ရုပ်ရှင်ပိုစတာများ၊ ရုပ်ရှင်ကာဗာများကို စုဆောင်းကာ နောက်ဆုံးတွင် သုံးစွဲသူအတွေ့အကြုံကို ကြွယ်ဝစေပါသည်။
uk_ua: themoviedb.org - це безкоштовна і відкрита база даних фільмів. Вона повністю підтримується звичайними людьми. В даний момент сайт TMDb використовують мільйони людей кожен місяць, і завдяки потужному API, його можуть використовувати різні популярні медіацентри, такі як Kodi, щоб отримувати метадані, постери і фанарт для фільмів з метою оформлення інтерфейсу.

# #30000
source: Enable fanart from TMDb
af_za: Stel ondersteunerkuns vanaf TMDB in staat
ca_es: Activa el fanart de TMDb
hr_hr: Omogući omote slika s TMDb
it_it: Abilita fanart da TMDb
lv_lv: Atļaut fanu veidotos attēlus no TMDb
my_mm: TMDB မှ ဖန်အက် ကိုဖွင့်ပါ
uk_ua: Увімкнути фанарт з TMDb

# #30001
source: Prefer Trailer from HD-Trailers.net
af_za: Verkies Lokprent vanaf HD-Trailers.net
ca_es: Prefereix el tràiler de HD-Trailers.net
hr_hr: Preferiraj najave filmova s HD-Trailers.net
it_it: Preferisci trailer da HD-Trailers.net
lv_lv: Dot priekšroku filmu reklāmkadriem no HD-Trailers.net vietnes
my_mm: HD-Trailers.net မှသင့်လျှော်သော ကြော်ငြာ
uk_ua: Віддавати перевагу трейлерам з HD-Trailers.net

# #30002
source: Preferred Language
af_za: Verkose Taal
ca_es: Idioma preferit
hr_hr: Željeni jezik
it_it: Lingua preferita
lv_lv: Vēlamā valoda
my_mm: သင့်လျှော်သော ဘာသာစကား
uk_ua: Бажана мова

# #30003
source: Default Rating from
af_za: Verstek Gradering vanaf
ca_es: Valoració per defecte de
hr_hr: Zadana ocjena s
it_it: Valutazione predefinita da
lv_lv: Vērtējumu (pēc noklusējuma) iegūt no
my_mm: နဂို အဆင့်သက်မှတ်ချက်မှ
uk_ua: Типовий рейтинг від

# #30004
source: Enable Trailer (YouTube)
af_za: Stel Lokprent in staat (YouTube)
ca_es: Activa el tràiler (YouTube)
hr_hr: Omogući najave filmova (YouTube)
it_it: Abilita trailer (YouTube)
lv_lv: Atļaut filmu reklāmkadrus no YouTube
my_mm: ကြော်ငြာများရယူမည်(You Tube)
uk_ua: Увімкнути трейлери (YouTube)

# #30005
source: Keep Original Title
af_za: Hou Oorspronklike Titel
ca_es: Manté el títol original
hr_hr: Zadrži izvorni naslov
it_it: Mantieni titolo originale
lv_lv: Izmantot oriģinālo nosaukumu
my_mm: မူလခေါင်းစဉ်အတိုင်းထားမည်
uk_ua: Зберігати оригінальну назву

# #30006
source: Preferred Certification Country
af_za: Verkose Sertifiserings Land
ca_es: País de certificació preferit
hr_hr: Željena država certifikacije
it_it: Paese di certificazione preferito
lv_lv: Vēlamā sertifikācijas valsts
my_mm: နှစ်သက်သောနိုင်ငံ
uk_ua: Бажана країна сертифікації

# #30007
source: Add also IMDb ratings
af_za: Voeg ook IMDB graderings by
ca_es: Afegeix també valoracions de IMDb
hr_hr: Još dodaj IMDb ocjene
it_it: Aggiungi anche valutazioni di IMDb
lv_lv: Pievienot vērtējumus arī no IMDb
my_mm: IMDB အဆင့်သက်မှတ်ချက်များကိုထည့်ပါ
uk_ua: Також додавати рейтинги з IMDb

# #30008
source: Certification Prefix
af_za: Sertifikasie Voorvoegsel
ca_es: Prefix de Certificació
hr_hr: Prefiks certifikacije
it_it: Prefisso certificazione
lv_lv: Sertifikācijas prefikss
my_mm: အမည်အညွှန်းများ
uk_ua: Префікс сертифікації

# #30009
source: Add multiple studios
af_za: Voeg veelvuldige ateljees by
ca_es: Afegeix múltiples estudis
hr_hr: Dodaj više studija
it_it: Aggiungi più studio
lv_lv: Pievienot vairākas studijas
my_mm: စတူဒီယိုများစွာကိုထည့်ပါ
uk_ua: Додавати декілька студій

# #30010
source: Add also Trakt.tv ratings
af_za: Voeg ook Trak.tv graderings by
ca_es: Afegeix també valoracions de Trakt.tv
hr_hr: Još dodaj Trakt.tv ocjene
it_it: Aggiungi anche valutazioni di Trakt.tv
lv_lv: Pievienot vērtējumus arī no Trakt.tv vietnes
my_mm: Trakt.tv အဆင့်သတ်မှတ်ချက်များကိုလည်း ထည့်ပါ
uk_ua: Також додавати рейтинги з Trakt.tv

# #30011
source: Add keywords as tags
af_za: Voeg sleutelwoorde as etikette by
ca_es: Afegeix paraules clau com a etiquetes
hr_hr: Dodaj ključne riječi kao oznake
it_it: Aggiungi parole chiave come etichette
lv_lv: Pievienot atslēgvārdus kā birkas
my_mm: စာကားလုံးများကို တွဲထည့်ပါ
uk_ua: Додавати ключові слова як теги

# #30012
source: Separate TMDb fanart with title to landscape
af_za: Aparte TMDb ondersteunerkuns met titel na landskap
ca_es: Separa el fan art de TMDb amb títol amb el mode horitzontal
hr_hr: Razdvoji TMDb slike s naslova do pejzažnog prikaza
it_it: Separa fanart TMDb con il titolo a panoramica
lv_lv: Atdaliet TMDb fanu veidotos attēlus ar nosaukumu kā ainava
my_mm: TMDb fanart ကို အခင်းအကျင်းအဖြစ် ခေါင်းစဉ်ဖြင့် ခွဲခြားပါ
uk_ua: Відділяти TMDb фанарт з назвою до landscape

# #30013
source: Search language
af_za: Soek taal
ca_es: Idioma de la cerca
hr_hr: Jezik pretrage
it_it: Cerca lingua
lv_lv: Meklēšanas valoda
my_mm: ဘာသာစကားရှာဖွေပါ
uk_ua: Мова пошуку

# #30014
source: Enable posters from TMDb
af_za: Stel plakkate vanaf TMDb in staat
ca_es: Activa els posters de TMDb
it_it: Abilita poster da TMDb

# #30015
source: Maximum number of each artwork type - many artwork can cause an error scraping to MySQL database
af_za: Maksimum hoeveelheid van elke kunswerk tipe - baie kunswerke kan 'n fout veroorsaak wanneer na MySQL databasis skraap
it_it: Numero massimo per ogni tipo di artwork: molti artwork possono causare un errore durante lo scraping nel database MySQL

# #30100
source: Language for Fanart.tv artwork
af_za: Taal vir Fanart.tv kunswerke
ca_es: Idioma per a les obres d'art de Fanart.tv
hr_hr: Jezik za Fanart.tv slike omota
it_it: Lingua per artwork Fanart.tv
lv_lv: Izmantot fanu veidotiem attēliem no Fanart.tv vietnes sekojošo valodu
my_mm: Fanart.tv အနုပညာလက်ရာအတွက် ဘာသာစကား
uk_ua: Мова ілюстрацій з Fanart.tv

# #30101
source: Fanart.tv personal API key (optional)
af_za: Fanart.tv persoonlike API sleutel (opsioneel)
ca_es: Clau personal de l'API de Fanart.tv (opcional)
hr_hr: Fanart.tv osobni API ključ (neobavezno)
it_it: Chiave API personale Fanart.tv (opzionale)
lv_lv: Fanart.tv personiskā API atslēga (pēc izvēles, nav obligāti)
my_mm: Fanart.tv ကိုယ်ပိုင် API key (optional)
uk_ua: персональний API-ключ в Fanart.tv (необов'язково)

# #30102
source: Enable artwork from Fanart.tv
af_za: Stel kunswerke vanaf Fanart.tv in staat
ca_es: Activa les obres d'art de Fanart.tv
hr_hr: Omogući slike omota s Fanart.tv
it_it: Abilita artwork da Fanart.tv
lv_lv: Atļaut mākslas darbus (ilustrācijas) no Fanart.tv vietnes
my_mm: Fanart.tv မှ artwork ကိုဖွင့်ပါ
uk_ua: Увімкнути ілюстрації з Fanart.tv

# #30103
source: Prioritize Fanart.TV artworks over preferred language
af_za: Prioritiseer Fanart.tv kunswerke bo verkose taal
ca_es: Prioritza les obres d'art de Fanart.TV sobre l'idioma preferit
hr_hr: Priotiziraj Fanart.TV slike omota nad željenim jezikom
it_it: Dai la priorità all'artwork Fanart.TV rispetto alla lingua preferita
lv_lv: Dot priekšroku Fanart.tv mākslas darbiem, ignorējot vēlamo valodu
my_mm: နှစ်သက်ရာ ဘာသာစကားထက် Fanart.TV artworks ကိုဦးစားပေးပါ
uk_ua: Більший пріоритет ілюстраціям з Fanart.TV, ніж бажаної мови
