Repository: xbmc/xbmc
Catalog: language/Welsh/strings.po
Languages: cy

# #19209
source: Kodi virtual backend
cy: Cefn delweddu Kodi

# #19210
source: Client
cy: Cleient

# #19211
source: Delete channel
cy: Dileu sianel

# #19212
source: This list contains changes
cy: Mae'r rhestr yn cynnwys newidiadau

# #19213
source: Select backend
cy: Dewis offer cefn

# #19214
source: Enter a valid URL for the new channel
cy: Rhowch URL dilys ar gyfer y sianel newydd

# #19215
source: The PVR backend does not support timers.
cy: Nid yw offer cefn y Recordydd yn cynnal amseryddion.

# #19216
source: All radio channels
cy: Pob sianel radio

# #19217
source: All TV channels
cy: Pob sianel deledu

# #19218
source: Visible
cy: Gweladwy

# #19219
source: Ungrouped channels
cy: Sianeli heb eu grwpio

# #19220
source: Channels in
cy: Sianeli mewn

# #19221
source: Synchronise channel groups with backend(s)
cy: Cydweddu grwpiau sianeli gyda'r cefn

# #19222
source: EPG
cy: Amserlenydd Fideo Personol

# #19223
source: No PVR Add-on could be enabled. Check your settings or the log for more info.
cy: Nid oedd modd galluogi ychwanegion Recordydd. Gwiriwch eich gosodiadau neu gofnod am ragor o wybodaeth.

# #19224
source: Recording aborted
cy: Ataliwyd y recordiad

# #19225
source: Recording scheduled
cy: Recordiad wedi ei amseru

# #19226
source: Recording started
cy: Wedi cychwyn recordio

# #19227
source: Recording completed
cy: Wedi cwblhau recordio

# #19228
source: Recording deleted
cy: Wedi dileu recordiad

# #19229
source: Close channel OSD after switching channels
cy: Cau Dangosydd ar Sgrin y sianel ar ôl newid sianel

# #19230
source: Prevent EPG updates during playback
cy: Peidio diweddaru'r Amserlenydd wrth chwarae nôl

# #19231
source: Always use the channel order from the backend(s)
cy: Defnyddio trefn sianeli yr offer cefn bob tro

# #19232
source: Clear search results
cy: Clirio canlyniadau chwilio

# #19233
source: Display a notification on timer updates
cy: Hysbysu am ddiweddaru amseryddion

# #19234
source: Use backend channels numbers (only works with 1 enabled PVR Add-on)
cy: Defnyddio rhifau sianeli offer cefn (1 ategyn Recordydd yn unig)

# #19235
source: PVR manager is starting up
cy: Mae'r rheolwr Recordydd yn cychwyn

# #19236
source: Loading channels from clients
cy: Llwytho sianeli o glientiaid

# #19237
source: Loading timers from clients
cy: Llwytho amseryddion o glientiaid

# #19238
source: Loading recordings from clients
cy: Llwytho recordiadau o glientiaid

# #19239
source: Starting background threads
cy: Cychwyn trywyddau cefndirol

# #19240
source: No PVR Add-on enabled
cy: Dim ychwanegion Recordydd wedi eu galluogi

# #19241
source: The PVR manager has been enabled without any
cy: Mae'r rheolwr Recordydd wedi ei alluogi heb unrhyw ychwanegyn

# #19242
source: enabled PVR Add-on. Enable at least one Add-on
cy: Recordydd wedi ei alluogi. Galluogwch o leiaf un

# #19243
source: in order to use the PVR functionality.
cy: er mwyn defnyddio ei swyddogaeth Recordydd.

# #19244
source: Backend idle time
cy: Cyfnod segur yr offer cefn

# #19245
source: Set wakeup command (cmd [timestamp])
cy: Gosod gorchymyn deffro (cmd [timestamp])

# #19246
source: Wakeup before recording
cy: Deffro cyn recordio

# #19247
source: Daily wakeup
cy: Deffro dyddiol

# #19248
source: Daily wakeup time (HH:MM:SS)
cy: Amser deffro bob dydd (AA:MM:EE)

# #19249
source: Filter channels
cy: Hidlo sianeli

# #19250
source: Loading EPG from database
cy: Llwytho'r Amserlenydd o'r gronfa ddata

# #19251
source: Update EPG information
cy: Diweddaru gwybodaeth yr Amserlenydd

# #19252
source: Schedule EPG update for this channel?
cy: Amseru diweddariad Amserlenydd ar gyfer y sianel hon?

# #19253
source: EPG update scheduled for channel
cy: Diweddariad Amserlenydd wedi ei amseru ar gyfer y sianel

# #19254
source: EPG update failed for channel
cy: Methodd diweddaru Amserlenydd y sianel

# #19255
source: Start recording
cy: Cychwyn recordio

# #19256
source: Stop recording
cy: Atal recordio

# #19257
source: Lock channel
cy: Cloi'r sianel

# #19258
source: Unlock channel
cy: Datgloi'r sianel

# #19259
source: Parental control
cy: Rheoliaeth rhiant

# #19260
source: Unlock duration
cy: Cyfnod y datgloi

# #19261
source: Change PIN
cy: Newid PIN

# #19262
source: Parental control. Enter PIN:
cy: Rheolaeth rhiant. Rhowch PIN:

# #19263
source: Locked channel. Enter PIN:
cy: Cloi sianel. Rhowch PIN:

# #19264
source: Incorrect PIN
cy: PIN anghywir

# #19265
source: The entered PIN number was incorrect.
cy: Roedd y PIN rhoddwyd yn anghywir.

# #19266
source: Parental locked
cy: Clowyd gan riant

# #19267
source: Parental locked:
cy: Clowyd gan riant:

# #19268
source: Do not show 'no information available' labels
cy: Peidio dangos labeli 'dim gwybodaeth ar gael'

# #19269
source: Do not show 'connection lost' warnings
cy: Peidio dangos rhybuddion 'cysylltiad wedi ei golli'

# #19270
source: Group Items
cy: Grwpio eitemau

# #19271
source: No PVR Add-ons could be found
cy: Heb ganfod ychwanegion Recordydd

# #19272
source: You need a tuner, backend software, and an
cy: Mae angen tiwniwr, meddalwedd offer cefn ac

# #19273
source: Add-on for the backend to be able to use PVR.
cy: Ychwanegyn ar gyfer y offer cefn er mwyn defnyddio'r Recordydd.

# #19274
source: Please visit xbmc.org/pvr to learn more.
cy: Ewch i xbmc.org/pvr i ddysgu ragor.

# #19275
source: Conflict warning
cy: Rhybudd gwrthdaro

# #19276
source: Conflict error
cy: Gwall gwrthdaro

# #19277
source: Recording conflict
cy: Gwrthdaro recordio

# #19278
source: Recording error
cy: Gwall recordio

# #19279
source: Client specific
cy: Cleient penodol

# #19280
source: Client specific settings
cy: Gosodiadau cleieint penodol

# #19281
source: Confirm channel switches by pressing OK
cy: Cadarnhau newid sianel drwy bwyso Iawn

# #19282
source: Current icon
cy: Eicon cyfredol

# #19283
source: No icon
cy: Dim eicon

# #19284
source: Choose icon
cy: Dewis eicon

# #19285
source: Browse for icon
cy: Pori am eiconau

# #19286
source: Searching for channel icons
cy: Chwilio am eiconau sianeli

# #19287
source: All channels
cy: Pob sianel

# #19288
source: Foreground
cy: Blaendir

# #19499
source: Other/Unknown
cy: Eraill/Anhysbys

# #19500
source: Movie/Drama
cy: Ffilm/Drama

# #19501
source: Detective/Thriller
cy: Ditectif/Cyffro

# #19502
source: Adventure/Western/War
cy: Antur/Cowbois/Rhyfel

# #19503
source: Science Fiction/Fantasy/Horror
cy: Gwyddonias/Ffatasi/Arswyd

# #19504
source: Comedy
cy: Comedi

# #19505
source: Soap/Melodrama/Folkloric
cy: Sebon/Melodrama/Gwerinol

# #19506
source: Romance
cy: Serch

# #19507
source: Serious/Classical/Religious/Historical Movie/Drama
cy: Difrifol/Clasurol/Crefyddol/Ffilm Hanesyddol/Drama

# #19508
source: Adult Movie/Drama
cy: Ffilm/Drama Oedolion

# #19516
source: News/Current Affairs
cy: Newyddion/Materion Cyfredol

# #19517
source: News/Weather Report
cy: Newyddion/Adroddiadau Tywydd

# #19518
source: News Magazine
cy: Cylchgrawn Newyddion

# #19519
source: Documentary
cy: Dogfen

# #19520
source: Discussion/Interview/Debate
cy: Trafod/Cyfweld

# #19532
source: Show/Game Show
cy: Sioeau/Sioe Gemau

# #19533
source: Game Show/Quiz/Contest
cy: Sioeau Gemau/Cwis/Cystadlaethau

# #19534
source: Variety Show
cy: Sioeau Amrywiaeth

# #19535
source: Talk Show
cy: Sioe Siarad

# #19548
source: Sports
cy: Chwaraeon

# #19549
source: Special Event
cy: Digwyddiad Arbennig

# #19550
source: Sport Magazine
cy: Cylchgrawn Chwaraeon

# #19551
source: Football
cy: Peldroed

# #19552
source: Tennis/Squash
cy: Tenis/Sboncen

# #19553
source: Team Sports
cy: Chwaraeon Tîm

# #19554
source: Athletics
cy: Athletau

# #19555
source: Motor Sport
cy: Moduro

# #19556
source: Water Sport
cy: Chwaraeon Dŵr

# #19557
source: Winter Sports
cy: Chwaraeon Gaeaf

# #19558
source: Equestrian
cy: Marchogol

# #19559
source: Martial Sports
cy: Chwaraeon Milwrol

# #19564
source: Children's/Youth Programmes
cy: Rhaglenni Plant/Arddegau

# #19565
source: Pre-school Children's Programmes
cy: Rhaglenni Plant Meithrin

# #19566
source: Entertainment Programmes for 6 to 14
cy: Rhaglenni Difyrwch ar gyfer 6 i 14

# #19567
source: Entertainment Programmes for 10 to 16
cy: Rhaglenni Difyrwch ar gyfer 10 i 16

# #19568
source: Informational/Educational/School Programme
cy: Rhaglenni Gwybodaeth/Addysgol/Ysgol

# #19569
source: Cartoons/Puppets
cy: Cartwnau/Pypedi

# #19580
source: Music/Ballet/Dance
cy: Cerddoriaeth/Bale/Dawns

# #19581
source: Rock/Pop
cy: Roc/Pop

# #19582
source: Serious/Classical Music
cy: Cerddoriaeth Ddifrifol/Clasurol

# #19583
source: Folk/Traditional Music
cy: Cerddoriaeth Gwerin/Traddodiadol

# #19584
source: Musical/Opera
cy: Sioeau Cerdd/Opera

# #19585
source: Ballet
cy: Bale

# #19596
source: Arts/Culture
cy: Celfyddydau/Diwylliant

# #19597
source: Performing Arts
cy: Celfyddydau Perfformia

# #19598
source: Fine Arts
cy: Celfyddid Gain

# #19599
source: Religion
cy: Crefydd

# #19600
source: Popular Culture/Traditional Arts
cy: Diwylliant Poblogaidd/Celfyddydau Traddodiadol

# #19601
source: Literature
cy: Llenyddiaeth

# #19602
source: Film/Cinema
cy: Ffilm/Sinema

# #19603
source: Experimental Film/Video
cy: Ffilm Arbrofol/Fideo

# #19604
source: Broadcasting/Press
cy: Teledu/Y Wasg

# #19605
source: New Media
cy: Cyfryngau Newydd

# #19606
source: Arts/Culture Magazines
cy: Celfyddydau/Cylchgronau Diwylliannol

# #19607
source: Fashion
cy: Ffasiwn

# #19612
source: Social/Political/Economics
cy: Cymdeithasol/Gwleidyddol/Economeg

# #19613
source: Magazines/Reports/Documentary
cy: Cylchgronau/Adroddiadau/Dogfennaeth

# #19614
source: Economics/Social Advisory
cy: Economeg/Cyngor Cymdeithasol

# #19615
source: Remarkable People
cy: Pobl Arbennig

# #19628
source: Education/Science/Factual
cy: Addysg/Gwyddonol/Ffeithiol

# #19629
source: Nature/Animals/Environment
cy: Natur/Anifeiliaid/Amgylchedd

# #19630
source: Technology/Natural Sciences
cy: Technoleg/Gwyddorau Natur

# #19631
source: Medicine/Physiology/Psychology
cy: Meddygaeth/Ffisioleg/Seicoleg

# #19632
source: Foreign Countries/Expeditions
cy: Gwledydd Tramor/Alldeithiau

# #19633
source: Social/Spiritual Sciences
cy: Cymdeithasol/Gwyddorau Ysbrydol

# #19634
source: Further Education
cy: Addysg Bellach

# #19635
source: Languages
cy: Ieithoedd

# #19644
source: Leisure/Hobbies
cy: Hamdden/Hobïau

# #19645
source: Tourism/Travel
cy: Ymweld/Teithio

# #19646
source: Handicraft
cy: Crefftau

# #19647
source: Motoring
cy: Moduro

# #19648
source: Fitness & Health
cy: Ffitrwydd ac Iechyd

# #19649
source: Cooking
cy: Coginio

# #19650
source: Advertisement/Shopping
cy: Hysbysebu/Siopa

# #19651
source: Gardening
cy: Garddio

# #19660
source: Special Characteristics
cy: Nodweddion Arbennig

# #19661
source: Original Language
cy: Iaith Wreiddiol

# #19662
source: Black & White
cy: Du a Gwyn

# #19663
source: Unpublished
cy: Heb eu cyhoeddi

# #19664
source: Live Broadcast
cy: Darlledu Byw

# #19677
source: Detective/Thriller
cy: Ditectif/Cyffro

# #19678
source: Adventure/Western/War
cy: Antur/Cowbois/Rhyfel

# #19679
source: Science Fiction/Fantasy/Horror
cy: Gwyddoniaeth/Ffantasi/Arswyd

# #19680
source: Comedy
cy: Comedi

# #19681
source: Soap/Melodrama/Folkloric
cy: Sebon/Melodrama/Gwerinol

# #19682
source: Romance
cy: Serch

# #19683
source: Serious/ClassicalReligion/Historical
cy: Difrifol/ClasurolCrefyddol/Hanesyddol

# #19684
source: Adult
cy: Oedolion

# #20000
source: Saved music folder
cy: Ffolder cadw cerddoriaeth

# #20001
source: Use external DVD player
cy: Defnyddio chwaraewr DVD allanol

# #20002
source: External DVD player
cy: Chwaraewr DVD allanol

# #20003
source: Trainers folder
cy: Ffolder hyfforddwyr

# #20004
source: Screenshot folder
cy: Ffolder lluniau sgrin

# #20006
source: Playlists folder
cy: Ffolder rhestrau chwarae

# #20007
source: Recordings
cy: Recordiadau

# #20008
source: Screenshots
cy: Lluniau sgrin

# #20009
source: Use Kodi
cy: Defnyddio Kodi

# #20011
source: Music playlists
cy: Rhestrau chwarae cerddoriaeth

# #20012
source: Video playlists
cy: Rhestrau chwarae fideo

# #20013
source: Do you wish to launch the game?
cy: Hoffech chi gychwyn y gêm?

# #20014
source: Sort by: Playlist
cy: Trefnu: Rhestr chwarae

# #20015
source: Remote thumb
cy: Llun bach pell

# #20016
source: Current thumb
cy: Llun bach cyfredol

# #20017
source: Local thumb
cy: Llun bach lleol

# #20018
source: No thumb
cy: Dim llun bach

# #20019
source: Choose thumbnail
cy: Dewis llun bach

# #20023
source: Conflict
cy: Gwrthdaro

# #20024
source: Scan new
cy: Sgan newydd

# #20025
source: Scan all
cy: Sganio popeth

# #20026
source: Region
cy: Ardal

# #20037
source: Summary
cy: Crynodeb

# #20038
source: Lock music window
cy: Cloi ffenestr cerddoriaeth

# #20039
source: Lock videos window
cy: Cloi ffenestr fideo

# #20040
source: Lock pictures window
cy: Cloi ffenestr lluniau

# #20041
source: Lock programs & scripts windows
cy: Cloi ffenestr rhaglenni a sgriptiau

# #20042
source: Lock file manager
cy: Cloi rheolwr ffeiliau

# #20043
source: Lock settings
cy: Gosodiadau cloi

# #20044
source: Start fresh
cy: Cychwyn o'r newydd

# #20045
source: Enter master mode
cy: Rhowch modd meistr

# #20046
source: Leave master mode
cy: Gadael y modd meistr

# #20047
source: Create profile '%s'?
cy: Creu proffil '%s'?

# #20048
source: Start with fresh settings
cy: Cychwyn gyda gosodiadau o'r newydd

# #20049
source: Best available
cy: Gorau ar gael

# #20050
source: Auto-switch between 16x9 and 4x3
cy: Awtonewid rhwng 16x9 a 4x3

# #20051
source: Treat stacked files as single file
cy: Creu ffeiliau staciwyd fel un ffeil

# #20052
source: Caution
cy: Gofal

# #20053
source: Left master mode
cy: Modd meistr chwith

# #20054
source: Entered master mode
cy: Yn y modd meistr

# #20055
source: Allmusic.com thumb
cy: Llun bach Allmusic.com

# #20057
source: Remove thumbnail
cy: Tynnu llun bach

# #20058
source: Add profile...
cy: Ychwanegu proffil...

# #20059
source: Query info for all albums
cy: Ymholi gwybodaeth ar bob albwm

# #20060
source: Media info
cy: Gwybodaeth cyfrwng

# #20061
source: Separate
cy: Ar wahân

# #20062
source: Shares with default
cy: Rhaniadau gyda'r rhagosodedig

# #20063
source: Shares with default (read only)
cy: Rhaniadau gyda'r rhagosodedig (darllen yn unig)

# #20064
source: Copy default
cy: Copïo’r rhagosodiad

# #20065
source: Profile picture
cy: Proffil y llun

# #20066
source: Lock preferences
cy: Dewisiadau cloi

# #20067
source: Edit profile
cy: Golygu'r phroffil

# #20068
source: Profile lock
cy: Clo'r proffil

# #20069
source: Could not create folder
cy: Meth creu proffil

# #20070
source: Profile directory
cy: Cyfeiriadur proffiliau

# #20071
source: Start with fresh media sources
cy: Cychwyn gyda ffynonellau cyfrwng newydd

# #20072
source: Make sure the selected folder is writable
cy: Gwnewch yn siŵr fod y ffolder yn ysgrifenadwy

# #20073
source: and that the new folder name is valid
cy: a bod enw'r ffolder newydd yn ddilys

# #20074
source: MPAA rating
cy: Graddio MPAA

# #20075
source: Enter master lock code
cy: Rhowch prif god cloi

# #20076
source: Ask for master lock code on startup
cy: Gofyn am y prif cod cloi wrth gychwyn

# #20077
source: Skin settings
cy: Gosodiadau croen

# #20078
source: - no link set -
cy: - heb osod cyswllt -

# #20079
source: Enable animations
cy: Galluogi animeiddio

# #20080
source: Disable RSS during music
cy: Analluogi RSS wrth chwarae cerddoriaeth

# #20081
source: Enable shortcut buttons
cy: Galluogi botymau llwybrau byr

# #20082
source: Show programs in main menu
cy: Dangos rhaglenni yn y brif ddewislen

# #20083
source: Show music info
cy: Dangos gybodaeth cerddoriaeth

# #20084
source: Show weather info
cy: Dangos gwybodaeth tywydd

# #20085
source: Show system info
cy: Dangos gwybodaeth system

# #20086
source: Show available disk space C: E: F:
cy: Dangos gofod disg sydd ar gael C: E: F:

# #20087
source: Show available disk space E: F: G:
cy: Dangos gofod disg sydd ar gael E: F: G:

# #20088
source: Weather info
cy: Gwybodaeth tywydd

# #20089
source: Drive space free
cy: Gofod disg rhydd

# #20090
source: Enter the name of an existing share
cy: Rhowch enw rhaniad cyfredol

# #20091
source: Lock code
cy: Cod cloi

# #20092
source: Load profile
cy: Llwytho proffil

# #20093
source: Profile name
cy: Enw proffil

# #20094
source: Media sources
cy: Ffynonellau cyfrwng

# #20095
source: Enter profile lock code
cy: Rhowch god cloi proffil

# #20096
source: Login screen
cy: Sgrin mewngofnodi

# #20097
source: Fetching album info
cy: Estyn gwybodaeth albwm

# #20098
source: Fetching info for album
cy: Estyn gwybodaeth ar gyfer albwm

# #20099
source: Can't rip CD or track while playing from CD
cy: Methu rhwygo CD neu drac wrth chwarae o CD

# #20100
source: Master lock code and settings
cy: Cod prif gloi a gosodiadau

# #20101
source: Entering master lock code always enables master mode
cy: Mae rhoi prif god cloi bob tro yn galluogi'r modd meistr

# #20102
source: or copy from default?
cy: neu gopïo o'r rhagosodedig?

# #20103
source: Save changes to profile?
cy: Cadw'r newidiadau i'r proffil?

# #20104
source: Old settings found.
cy: Wedi canfod hen osodiadau.

# #20105
source: Do you want to use them?
cy: Hoffech chi eu defnyddio?

# #20106
source: Old media sources found.
cy: Wedi canfod hen ffynonellau cyfrwng.

# #20107
source: Separate (locked)
cy: Ar wahân (ar glo)

# #20108
source: Root
cy: Gwraidd

# #20109
source: Zoom
cy: Chwyddo

# #20110
source: UPnP settings
cy: Gosodiadau UPnP

# #20111
source: Autostart UPnP client
cy: Awtogychwyn cleient UPnP

# #20112
source: Last login: %s
cy: Mewngofnodiad diwethaf: %s

# #20113
source: Never logged on
cy: Byth wedi ei fewngofnodi

# #20114
source: Profile %i / %i
cy: Proffil %i / %i

# #20115
source: User login / Select a profile
cy: Mewngofnodiad defnyddiwr / Dewis proffil

# #20116
source: Use lock on login screen
cy: Defnyddio clo ar sgrin mewngofnodi

# #20117
source: Invalid lock code.
cy: Cod cloi annilys.

# #20118
source: This requires the master lock to be set.
cy: Mae hwn angen prif glo i'w osod.

# #20119
source: Would you like to set it now?
cy: Hoffech chi ei osod nawr?

# #20120
source: Loading program information
cy: Llwytho gwybodaeth rhaglen

# #20121
source: Party on!
cy: Partiwch!

# #20122
source: True
cy: Gwir

# #20123
source: Mixing drinks
cy: Cymysgu diodydd

# #20124
source: Filling glasses
cy: Llenwi gwydrau

# #20125
source: Logged on as
cy: Mewngofnodi fel

# #20126
source: Log off
cy: Algofnodi

# #20128
source: Go to root
cy: Mynd i'r gwraidd

# #20129
source: Weave
cy: Gwead

# #20130
source: Weave (inverted)
cy: Gwead (o chwith)

# #20131
source: Blend
cy: Cymysgedd

# #20132
source: Restart video
cy: Ailgychwyn fideo

# #20133
source: Edit network location
cy: Golygu lleoliad rhwydwaith

# #20134
source: Remove network location
cy: Tynnu lleoliad rhwydwaith

# #20135
source: Do you want to scan the folder?
cy: Hoffech chi sganio'r ffolder?

# #20136
source: Memory unit
cy: Uned cof

# #20137
source: Memory unit mounted
cy: Uned cof wedi ei arosod

# #20138
source: Unable to mount memory unit
cy: Methu arosod uned cof

# #20139
source: In port %i, slot %i
cy: Ym mhorth %i, slot %i

# #20140
source: Lock screensaver
cy: Cloi'r arbedwr sgrin

# #20141
source: Set
cy: Gosod

# #20142
source: Username
cy: Enw defnyddiwr

# #20143
source: Enter password for
cy: Rhowch gyfrinair ar gyfer

# #20144
source: Shutdown timer
cy: Diffodd yr amserydd

# #20145
source: Shutdown interval (in minutes)
cy: Cyfnod cau (mewn munudau)

# #20146
source: Started, shutdown in %im
cy: Cychwynwyd, cau ymhen %im

# #20147
source: Shutdown in 30 minutes
cy: Cau ymhen 30 munud

# #20148
source: Shutdown in 60 minutes
cy: Cau ymhen 60 munud

# #20149
source: Shutdown in 120 minutes
cy: Cau ymhen 120 munud

# #20150
source: Custom shutdown timer
cy: Amserydd cau cyfaddas

# #20151
source: Cancel shutdown timer
cy: Diddymu amserydd cau

# #20152
source: Lock preferences for %s
cy: Gosodiadau clo ar gyfer %s

# #20153
source: Browse...
cy: Pori...

# #20154
source: Summary information
cy: Crynodeb gwybodaeth

# #20155
source: Storage information
cy: Gwybodaeth storio

# #20156
source: Hard disk information
cy: Gwybodaeth disg caled

# #20157
source: DVD-ROM information
cy: Gwybodaeth DVD-ROM

# #20158
source: Network information
cy: Gwybodaeth rhwydwaith

# #20159
source: Video information
cy: Gwybodaeth fideo

# #20160
source: Hardware information
cy: Gwybodaeth caledwedd

# #20161
source: Total
cy: Cyfanswm

# #20162
source: Used
cy: Defnyddiwyd

# #20163
source: of
cy: o

# #20164
source: Locking not supported
cy: Nid yw cloi'n cael ei gynnal

# #20165
source: Not locked
cy: Heb ei gloi

# #20166
source: Locked
cy: Clowyd

# #20167
source: Frozen
cy: Rhewi

# #20168
source: Requires reset
cy: Angen ei ailosod

# #20169
source: Week
cy: Wythnos

# #20170
source: Line
cy: Llinell

# #20171
source: Windows network (SMB)
cy: Rhwydwaith Windows (SMB)

# #20172
source: XBMSP server
cy: Gweinydd AXBMSP

# #20173
source: FTP server
cy: Gweinydd FTP

# #20174
source: iTunes music share (DAAP)
cy: Rhaniad cerddoriaeth iTunes (DAAP)

# #20175
source: UPnP server
cy: Gweinydd UPnP

# #20176
source: Show video info
cy: Dangos gwybodaeth fideo

# #20177
source: Done
cy: Gorffen

# #20180
source: Symbols
cy: Symbolau

# #20183
source: Reload skin
cy: Ail lwytho'r croen

# #20184
source: Rotate pictures using EXIF information
cy: Troi lluniau gan ddefnyddio gwybodaeth EXIF

# #20185
source: Use poster view styles for TV shows
cy: Defnyddio golwg poster ar gyfer rhaglenni teledu

# #20186
source: Please wait
cy: Arhoswch

# #20188
source: Announce library updates via UPnP
cy: Cyhoeddi diweddariadau llyfrgell drwy UPnP

# #20189
source: Enable auto scrolling for plot & review
cy: Galluogi awtosgrolio ar gyfer y stori a'r adolygiadau

# #20190
source: Custom
cy: Cyfaddasu

# #20191
source: Enable debug logging
cy: Galluogi cofnodi dadfygio

# #20192
source: Download additional information during updates
cy: Llwytho i lawr gwybodaeth ychwanegol yn ystod diweddariadau

# #20193
source: Default service for album information
cy: Gwasanaeth rhagosodedig ar gyfer gwybodaeth albwm

# #20194
source: Default service for artist information
cy: Gwasanaeth rhagosodedig ar gyfer gwybodaeth artist

# #20195
source: Change scraper
cy: Newid crafwr

# #20196
source: Export music library
cy: Allforio'r llyfrgell cerddoriaeth

# #20197
source: Import music library
cy: Mewnforio llyfrgell cerddoriaeth

# #20198
source: No artist found!
cy: Heb ganfod artist!

# #20199
source: Downloading artist info failed
cy: Methodd llwytho artist i lawr

# #20220
source: Override song tags with online information
cy: Trosysgrifennu tagiau caneuon gyda gwybodaeth ar-lein

# #20221
source: With this enabled, any information that is downloaded for albums and artists will override anything you have set in your song tags, such as genres, year, song artists etc. Useful if you have MusicBrainz identifiers in your song tags.
cy: Pan mae hwn wedi ei alluogi, bydd unrhyw wybodaeth sy'n cael ei lwytho i awr am albymau ac artistiaid yn cael ei ddefnyddio yn lle'r hyn sydd wedi ei osod ar dagiau caneuon, megis mathau, blwyddyn, artistiaid caneuon ac ati. Defnyddiol os oes gennych ddynodwyr MusicBrainz yn eich tagiau caneuon.

# #20240
source: Android music
cy: Cerddoriaeth Android

# #20241
source: Android videos
cy: Fideos Android

# #20242
source: Android pictures
cy: Lluniau Android

# #20243
source: Android photos
cy: Lluniau Android

# #20244
source: Android Apps
cy: Apiau Android

# #20250
source: Party on! (videos)
cy: Partio! (fideo)

# #20251
source: Mixing drinks (videos)
cy: Cymysgu diodydd (fideo)

# #20252
source: Filling glasses (videos)
cy: Llenwi gwydrau (fideo)

# #20253
source: WebDAV server (HTTP)
cy: Gweinydd WebDAV (HTTP)
