Repository: xbmc/xbmc
Catalog: language/Welsh/strings.po
Languages: cy

# #22037
source: Show song selector automatically
cy: Dangos dewisydd caeuon yn awtomatig

# #22038
source: Export karaoke titles...
cy: Allforio teitlau kareoke...

# #22039
source: Enter song number
cy: Rhowch rhif cân

# #22040
source: white/green
cy: gwyn/gwyrdd

# #22041
source: white/red
cy: gwyn/coch

# #22042
source: white/blue
cy: gwyn/glas

# #22043
source: black/white
cy: du/gwyn

# #22079
source: Default select action
cy: Gweithred rhagosodedig

# #22080
source: Choose
cy: Dewis

# #22081
source: Show Information
cy: Dangos Gwybodaeth

# #22082
source: More...
cy: Rhagor...

# #22083
source: Play all
cy: Chwarae popeth

# #23049
source: Teletext not available
cy: Nid yw teletestun ar gael

# #23050
source: Activate Teletext
cy: Gweithredu Teletestun

# #23051
source: Part %i
cy: Rhan %i

# #23052
source: Buffering %i bytes
cy: Byffro %i beit

# #23053
source: Stopping
cy: Atal

# #23054
source: Running
cy: Rhedeg

# #23055
source: Scale Teletext to 4:3
cy: Graddio Teletestun i 4:3

# #23100
source: External Player Active
cy: Chwaraewr Allanol yn Weithredol

# #23101
source: Click OK to terminate the player
cy: Clicio Iawn i ddiffodd y chwaraewr

# #23104
source: Click OK when playback has ended
cy: Cliciwch Iawn pan fydd chwarae wedi gorffen

# #24000
source: Add-on
cy: Ychwanegyn

# #24001
source: Add-ons
cy: Ychwanegion

# #24002
source: Add-on options
cy: Dewisiadau Ychwanegion

# #24003
source: Add-on Information
cy: Gwybodaeth am Ychwanegion

# #24005
source: Media sources
cy: Ffynonellau cyfryngau

# #24007
source: Movie information
cy: Gwybodaeth am ffilmiau

# #24008
source: Screensaver
cy: Arbedwr sgrin

# #24009
source: Script
cy: Sgript

# #24010
source: Visualisation
cy: Delweddu

# #24011
source: Add-on repository
cy: Storfa ychwanegion

# #24012
source: Subtitles
cy: Isdeitlau

# #24013
source: Lyrics
cy: Geiriau caneuon

# #24014
source: TV information
cy: Gwybodaeth am Deledu

# #24015
source: Music video information
cy: Gwybodaeth am fideo cerddoriaeth

# #24016
source: Album information
cy: Gwybodaeth am yr albwm

# #24017
source: Artist information
cy: Gwybodaeth am yr artist

# #24018
source: Services
cy: Gwasanaethau

# #24019
source: PVR clients
cy: Clientiaid Recordydd

# #24020
source: Configure
cy: Ffurfweddu

# #24021
source: Disable
cy: Analluogi

# #24022
source: Enable
cy: Galluogi

# #24023
source: Disabled
cy: Analluogwyd

# #24024
source: Add-on disabled
cy: Ychwanegyn wedi ei analluogi

# #24027
source: Weather
cy: Tywydd

# #24028
source: Weather.com (standard)
cy: Weather.com (safonol)

# #24029
source: Service for weather information
cy: Gwasanaeth gwybodaeth am y tywydd

# #24030
source: This Add-on can not be configured
cy: Nid oes modd ffurfweddu'r Ychwanegyn hwn

# #24031
source: Error loading settings
cy: Gwall wrth lwytho gosodiadau

# #24032
source: All Add-ons
cy: Pob Ychwanegyn

# #24033
source: Get Add-ons
cy: Estyn Ychwanegion

# #24034
source: Check for updates
cy: Gwirio am ddiweddariadau

# #24035
source: Force refresh
cy: Gorfodi adnewyddu

# #24036
source: Change log
cy: Newid mewngofnod

# #24037
source: Uninstall
cy: Dadosod

# #24038
source: Install
cy: Gosod

# #24039
source: Disabled Add-ons
cy: Ychwanegion Analluogwyd

# #24040
source: (Clear the current setting)
cy: (Clirio'r gosodiadau cyfredol)

# #24041
source: Install from zip file
cy: Gosod o ffeil zip

# #24042
source: Downloading %i%%
cy: Llwytho %i%% i lawr

# #24043
source: Available Updates
cy: Diweddariadau ar Gael

# #24044
source: Dependencies not met. Please contact Add-on author.
cy: Nid yw'r ddibyniaeth wedi ei gyflawni. Cysylltch ag awdur yr ychwanegyn

# #24045
source: Add-on does not have the correct structure
cy: Nid oes gan yr Ychwanegyn y strwythur cywir

# #24046
source: %s is used by the following installed Add-on(s)
cy: % i'w ddefnyddio gan yr Ychwanegion canlynol

# #24047
source: This Add-on cannot be uninstalled
cy: Nid oes modd dadosod yr ychwanegyn hwn

# #24048
source: Rollback
cy: Camu nôl

# #24049
source: Incompatible
cy: Anghymarus

# #24050
source: Available Add-ons
cy: Ychwanegion ar Gael

# #24051
source: Version:
cy: Fersiwn:

# #24052
source: Disclaimer
cy: Gwadiad

# #24053
source: License:
cy: Trwydded:

# #24054
source: Changelog
cy: Cofnod newid

# #24055
source: Check for updates
cy: Gwirio am ddiweddariadau

# #24056
source: Last updated %s
cy: Diweddarwyd diwethaf %s

# #24059
source: Would you like to enable this Add-on?
cy: Hoffech chi alluogi'r Ychwanegyn hwn?

# #24060
source: Would you like to disable this Add-on?
cy: Hoffech chi analluogi'r Ychwanegyn hwn?

# #24061
source: Add-on update available!
cy: Mae diweddariad i'r Ychwanegyn ar gael!

# #24062
source: Enabled Add-ons
cy: Ychwanegion Galluogwyd

# #24063
source: Auto update
cy: Awto diweddaru

# #24064
source: Add-on enabled
cy: Ychwanegyn wedi ei alluogi

# #24065
source: Add-on updated
cy: Ychwanegyn wedi'i ddiweddaru

# #24066
source: Cancel Add-on download?
cy: Diddymu llwytho Ychwanegion i lawr?

# #24067
source: Currently downloading Add-ons
cy: Ychwanegion sy'n cael eu llwytho i lawr

# #24068
source: Update available
cy: Dieddariad ar gael

# #24069
source: Update
cy: Diweddaru

# #24070
source: Add-on could not be loaded.
cy: Nid oedd modd llwytho Ychwanegyn.

# #24071
source: An unknown error has occurred.
cy: Digwyddodd gwall anhysbys.

# #24072
source: Settings required
cy: Gosodiadau gofynnol

# #24073
source: Could not connect
cy: Methu cysylltu

# #24074
source: Needs to restart
cy: Angen ailddechrau

# #24075
source: Disable
cy: Analluogi

# #24076
source: Add-on Required
cy: Mae Angen Ychwanegyn

# #24080
source: Try to reconnect?
cy: Ceisiwch ailgysylltu?

# #24081
source: Helper Add-ons
cy: Ychwanegion Cynorthwyol

# #24082
source: Add-on libraries
cy: Llyfrgelloedd ychwanegion

# #24083
source: Information libraries
cy: Llyfrgelloedd gwybodaeth

# #24084
source: Visualisation libraries
cy: Llyfrgelloedd delweddu

# #24089
source: Add-on restarts
cy: Ailgychwyn Ychwanegion

# #24090
source: Lock Add-on manager
cy: Cloi rheolwr Ychwanegion

# #24091
source: This Add-on cannot be disabled
cy: Nid oes modd analluogi'r Ychwanegyn hwn

# #24094
source: (current)
cy: (cyfredol)

# #24095
source: (blacklisted)
cy: (negyddol)

# #24096
source: Add-on is incompatible or has been marked broken in repository.
cy: Mae'r Ychwanegyn yn anghymarus neu wedi ei nodi ei fod wedi torri yn y storfa.

# #24097
source: Would you like to disable it on your system?
cy: Hoffech chi ei anablu yn eich system?

# #24098
source: Broken
cy: Wedi Torri

# #24099
source: Would you like to switch to this skin?
cy: Hoffech chi newid i'r croen yma?

# #24100
source: To use this feature you must download an Add-on:
cy: I ddefnyddio'r nodwedd yma rhaid llwytho i lawr Ychwanegyn:

# #24101
source: Would you like to download this Add-on?
cy: Hoffech chi lwytho i lawr yr Ychwanegyn?

# #24102
source: Unable to load skin
cy: Methu llwytho croen

# #24103
source: Skin is missing some files
cy: Mae rhai ffeiliau ar goll yn y croen

# #24104
source: Add-on is incompatible due to unmet dependencies.
cy: Mae'r ychwanegyn yn anghymarus oherwydd dibyniaethau coll.

# #24105
source: Pause when searching for subtitles
cy: Oedi wrth chwilio am isdeitlau

# #24106
source: Specify where downloaded subtitles should be saved, the same location as the video or a custom location.
cy: Pennu lle bydd isdeitlau'n cael eu cadw, yr un lleoliad â'r fideo neu leoliad arall.

# #24107
source: Searching for subtitles ...
cy: Chwilio am isdeitlau ...

# #24108
source: %d subtitles found
cy: %d isdeitl wedi eu canfod

# #24109
source: No subtitles found
cy: Heb ganfod isdeitlau

# #24110
source: Downloading subtitles ...
cy: Llwytho isdeitlau i lawr ...

# #24111
source: Languages to download subtitles for
cy: Llwytho isdeitlau i awr ar gyfer yr ieithoedd hyn

# #24112
source: Set languages to use when searching for subtitles. Not all subtitle services will use all languages.
cy: Gosod yr iaith i'w defnyddio wrth chwilio am isdeitlau. Nid yw pob gwasanaeth isdeitlo'n defnyddio pob iaith.

# #24113
source: Failed to download subtitle
cy: Methwyd llwytho i lawr isdeitlau

# #24114
source: No subtitle services installed
cy: Heb osod gwasanaeth isdeitlo

# #24115
source: Subtitle storage location
cy: Lleoliad cadw isdeitlau

# #24116
source: Default TV Service
cy: Gwasanaeth Teledu Rhagosodedig

# #24117
source: Select service that will be used as default to search for TV Show subtitles.
cy: Dewis gwasanaeth fydd yn cael ei ddefnyddio fel y rhagosodedig i chwilio am isdeitlau sioeau teledu.

# #24118
source: Default Movie Service
cy: Gwasanaeth Ffilmiau Rhagosodedig

# #24119
source: Select service that will be used as default to search for Movie subtitles.
cy: Dewis gwasanaeth fydd yn cael ei ddefnyddio fel y rhagosodedig i chwilio am isdeitlau ffilmiau.

# #24120
source: Manual search string
cy: Llinyn chwilio â llaw

# #24121
source: Enter search string
cy: Rhowch llinyn chwilio

# #24122
source: Update all
cy: Diweddaru popeth

# #24123
source: Pause the current video while searching for subtitles and resume once the subtitle is available.
cy: Oedi'r fideo cyfredol wrth chwilio am isdeitlau ac ailgychwyn pan fydd isdeitlau ar gael.

# #24124
source: Next to the video
cy: Nesaf i'r fideo

# #24125
source: Custom location
cy: Lleoliad cyfaddas

# #24126
source: Auto download first subtitle
cy: Awto llwytho i lawr yr isdeitl cyntaf

# #24127
source: Automatically download first subtitle from the search result list
cy: Llwytho'r isdeitl cyntaf yn awtomatig o'r rhestr canlyniadau chwilio

# #25000
source: Notifications
cy: Hysbysiadau

# #25001
source: Hide foreign
cy: Cuddio'r dieithr

# #25002
source: Select from all titles ...
cy: Dewis o'r holl deitlau ...

# #25003
source: Show Blu-ray menus
cy: Dangos dewislenni Blu-ray

# #25004
source: Play main title: %d
cy: Chwarae'r prif deitl: %d

# #25005
source: Title: %d
cy: Teitl: %d

# #25006
source: Select playback item
cy: Dewis eitem chwarae nôl

# #25007
source: Chapters: %u - duration: %s
cy: Penawdau: %u - hyd: %s

# #25008
source: Playback of Blu-ray failed
cy: Methodd chwarae'r Blu-ray

# #25009
source: The menu of this Blu-ray is not supported
cy: Nid yw ymddygiad y Blu-ray yma'n cael ei gynnal

# #29800
source: Library Mode
cy: Modd llyfrgell

# #29801
source: QWERTY keyboard
cy: Bysellfwrdd QWERTY

# #29802
source: Passthrough Audio in use
cy: Yn defnyddio Sain Trwodd

# #33001
source: Trailer quality
cy: Ansawdd hysbysiad

# #33002
source: Stream
cy: Ffrydio

# #33003
source: Download
cy: Llwytho i lawr

# #33004
source: Download & play
cy: Llwytho i lawr a chwarae

# #33005
source: Download & save
cy: Llwytho i lawr a chadw

# #33006
source: Today
cy: Heddiw

# #33007
source: Tomorrow
cy: Ddoe

# #33008
source: Saving
cy: Wrthi'n Cadw

# #33009
source: Copying
cy: Copïo

# #33010
source: Set download directory
cy: Gosod cyfeiriadur llwytho i lawr

# #33011
source: Search duration
cy: Cyfnod chwilio

# #33012
source: Short
cy: Byr

# #33013
source: Long
cy: Hir

# #33014
source: Use DVD player instead of regular player
cy: Defnyddio chwaraewr DVD yn lle chwaraewr arferol

# #33015
source: Ask for download before playing video
cy: Gofyn am ei lwytho ilawr cyn chwarae fideo

# #33016
source: Clips
cy: Clipiau

# #33017
source: Restart plug-in to enable
cy: Ail gychwyn yr ategyn i'w alluogi

# #33018
source: Tonight
cy: Heno

# #33019
source: Tomorrow Night
cy: Nos Yfory

# #33020
source: Condition
cy: Cyflwr

# #33021
source: Precipitation
cy: Dyodiad

# #33022
source: Precip
cy: Dyodiad

# #33023
source: Humid
cy: Lleithder

# #33024
source: Feels
cy: Teimlo fel

# #33025
source: Observed
cy: Gwelwyd

# #33026
source: Departure from normal
cy: Gwahanol i'r arfer

# #33027
source: Sunrise
cy: Codiad Haul

# #33028
source: Sunset
cy: Machlud Haul

# #33029
source: Details
cy: Manylion

# #33030
source: Outlook
cy: Rhagolygon

# #33031
source: Coverflow
cy: Llif Cloriau

# #33032
source: Translate text
cy: Cyfieithu testun

# #33033
source: Map list %s category
cy: Categori %s rhestr mapio

# #33034
source: 36 Hour
cy: 36 Awr

# #33035
source: Maps
cy: Mapio

# #33036
source: Hourly
cy: Bob Awr

# #33037
source: Weekend
cy: Penwythnos

# #33038
source: %s day
cy: %s diwrnod

# #33049
source: Alert
cy: Rhybudd

# #33050
source: Alerts
cy: Rhybyddion

# #33051
source: Choose Your
cy: Dewis Eich

# #33052
source: Check
cy: Gwirio

# #33053
source: Configure the
cy: Ffurfweddu'r

# #33054
source: Seasons
cy: Tymhorau

# #33055
source: Use your
cy: Defnyddiwch eich

# #33056
source: Watch your
cy: Gwyliwch eich

# #33057
source: Listen to
cy: Gwrando ar

# #33058
source: View your
cy: Gweld eich

# #33059
source: Configure the
cy: Ffurfweddu'r

# #33060
source: Power
cy: Pŵer

# #33061
source: Menu
cy: Dewislen

# #33062
source: Play the
cy: Chwarae

# #33063
source: Options
cy: Dewisiadau

# #33065
source: Editor
cy: Golygydd

# #33066
source: About your
cy: Ynghylch eich

# #33067
source: Star rating
cy: Graddio

# #33068
source: Background
cy: Cefndir

# #33069
source: Backgrounds
cy: Cefndiroedd

# #33070
source: Custom background
cy: Cefndir cyfaddas

# #33071
source: Custom backgrounds
cy: Cefndiroedd cyfaddas

# #33072
source: View Readme
cy: Gweld y Canllaw

# #33073
source: View Changelog
cy: Gweld y Cofnod Newid

# #33074
source: This version of %s requires an
cy: Mae'r fersiwn yma o %s angen

# #33075
source: Kodi revision of %s or greater to run.
cy: diweddariad %s neu well o Kodi i redeg.

# #33076
source: Please update Kodi.
cy: Diweddarwch Kodi.

# #33077
source: No data found!
cy: Heb ganfod data!

# #33078
source: Next page
cy: Tudalen nesaf

# #33079
source: Love
cy: Caru

# #33080
source: Hate
cy: Casáu

# #33081
source: This file is stacked, select the part you want to play from.
cy: Mae'r ffeil hon wedi ei stacio, dewiswch y rhan i chwarau ohoni.

# #33082
source: Path to script
cy: Llwybr i'r sgript

# #33083
source: Enable custom script button
cy: Galluogi botwmsgript cyfaddas

# #33084
source: Auto login
cy: Awto mewngofnodi

# #33100
source: Failed to start
cy: Methwyd cychwyn

# #33101
source: Webserver
cy: Gweinydd gwe

# #33102
source: Event Server
cy: Gweinydd Digwyddiad

# #33103
source: Remote communication server
cy: Gweinydd cyfathrebu pell

# #33200
source: Detected New Connection
cy: Cysylltiad Newydd wedi ei Ganfod

# #34006
source: MPEG-4 Audio (FFmpeg M4A AAC)
cy: Sain MPEG-4 (FFmpeg M4A AAC)

# #34007
source: Windows Media Audio 2 (FFmpeg wmav2)
cy: Sain Windows Media 2 (FFmpeg wmav2)

# #34100
source: Number of channels
cy: Nifer o sianeli

# #34111
source: Select the behaviour when no sound is required for either playback or GUI sounds. [Always] - continuous inaudible signal is output, this keeps the receiving audio device alive for any new sounds, however this might also block sound from other applications. [1- 10 Minutes] - same as Always except that after the selected period of time audio enters a suspended state [Off] - audio output enters a suspended state. Note - sounds can be missed if audio enters suspended state.
cy: Dewiswch yr ymddygiad pan na fydd angen sain ar gyfer chwarae neu synau'r rhyngwyneb. [Drwy'r Amser] - sain anhyglyw barhaus yn cael ei allbynnu, mae hyn yn cadw'r ddyfais sain yn fyw ar gyfer unrhyw sain newydd, er y gall rwystro sain o raglenni eraill. [1 - 10 munud] - yr un a Drwy'r Amser ond ar ôl amser penodol mae sain yn mynd i gyflwr gohiriedig. [Diffodd] - mae'r sain mewn cyflwr gohiriedig. Nodyn - gall seiniau gael eu colli os yw'n mynd i gyflwr gohiriedig.

# #34120
source: Play GUI sounds
cy: Chwarae sain GUI

# #34121
source: Only when playback stopped
cy: Dim ond pan fydd chwarae wedi ei atal

# #34122
source: Always
cy: Pob tro

# #34123
source: Never
cy: Byth

# #34201
source: Can't find a next item to play
cy: Methu canfod yr eitem nesaf i'w chwarae

# #34202
source: Can't find a previous item to play
cy: Methu canfod yr eitem flaenoro i'w chwarae

# #34300
source: Failed to start Zeroconf
cy: Methwyd cychwyn Zeroconf

# #34301
source: Is Apple's Bonjour Service installed? See log for more info.
cy: A yw gwasanaeth Apple Bonjour wedi ei osod? Gw. cofnod am ragor o wybodaeth.

# #34302
source: AirPlay requires Zeroconf to be enabled.
cy: Mae angen Zeroconf ar AirPlay

# #34303
source: Unable to stop Zeroconf
cy: Methu atal Zeroconf

# #34304
source: AirPlay and AirTunes depend on Zeroconf running.
cy: Mae AirPlay ac AirTunes angen cael Zeroconf yn rhedeg.

# #34400
source: Video Rendering
cy: Rendro Fideo

# #34401
source: Failed to init video filters/scalers, falling back to bilinear scaling
cy: Methwyd ymgychwyn hidlau/graddwyr fideo, mynd nôl at raddio deulinellol

# #34402
source: Failed to initialise audio device
cy: Methu cychwyn y ddyfais sain

# #34403
source: Check your audiosettings
cy: Gwiriwch eich awtoddewisiadau

# #34404
source: Use gestures for navigation:
cy: Defnyddio ystumiau ar gyfer symud:

# #34405
source: 1 finger swipe left,right,up,down for cursors
cy: Llusgo 1 bys i'r chwith, de, fyny, lawr i

# #34406
source: 2 finger swipe left for backspace
cy: Llusgo i'r chwith 2 fys ar gyfer bckspace

# #34407
source: 1 finger single tap for enter
cy: Tap 1 bys ar gyfer Enter

# #34408
source: 2 finger single tap or 1 finger long press for contextmenu
cy: Tap unigol 2 fys neu pwyso hir 1 bys ar gyfer y ddewislen cyd-destun

# #35000
source: Peripherals
cy: Offer ategol

# #35001
source: Generic HID device
cy: Dyfais HID generig

# #35002
source: Generic network adaptor
cy: Addasydd rhwydwaith cyffredinol

# #35003
source: Generic disk
cy: Disg generig

# #35004
source: There are no settings available for this peripheral.
cy: Nid oes gosodiadau ar gael ar gyfer yr offeryn ymylol hwn.

# #35005
source: New device configured
cy: Ffurfweddwyd dyfais newydd

# #35006
source: Device removed
cy: Tynnwyd y ddyfais

# #35007
source: Keymap to use for this device
cy: Map bysell ar gyfer defnydd y ddyfais hon

# #35008
source: Keymap enabled
cy: Galluogwyd map bysell

# #35009
source: Do not use the custom keymap for this device
cy: Peidio defnyddio'r map bysell cyfaddas ar gyfer y ddyfais hon

# #35100
source: Enable joystick and gamepad support
cy: Galluogi cynnal ffon hwyl a pad gemau

# #35102
source: Disable joystick when this device is present
cy: Anablu'r ffon hud pan fydd y ddyfais hon ar gael

# #35500
source: Location
cy: Lleoliad

# #35501
source: Class
cy: Dosbarth

# #35502
source: Name
cy: Enw

# #35503
source: Vendor
cy: Gwerthwr

# #35504
source: Product ID
cy: Enw Cynnyrch

# #36000
source: Pulse-Eight CEC adaptor
cy: Addasydd CEC Pulse-Eight

# #36002
source: Switch to keyboard side command
cy: Newid i orchymyn bysellfwrdd

# #36003
source: Switch to remote side command
cy: Newid i orchymyn rheolydd pell

# #36004
source: Press "user" button command
cy: Pwyso botwm gorchymyn "defnyddiwr"

# #36005
source: Enable switch side commands
cy: Galluogi gorchymyn newid och

# #36006
source: Could not open the adaptor
cy: Methu agor yr addasydd

# #36007
source: Devices to power on when starting Kodi
cy: Dyfais i gychwyn wrth gychwyn Kodi

# #36008
source: Devices to power off when stopping Kodi
cy: Dyfais i ddiffodd wrth ddiffodd Kodi

# #36009
source: Put devices in standby mode when activating screensaver
cy: Rhoi'r ddyfais yn y modd aros wrth weithredu'r arbedwr sgrin

# #36010
source: Wake devices when deactivating screensaver
cy: Deffro dyfeisiau wrth atal yr arbedwr sgrin

# #36011
source: Could not detect the CEC com port. Set it up manually.
cy: Methu canfod y porth CEC com. Ei osod gyda llaw.

# #36012
source: Could not initialise the CEC adaptor. Please check your settings.
cy: Methu cychwyn yr addasydd CEC. Gwiriwch eich gosodiadau.

# #36015
source: HDMI port number
cy: Rhif porth HDMI

# #36016
source: Connected
cy: Cysylltwyd

# #36017
source: Could not initialise the CEC adaptor: libCEC was not found on your system.
cy: Methu ymgychwyn yr addasydd CEC: nid yw libCEC ar eich system.

# #36018
source: Use the TV's language setting
cy: Defnyddio gosodiadau iaith eich teledu

# #36019
source: Connected to HDMI device
cy: Cysylltwyd i ddyfais HDMI

# #36020
source: Make Kodi the active source when starting
cy: Gwneud Kodi y ffynhonnell weithredol wrth gychwyn

# #36021
source: Physical address (overrules HDMI port)
cy: Cyfeiriad ffisegol (anwybyddu porth HDMI)

# #36022
source: COM port (leave empty unless needed)
cy: Porth COM (gadael yn wag onibai fod ei angen)

# #36023
source: Configuration updated
cy: Diweddariad ffurfweddu

# #36024
source: Failed to set the new configuration. Please check your settings.
cy: Methwyd gosod y ffurfweddiad newydd. Gwiriwch eich gosodiadau.

# #36025
source: Send 'inactive source' command when stopping Kodi
cy: Anfon gorchymyn 'ffynhonell anweithredol' wrth atal Kodi

# #36026
source: Put devices in standby mode when putting the PC in standby
cy: Gosod y ddyfais yn y modd oedi pan yn gosod y PC yn y modd oedi

# #36027
source: This device needs servicing
cy: Mae angen gwasanaethu'r ddyfais

# #36028
source: Ignore
cy: Anwybyddu

# #36029
source: When the TV is switched off
cy: Pan mae'r teledu wedi ei diffodd

# #36030
source: Connection lost
cy: Collwyd y cysylltiad

# #36031
source: This user does not have permissions to open the CEC adaptor
cy: Nid oes gan y defnyddiwr hwn hawl i agor yr addasydd CEC

# #36032
source: The port is busy. Only one program can access the CEC adaptor
cy: Mae'r porth yn brysur. Dim ond un rhaglen gall gael mynediad i'r addasydd CEC

# #36033
source: Pause playback when switching to another source
cy: Oedi chwarae wrth newid i ffynhonell arall

# #36035
source: Always
cy: Bob tro

# #36036
source: On start/stop
cy: Ymlaen Cychwyn/Atal

# #36037
source: TV
cy: Teledu

# #36038
source: Amplifier / AVR device
cy: Dyfais mwyhadur / AVR

# #36039
source: TV and AVR device (explicit)
cy: Dyfais teledu ac AVR (penodol)

# #36040
source: Unsupported libCEC interface version. %x is lower than the version Kodi supports (%x)
cy: Fersiwn rhyngwyneb libCEC nad yw'n cael ei gynnal. Mae %x yn is na'r fersiwn mae Kodi yn ei gynnal (%x)

# #36041
source: * Item folder
cy: * Ffolder eitem

# #36042
source: Use limited colour range (16-235)
cy: Defnyddiwch yr ystod lliw cyfyng (16-235)

# #36101
source: Change the look and feel of the user interface.
cy: Newidiwch liw a theimlad y rhyngwyneb defnyddiwr.

# #36102
source: Category containing all Skin related settings.
cy: Mae'r categori'n cynnwys holl osodiadau'r Croen.

# #36103
source: Select the skin for the user interface. This will define the look and feel of Kodi.
cy: Dewiswch y croen ar gyfer y rhyngwyneb defnyddiwr. Bydd hwn y diffinio golwg a theimlad Kodi.

# #36104
source: Change specific skin settings. The available options are dependent on the skin used.
cy: Newid gosodiadau penodol croen. Mae'r dewisiadau'n ddibynnol ar y croen sy'n cael ei ddefnyddio.

# #36105
source: Change the theme associated with your selected skin.
cy: Newid y thema sy'n gysylltiedig â'r croen rydych wedi ei dewis.

# #36106
source: Change the colours of your selected skin.
cy: Newid lliw'r croen rydych wedi ei dewis

# #36107
source: Choose the fonts displayed in the user interface. The font sets are configured by your skin.
cy: Dewiswch y ffontiau i'w defnyddio yn y rhyngwyneb defnyddiwr. Mae'r setiau ffont yn cael eu ffurfweddu gan eich croen.

# #36108
source: Resize the view of the user interface.
cy: Newid maint golwg y rhyngwyneb defnyddiwr.

# #36109
source: Select the media window that Kodi displays on startup.
cy: Dewis y ffenestr cyfrwng mae Kodi yn ei ddangos wrth gychwyn.

# #36110
source: Select or disable the sound scheme used in the user interface.
cy: Dewis neu anablu cynllun sain y rhyngwyneb defnyddiwr
