Repository: xbmc/xbmc
Catalog: language/Welsh/strings.po
Languages: cy

# #36111
source: Turn this off to remove the scrolling RSS news ticker.
cy: Difodd hwn i dynnu ticiwr sgrolio newyddion RSS.

# #36112
source: Edit the RSS feeds.
cy: Golygu'r ffrydiau RSS.

# #36113
source: Category containing all locale/regional settings.
cy: Categori'n cynnwys holl osodiadau'r locale/ardal.

# #36114
source: Chooses the language of the user interface.
cy: Dewis iaith y rhyngwyneb defnyddiwr.

# #36115
source: Select the formats for temperature, time and date. The available options depend on the selected language.
cy: Dewis y fformatau ar gyfer tymheredd, amser a dyddiad. Mae'r dewisiadau'n dibynnu ar yr iaith sydd wedi'i dewis.

# #36116
source: Choose which character set is used for displaying text in the user interface.
cy: Dewis pa set nodau i'w defnyddio ar gyfer dangos testun yn y rhyngwyneb defnyddiwr.

# #36117
source: Select country location.
cy: Dewis lleoliad gwlad.

# #36118
source: Select your current timezone.
cy: Dewis eich cylch amser cyfredol

# #36119
source: Select the default audio track when different language tracks are available.
cy: Dewis y trac sain arferol pan fydd traciau iaith gwahanol ar gael.

# #36120
source: Select the default subtitles when different languages are available.
cy: Dewis yr isdeitlau arferol pan fydd ieithoedd gwahanol ar gael.

# #36121
source: Category containing settings related to how file lists are displayed.
cy: Categori'n cynnwys golwg gosodiadau'r rhestrau ffeiliau.

# #36122
source: Display the (..) item in lists for visiting the parent folder.
cy: Dangos y (..) eitem mewn rhestrau ar gyfer ymweld â'r ffolder rhiant.

# #36123
source: Show file extensions on media files. For example, 'You Enjoy Myself.mp3' would be simply be shown as 'You Enjoy Myself'.
cy: Dangos estyniadau ffeiliau ar ffeiliau cyfrwng. Er enghraifft, bydd 'Cân Go Lew.mp3' yn cael ei ddangos fel 'Cân Go Lew.mp3'.

# #36124
source: Ignore certain tokens during sort operations. For example, 'The Simpsons' would be sorted as 'Simpsons'.
cy: Anwybyddu rhai tocynau yn ystod gweithredoedd didoli. Er enghraifft, byddai 'The Simpsons' yn cael eu didoli fel 'Simpsons'.

# #36125
source: Allow files to be deleted and renamed through the user interface, via the contextual menu (press C on a keyboard, for example, to bring up this menu).
cy: Caniatáu i ffeiliau gael eu dileu a'u hailenwi drwy'r rhyngwyneb defnyddiwr, drwy'r ddewislen cyd-destun (pwyso C ar y bysellfwrdd i agor y ddewislen hon)

# #36126
source: Show the add source button in root sections of the user interface.
cy: Dangos botwm ychwanegu ffynhonnell yn adrannau gwraidd y rhyngwyneb defnyddiwr.

# #36127
source: Show hidden files and directories when listing files.
cy: Dangos ffeiliau a chyfeiriaduron cudd wrth restru ffeiliau.

# #36128
source: Category containing all screensaver settings.
cy: Categori sy'n cynnwys holl osodiadau'r arbedwr sgrin.

# #36129
source: Set the amount of idle time required before displaying the screensaver.
cy: Gosod y cyfnod oedi cyn dangos yr arbedwr sgrin.

# #36130
source: Select the screensaver. Kodi will force the 'Dim' screensaver when fullscreen video playback is paused or a dialogue box is active.
cy: Dewis yr arbedwr sgrin. Bydd Kodi'n gorfodi'r arbedwr sgrin 'Pwl' pan fydd chwarae fideo sgrin lawn yn cael ei oedi neu fod blwch deialog yn fyw.

# #36131
source: Change specific screensaver settings. The available options are dependent on the screensaver used.
cy: Newid gosodiadau penodol yr arbedwr sgrin. Mae'r gosodiadau yn dibynnol ar ba arbedwr sgrin sy'n cael ei ddefnyddio.

# #36132
source: Preview the selected screensaver.
cy: Rhagolwg o'r arbedwr sgrin

# #36133
source: If music is being played, Kodi will start the selected visualisation instead of displaying the screensaver.
cy: Os oes cerddoriaeth y cael ei chwarae, bydd Kodi'n cychwyn y delweddu penodol yn dangos arbedwr sgrin.

# #36134
source: Dim the display when media is paused. Not valid for the 'Dim' screensaver mode.
cy: Pylu'r dangosydd pan mae cyfrwng yn cael ei oedi. Nid yw'n gweithio yn y modd arbedwr sgrin 'Pylu'

# #36135
source: No info available yet.
cy: Dim gwybodaeth ar gael ar hyn o bryd.

# #36136
source: No info available yet.
cy: Dim gwybodaeth ar gael ar hyn o bryd.

# #36137
source: No info available yet.
cy: Dim gwybodaeth ar gael ar hyn o bryd.

# #36138
source: Section that contains settings related to videos and how they are handled.
cy: Adran sy'n cynnwys gosodiadau sy'n perthyn i fideos a sut maen nhw'n cael eu trin.

# #36139
source: Category containing the settings for how the video library is handled.
cy: Categori sy'n cynnwys gosodiadau ar sut mae llyfrgell fideo'n cael ei drin.

# #36140
source: Enable the video library.
cy: Galluogi llyfrgell fideo.

# #36141
source: Show plot information for unwatched media in the Video Library.
cy: Dangos gwybodaeth am y stori ar gyfer cyfrwng heb ei wylio yn y Llyfrgell Fideo.

# #36143
source: Get thumbnails for actors when scanning media.
cy: Gweld lluniau bach actorion wrth sganio cyfryngau.

# #36144
source: Remove the TV show season node, toggles between 'If only one season' (default), 'Always' and 'Never'.
cy: Tynnu nod tymor sioeau teledu, newid rhwng 'Un tymor' (arferol), 'Pob tro' a 'Byth'.

# #36145
source: Group movies into 'Movie sets' when browsing the movie library.
cy: Casglu ffilmiau i 'Setiau ffilm' wrth bori'r llyfrgell ffilm.

# #36146
source: Check for new media files on Kodi startup.
cy: Edrych am ffeiliau cyfrwng newydd wrth gychwyn Kodi.

# #36147
source: Hide the library scanning progress bar during scans.
cy: Cuddio'r bar cynnydd sganio llyfrgell wrth sganio.

# #36148
source: Remove items from your library that can't be found (either renamed, deleted, or on removable storage that is currently unplugged).
cy: Tynnu eitemau o'ch llyfrgell nad ydynt i'w gweld (un ai wedi eu hailenwi, dileu neu ar storfa dynadwy sydd heb ei osod.)

# #36149
source: Export the Video Library database to XML files. This will optionally overwrite your current XML files.
cy: Allforio cronfa ddata'r Llyfrgell Fideo i ffeiliau XML. Bydd hyn o ddewis yn trosysgrifennu eich ffeiliau XML cyfredol.

# #36150
source: Import a XML file into the Video Library database.
cy: Mewnforio ffeil XML i gronfa ddata'r Llyfrgell Fideo.

# #36151
source: Category containing settings for how video playback is handled.
cy: Categori sy'n cynnwys gosodiadau ar sut mae chwarae fideo'n cael i drin.

# #36152
source: Enable automatic playback of the next file in the list.
cy: Galluogi chwarae'r ffeil nesaf ar y rhestr, yn awtomatig.

# #36153
source: Adjust the method used to process and display video.
cy: Addasu'r dull o brosesu a dangos fideo.

# #36154
source: Use high quality scalers when upscaling a video by at least this percentage.
cy: Defnyddio graddwyr ansawdd uchel wrth uwchraddio fideo o o leiaf y canran hwn.

# #36155
source: Enable VDPAU hardware decoding of video files, mainly used for NVIDIA graphics and in some circumstances AMD graphics.
cy: Galluogi dadgodio ffeiliau fideo gyda chaledwedd VDPAU, yn bennaf ar gyfer graffigau NVIDIA ac o dan rhai amgylchiadau graffigau AMD.

# #36156
source: Enable VAAPI hardware decoding of video files, mainly used for Intel graphics and in some circumstances AMD graphics.
cy: Galluogi dadgodio ffeiliau fideo gyda chaledwedd VAAPI, yn bennaf ar gyfer graffigau INTEL ac o dan rhai amgylchiadau graffigau AMD.

# #36158
source: Enable DXVA2 hardware decoding of video files.
cy: Galluogi dadgodio ffeiliau fideo gan galedwedd DXVA2.

# #36159
source: Enable CrystalHD decoding of video files.
cy: Galluogi dadgodio ffeiliau fideo gan galedwedd CrystalHD.

# #36160
source: Enable VDA hardware decoding of video files.
cy: Galluogi dadgodio ffeiliau fideo gan galedwedd VDA.

# #36161
source: Enable OpenMax hardware decoding of video files.
cy: Galluogi dadgodio ffeiliau fideo gan galedwedd OpenMax.

# #36162
source: Enable VideoToolbox hardware decoding of video files.
cy: Galluogi dadgodio ffeiliau fideo gan galedwedd VideoToolbox.

# #36163
source: Enable decoding of video files using pixel buffer objects.
cy: Galluogi dadgodio ffeiliau fideo gan ddefnyddio gwrthrychau byffer picsel.

# #36164
source: Allow the refresh rate of the display to be changed so that it best matches the video frame rate. This may yield smoother video playback.
cy: Caniatáu i'r raddfa adnewyddu'r dangosydd gael ei newid fel ei fod yn cyd-fynd orau gyda graddfa'r ffrâm fideo. Gall hyn ddarparu chwarae fideo llyfnach.

# #36165
source: Pause for a small amount of time during a refresh rate change.
cy: Oedi am ychydig bach yn ystod newid graddfa adnewyddu.

# #36166
source: Synchronise the video to the refresh rate of the monitor.
cy: Cydweddu'r fideo i raddfa adnewyddu'r dangosydd.

# #36167
source: Audio has to stay in sync, this can either be done by resampling, skipping/duplicating packets, or adjusting the clock if it gets out of sync too far.
cy: Rhaid i sain gydweddu, mae modd gwneud hyn drwy ailsamplo, hepgor/dyblygu pacedi neu newid y cloc os yw'n allan y ormodol.

# #36168
source: Maximum video speed adjust to match actual screen refresh rate.
cy: Newid cyflymder uchaf y fideo i raddfa adnewyddu'r sgrin.

# #36170
source: Allow video player to ignoring aspect ratio by a certain amount to fill a larger amount of the screen with video.
cy: Caniatáu i'r chwaraewr fideo anwybyddu cyfradd agwedd o rhyw hyn a hyn er mwyn llanw mwy o'r sgrin gyda fideo.

# #36171
source: Select the zoom level that 4:3 videos are shown on widescreen displays.
cy: Dewis lefel chwyddo fel bod fideos 4:3 yn gallu cael eu dangos ar sgrin lydan.

# #36173
source: Enable upscaling using VDPAU.
cy: Galluogi uwchraddio gan ddefnyddio VDPAU

# #36174
source: Enable Teletext when watching a live TV stream.
cy: Galluogi Teletestun wrth wylio llif teledu byw.

# #36175
source: Scale Teletext to 4:3 ratio.
cy: Graddio Teletestun i 4:3.

# #36176
source: Category containing settings for how video file lists are handled.
cy: Categori sy'n cynnwys gosodiadau ar sut i drin rhestrau ffeiliau video.

# #36177
source: Toggle between Choose, Play (default), Resume and Show Information. Choose will select an item, e.g. open a directory in files mode. Resume will automatically resume videos from the last position that you were viewing them, even after restarting the system.
cy: Toglo rhwng Dewis, Chwarae (rhagosodedig), Ailgychwyn a Dangos Gwybodaeth. Bydd dewis yn dewis eitem, e.e. agor cyfeiriadur ym modd ffeiliau. Bydd Ailgychwyn yn ailgychwyn fideos yn awtomatig o'r fan diwethaf, hyd yn oed ar ôl ailgychwyn y system.

# #36178
source: Extract thumbnails and metadata information such as codec and aspect ratio from videos.
cy: Tynnu gwybodaeth am luniau bach a metadata megis codec a chydraniad agwedd o fideos.

# #36179
source: When a file is scanned into the library it will display the metadata title instead of the file name.
cy: Pa fydd ffeil wedi ei sganio i'r llyfrgell bydd yn dangos teitl metadata yn lle enw'r ffeil.

# #36180
source: Extract thumbnails and information, such as codecs and aspect ratio, to display in Library Mode.
cy: Tynnu lluniau bach a gwybodaeth, megis codecs, cyfradd agwedd i'w dangos yn y Modd Llyfrgell.

# #36181
source: No info available yet.
cy: Dim gwybodaeth ar gael ar hyn o bryd.

# #36182
source: Combines multi-part video files, DVD folders, and movie folders down to a single item in non-library views.
cy: Cyfuno ffeiliau fideo rhannau lluosog, ffolderi DVD a ffolderi ffilmiau i un eitem mewn golwg nad yw'n llyfrgell.

# #36183
source: Removes the title, genre etc nodes from the library view. Selecting a category takes you straight to the title view.
cy: Tynnu teitl, math ac ati, o'r golwg llyfrgell. Bydd dewis y categori'n eich cymryd y syth i'r golwg teitl.

# #36184
source: Category containing settings for how subtitles are handled.
cy: Categori sy'n cynnwys gosodiadau ar sut mae isdeitlau'n cael eu trin.

# #36185
source: Set the font type to be used for subtitles.
cy: Gosod y math o ffont i'w ddefnyddio mewn isdeitlau

# #36186
source: Set the font size to be used for subtitles.
cy: Gosod maint y ffont i'w ddefnyddio ar gyfer isdeitlau.

# #36187
source: Set the font style to be used for subtitles.
cy: Gosod yr arddull ffont i'w ddefnyddio ar gyfer isdeitlau.

# #36188
source: Set the font colour to be used for subtitles.
cy: Gosod lliw'r ffont i'w ddefnyddio ar gyfer isdeitlau.

# #36189
source: Set the font character set to be used for subtitles.
cy: Gosod set nod y ffont i'w ddefnyddio ar gyfer isdeitlau

# #36190
source: Override ASS/SSA subtitles fonts.
cy: Disodli ffontiau isdeitlau ASS/SSA.

# #36191
source: Set a custom directory for your subtitles. This can be a file share.
cy: Gosod cyfeiriadur cyfaddas ar gyfer eich isdeitlau. Gall hyn fod yn rhaniad ffeiliau.

# #36192
source: Location of subtitles on the screen.
cy: Lleoliad isdeitlau ar y sgrin.

# #36193
source: Category containing settings for how DVDs are handled.
cy: Categori'n cynnwys gosodiadau ar sut mae DVDs yn cael eu trin.

# #36194
source: Autorun DVD video when inserted in drive.
cy: Awto-rhedeg fideo DVD wrth ei fewnosod i'r gyrrwr

# #36195
source: Force a region for DVD playback.
cy: Gorfodi ardal ar gyfer chwarae DVD.

# #36196
source: Attempt to skip 'unskippable' introductions before DVD menu.
cy: Ceisio hepgor cyfarwyddiadau 'anhepgoradwy' cyn dewislen DVD.

# #36197
source: No info available yet.
cy: Dim gwybodaeth ar gael ar hyn o bryd.

# #36198
source: Select the default movie information source. See the Add-ons Manager for options.
cy: Dewis ffynhonnell arferol gwybodaeth ffilmiau. Gw Rheolwr Ychwanegion am ddewisiadau.

# #36199
source: Select the default TV show information source. See the Add-ons Manager for options.
cy: Dewis ffynhonnell gwybodaeth rhaglenni teledu arferol. Gw. Rheolwr Ychwanegion am y dewisiadau.

# #36200
source: Default scraper used for adding music videos to your library.
cy: Y crafwr arferol ar gyfer ychwanegu fideos cerddoriaeth i'ch llyfrgell.

# #36201
source: Settings for PVR/Live TV features.
cy: Gosodiadau ar gyfer nodweddion recordydd/teledu byw.

# #36202
source: Category for general settings for PVR/Live TV features.
cy: Categori ar gyfer gosodiadau cyffredinol nodweddion recordydd/teledu byw.

# #36203
source: Enable the Personal Video Recorder (PVR) features in Kodi. This requires that at least one PVR Add-on is installed.
cy: Galluogi'r nodweddion recordio yn Kodi. Mae hy y gofyn bod o leiaf un ychwanegyn recordydd wedi ei osod.

# #36204
source: Import channel groups from the PVR backend (if supported). Will delete user created groups if they're not found on the backend.
cy: Mewnforio grwpiau sianeli o gefn y Recordydd (os yw'n cael ei gynnal). Bydd yn dileu grwpiau crëwyd gan y defnyddiwr os nad ydynt i'w cael yn y cefn.

# #36205
source: Sort the channels by channel number on the backend, but use Kodi's own numbering for channels.
cy: Trefnu'r sianeli yn ôl rhif sianel yn y cefn ond defnyddio rhifo Kodi ar gyfer sianeli.

# #36206
source: Use numbering from the backend, instead of configuring them manually over Kodi.
cy: Defnyddio rhifo o'r cefn, yn lle ffurfweddu â llaw dros Kodi.

# #36207
source: Open the channel manager, which allows modifying the channel order, channel name, icon, etc.
cy: Agor y rheolwr sianeli, sy'n caniatáu newid trefn sianeli, enw sianel, eicon ac ati.

# #36208
source: Instruct the backend to search for channels (if supported).
cy: Dweud wrth y cefn i chwilio am sianeli (os yw'n cael ei gynnal)

# #36209
source: Delete channel/EPG database and reimport the data from the backend afterwards.
cy: Dileu sianel/cronfa ddata'r Amserlenydd ac ail fewnforio'r data o'r cefn wedyn.

# #36210
source: Prevent the 'connection lost' notification window from displaying when Kodi is unable to talk to the PVR backend server.
cy: Rhwystro ffenestr rhybuddion 'cysylltiad wedi ei golli' rhag dangos pan nad yw Kodi'n gallu siarad gyda'r gweinydd cefn y recordydd.

# #36211
source: Category for PVR menus and on-screen display settings, as well as channel info windows.
cy: Categori ar gyfer dewislenni a gosodiadau ar y sgrin yn ogystal â ffenestri gwybodaeth sianel.

# #36212
source: Display programming information when changing channels, such as the current TV show.
cy: Dangos gwybodaeth am raglenni wrth newid sianel, fel y rhaglen gyfredol.

# #36214
source: Close the on screen display controls after switching channels.
cy: Cau'r rheolyddion ar y sgrin ar ôl newid sianel.

# #36216
source: Folder where channel icons are stored.
cy: Y ffolder lle mae'r eiconau sianel yn cael eu cadw.

# #36217
source: Scan for missing channel icons.
cy: Sganio i ganfod eiconau sianel coll.

# #36218
source: Category for electronic programming guide settings.
cy: Categori ar gyfer gosodiadau'r rhestr rhaglenni electronig.

# #36220
source: Number of days of EPG data to import from backends.
cy: Nifer y dyddiau o ddata rhaglenni i'w mewnforio o'r cefn.

# #36221
source: Time between EPG data imports from backends.
cy: Amser rhwng mewnforio data rhaglenni o'r cefn.

# #36222
source: Do not import EPG data while playing TV to minimise CPU usage.
cy: Peidio mewnforio data'r Amserlenydd tra bod y teledu ymlaen er mwyn lleihau'r defnydd o'r CPU.

# #36223
source: By default, EPG data is stored in a local database to speed up importing when Kodi is restarted.
cy: Fel arfer mae data'r Amserlenydd yn cael ei gadw mewn cronfa ddata er mwyn cyflymu mewnforio wrth ailgychwyn Kodi.

# #36224
source: Hide "no information available" labels when no EPG data can be retrieved for a channel.
cy: Cuddio labeli "dim gwybodaeth ar gael" pan nad oes modd estyn data sianel yr Amserlenydd '

# #36225
source: Delete the EPG database in Kodi and reimport the data afterwards from the backend.
cy: Dileu cronfa ddata data rhaglenni yn Kodi ac ail fewnforio'r data wedyn o'r cefn.

# #36226
source: Category for PVR playback and channel switching settings.
cy: Categori chwarae rhaglennydd a gosodiadau newid sianel.

# #36227
source: Display stream of selected channel in a small box instead of fullscreen.
cy: Dangos llif o sianel benodol i ffenestr fach yn lle'r sgrin lawn.

# #36228
source: Continue with the last viewed channel on startup.
cy: Parhau gyda'r sianel gwyliwyd diwethaf wrth gychwyn.

# #36229
source: Display signal quality information in the codec information window (if supported by the Add-on and backend).
cy: Dangos gwybodaeth ansawdd y signal yn ffenestr gwybodaeth y codec (os yw'n cael ei gynnal gan yr Ychwanegyn a'r cefn).

# #36230
source: How long Kodi will wait to change the channel if the channel isn't being received. Useful for over-the-air channels that occasionally lose signal strength.
cy: Pa mor hir fydd Kodi'n aros i newid y sianel os nad yw'r sianel yn cael ei dderbyn. Defnyddiol am sianeli dros yr awyr sy'n colli eu cryfder o bryd i'w gilydd.

# #36231
source: Pressing a number button in full screen mode will automatically switch to the channel number that was entered after 1 second.
cy: Bydd pwyso botwm rhif yn y modd sgrin llawn yn newid yn awtomatig i'r rhif sianel hwnnw o fewn 1 eiliad.

# #36232
source: When pressing channel up or down, the actual channel switch is delayed, allowing the user to flip to a channel number without waiting for each channel switch.
cy: Wrth bwyso sianel i fyny neu lawr, mae'r newid sianel y cael ei arafu gan ganiatáu i'r defnyddiwr newid sianel heb orfod aros i bob sianel newid.

# #36233
source: Category for default recording duration settings.
cy: Categori ar gyfer gosodiadau hyd recordiad rhagosodedig.

# #36234
source: Duration of instant recordings when pressing the record button.
cy: Hyd recordio cyflym wrth bwyso'r botwm recordio.

# #36235
source: Priority of the recording. Higher number means higher priority. Not supported by all Add-ons and backends.
cy: Blaenoriaeth y recordiad. Rhif uwch y golygu blaenoriaeth uwch. Nid yw'n cael ei gynnal gan bob Ychwanegyn a chefn.

# #36236
source: Delete recording after this time. Not supported by all Add-ons and backends.
cy: Dileu recordiadau ar ôl yr amser hwn. Nid yw'n cael ei gynnal gan bob Ychwanegyn a chefn.

# #36237
source: Start recordings before the actual time. Not supported by all Add-ons and backends.
cy: Cychwyn recordio o flaen yr amser cywir. Nid yw'n cael ei gynnal gan bob Ychwanegyn a chefn.

# #36238
source: End recordings after the actual time. Not supported by all Add-ons and backends.
cy: Gorffen recordio cyn yr amser cywir. Nid yw'n cael ei gynnal gan bob Ychwanegyn a chefn.

# #36239
source: Display a notification when timers are added, finished or removed by the backend.
cy: Dangos rhybudd pan fydd amseryddion yn cael eu hychwanegu, gorffen neu dynnu gan y cefn.

# #36240
source: Category for PVR power management settings, such as when to wake the PVR backend server.
cy: Categori ar gyfer gosodiadau rheoli pŵer y recordydd, megis pryd i ddeffro gweinydd cefn y recordydd.

# #36241
source: Execute the "wakeup command" below when Kodi exits or is going into hibernation mode. The timestamp of the next scheduled recording is passed as parameter.
cy: Gweithredu'r "gorchymyn deffro" isod pan mae Kodi yn gadael neu'n mynd i'r modd cysgu. Bydd stamp amser y recordiad nesaf yn cael ei anfon fel paramedr.

# #36242
source: The command will not be executed when a recording will be started within this timeout.
cy: Ni fydd y gorchymyn yn cael ei weithredu pan fydd recordiad yn cael ei gychwyn o fewn yr amser allan hwn.

# #36243
source: The command to execute.
cy: Y gorchymyn i'w weithredu.

# #36244
source: Time to subtract from the start time of the next scheduled recording.
cy: Amser i'w dynnu o amser cychwyn y recordiad nesaf.

# #36245
source: Execute the wakeup command every day at the given time.
cy: Gweithredu'r gorchymyn deffro bod dydd ar amser penodol.

# #36246
source: When to execute the daily wakeup command.
cy: Pryd i weithredu'r gorchymyn deffro dyddiol.

# #36247
source: Category for parental control settings if the PVR backend server supports parental controls.
cy: Categori ar gyfer rheolaeth rhiant os yw gweinydd cefn y recordydd y cynnal rheolaeth rhiant.

# #36248
source: Asks for a pin code to access parental locked channels. Channels can be marked as locked in the channels editor on the general tab. Parental locked channels can not be played or recorded without entering a pin code, and the EPG information is hidden for those channels.
cy: Bydd y gofyn am rif PIN i gael mynediad at glo sianeli'r rhiant./ Mae modd marcio sianeli wedi eu cloi yng ngolygydd y sianeli yn y tab cyffredinol. Nid oes modd chwarae neu recordio sianeli sydd â chlo'r rhieni heb gyflwyno'r rhif PIN ac mae gwybodaeth am y sianeli hynny wedi ei guddio yn yr Amserlenydd .

# #36249
source: Enter a new pin code to unlock parental locked channels.
cy: Rhowch PIN newydd i ddatgloi sianeli sydd â chlo'r rhiant.

# #36250
source: Ask for the pin code again when trying to access a parental locked channel and the code hasn't been asked for this duration.
cy: Gofyn am cod pin eto wrth geisio cael mynediad i sianel sydd wedi ei gloi gan riant ac nad yw'r cod wedi cael ei ofyn amdano yr hyd yma o amser.

# #36251
source: Category for any specific settings for your PVR backend, if the PVR backend supports changing those settings in Kodi.
cy: Categori ar gyfer unrhyw osodiad penodol cefn eich recordydd, os yw'r cefn yn cynnal y newidiadau hyn yn Kodi.

# #36254
source: Enable the music library.
cy: Galluogi llyfrgell gerddoriaeth.

# #36255
source: Determine if artists that appear only on compilations are shown in the library artist view.
cy: Pennu os yw artistiaid sy'n ymddangos mewn casgliadau hefyd yn cael eu dangos yng ngolwg artist y llyfrgell.
