Repository: xbmc/xbmc
Catalog: language/Welsh/strings.po
Languages: cy

# #582
source: View mode
cy: Modd gweld

# #583
source: Remember views for different folders
cy: Cofio golwg y gwahanol ffolderi

# #584
source: Ascending
cy: Esgyn

# #585
source: Descending
cy: Disgyn

# #586
source: Edit playlist
cy: Golygu'r rhestr chwarae

# #587
source: Filter
cy: Hidl

# #588
source: Cancel party mode
cy: Diddymu'r modd parti

# #589
source: Party mode
cy: Modd parti

# #590
source: Random
cy: Hap

# #591
source: Off
cy: Diffodd

# #592
source: One
cy: Un

# #593
source: All
cy: Pob un

# #594
source: Off
cy: Diffodd

# #595
source: Repeat: Off
cy: Ailadrodd: Diffodd

# #596
source: Repeat: One
cy: Ailadrodd: Un

# #597
source: Repeat: All
cy: Ailadrodd: Popeth

# #600
source: Rip audio CD
cy: Rhwygo CD sain

# #601
source: Medium
cy: Canolig

# #602
source: Standard
cy: Safonnol

# #603
source: Extreme
cy: Eithafol

# #604
source: Constant bitrate
cy: Didradd cyson

# #605
source: Ripping...
cy: Rhwygo...

# #607
source: To:
cy: At:

# #608
source: Could not rip CD or track
cy: Methu rhwygo CD na thrac

# #609
source: CDDARipPath is not set.
cy: CDDARipPath heb ei osod.

# #610
source: Rip audio track
cy: Rwygo trac sain

# #611
source: Enter number
cy: Rhowch rif

# #612
source: Bits/sample
cy: Didau/sampl

# #613
source: Sample rate
cy: Cyfradd Samplo

# #614
source: Virtual folder
cy: Ffolder rhithiol

# #620
source: Audio CDs
cy: CD Sain

# #621
source: Encoder
cy: Amgodiwr

# #622
source: Quality
cy: Ansawdd

# #623
source: Bitrate
cy: Didradd

# #624
source: Include track number
cy: Cynnwys rhif trac

# #625
source: All songs of
cy: Pob cân

# #626
source: In progress TV shows
cy: Rhaglenni teledu sy ymlaen

# #629
source: View mode
cy: Modd gweld

# #631
source: Zoom
cy: Chwyddo

# #632
source: Stretch 4:3
cy: Ymestyn 4:3

# #633
source: Wide Zoom
cy: Chwyddo Llydan

# #634
source: Stretch 16:9
cy: Ymestyn 16:9

# #635
source: Original Size
cy: Maint Gwreiddiol

# #636
source: Custom
cy: Cyfaddas

# #638
source: ReplayGain volume adjustments
cy: Newid sain ReplayGain

# #639
source: Use track levels
cy: Defnyddio lefelau trac

# #640
source: Use album levels
cy: Defnyddio lefelau albwm

# #641
source: PreAmp Level - ReplayGained files
cy: Lefel Rheolydd Ton - ffeiliau ReplayGain

# #642
source: PreAmp Level - Non ReplayGained files
cy: Lefel Rheolydd Ton - nid ffeiliau ReplayGain

# #643
source: Avoid clipping on ReplayGained files
cy: Osgoi tocio ffeiliau ReplayGain

# #644
source: Crop black bars
cy: Tocio barau du

# #645
source: Need to unpack a big file. Continue?
cy: Angen dadbacio ffeil fawr. Parhau?

# #646
source: Remove from library
cy: Tynnu o'r llyfrgell

# #647
source: Export video library
cy: Allforio llyfrgell fideo

# #648
source: Import video library
cy: Mewnforio llyfrgell fideo

# #649
source: Importing
cy: Mewnforio

# #650
source: Exporting
cy: Allforio

# #651
source: Browse for library
cy: Pori am lyfrgell

# #652
source: Years
cy: Blynyddoedd

# #653
source: Update library
cy: Diweddaru llyfrgell

# #654
source: Show debug info
cy: Dangos gwybodaeth dadfygio

# #655
source: Browse for executable
cy: Pori am y gweithredol

# #656
source: Browse for playlist
cy: Pori am restr chwarae

# #657
source: Browse for folder
cy: Pori am ffolder

# #658
source: Song information
cy: Gwybodaeth am gan

# #659
source: Non-linear stretch
cy: Ymestyniad anllinynol

# #660
source: Volume amplification
cy: Chwyddo sain

# #661
source: Choose export folder
cy: Dewis ffolder allforio

# #662
source: This file is no longer available.
cy: Nid yw'r ffeil hon ar gael bellach.

# #663
source: Would you like to remove it from the library?
cy: Hoffech ei thynnu o'r llyfrgell?

# #664
source: Browse for Script
cy: Pori am sgript

# #665
source: Compression level
cy: Lefel cywasgiad

# #666
source: Enable component-specific logging
cy: Galluogi cofnodi cydran bnodol

# #667
source: Enable Dolby Digital transcoding
cy: Galluogi trawscodio Dolby Digidol

# #668
source: Specify component-specific logging...
cy: Pennu cofnodi cydran benodol

# #669
source: Verbose logging for SMB library
cy: Cofnodi geiriog i lyfrgell SMB

# #670
source: Verbose logging for CURL library (http, dav)
cy: Cofnodi geiriog i lyfrgell CURL (http, dav)

# #671
source: Verbose logging for CMYTH library
cy: Cofnodi geiriog i lyfrgell CMYTH

# #672
source: Verbose logging for FFMPEG libraries
cy: Cofnodi geiriog i lyfrgelloedd FFMPEG

# #673
source: Verbose logging for RTMP library
cy: Cofnodi geiriog i lyfrgell RTMP

# #674
source: Verbose logging for DBUS calls
cy: Cofnodi geiriog i alwadau DBUS

# #675
source: Verbose logging for JSON-RPC requests
cy: Cofnodi geiriog i geisiadau JSON-RPC

# #676
source: Verbose logging for AUDIO component
cy: Cofnod hyglyw ar gyfer cydran AUDIO

# #677
source: Verbose logging for AirTunes library
cy: Cofnodi hyglyw ar gyfer llyfrgell AirTunes

# #678
source: Verbose logging for UPnP components
cy: Cofnodi hyglyw ar gyfer cydrannau UPnP

# #679
source: Verbose logging for CEC library
cy: Cofnodi hyglyw ar gyfer llyfrgell CEC

# #700
source: Cleaning up library
cy: Glanhau'r llyfrgell

# #701
source: Removing old songs from the library
cy: Tynnu hen ganeuon o'r llyfrgell

# #702
source: This path has been scanned before
cy: Mae'r llwybr yma wedi ei sganio o'r blaen

# #705
source: Network
cy: Rhwydwaith

# #706
source: Server
cy: Gweinydd

# #708
source: Use an HTTP proxy server to access the internet
cy: Defnyddio gweinydd dirprwyol HTTP i gael mynediad at y rhyngrwyd

# #711
source: Internet Protocol (IP)
cy: Protocol Rhyngrwyd (IP)

# #712
source: Invalid port specified. Value must be between 1 and 65535.
cy: Enwyd porth annilys. Rhaid i'r gwerth fod rhwng 1 a 65535.

# #713
source: HTTP proxy
cy: Dirprwy HTTP

# #715
source: Assignment
cy: Aseiniad

# #716
source: Automatic (DHCP)
cy: Awtomatig (DHCP)

# #717
source: Manual (Static)
cy: Gyda llaw (Statig)

# #719
source: IP address
cy: Cyfeiriad IP

# #720
source: Netmask
cy: Masg Rhwyd

# #721
source: Default gateway
cy: Porth rhagosodedig

# #722
source: DNS server
cy: Gweinydd DNS

# #723
source: Save & restart
cy: Cadw ac ailgychwyn

# #724
source: Invalid address specified. Value must be AAA.BBB.CCC.DDD
cy: Enwyd cyfeiriad annilys. Rhaid i'r gwerth fod yn AAA.BBB.CCC.DDD

# #725
source: with numbers between 0 and 255.
cy: gyda rhifau rhwng 0 a 255.

# #726
source: Changes not saved. Continue without saving?
cy: Newidiadau heb eu cadw. Parhau heb gadw?

# #727
source: Web server
cy: Gweinydd gwe

# #728
source: FTP server
cy: Gweinydd FTP

# #730
source: Port
cy: Porth

# #732
source: Save & apply
cy: Gadw a gosod

# #733
source: Password
cy: Cyfrinair

# #734
source: No pass
cy: Dim parhau

# #735
source: Character set
cy: Set nod

# #736
source: Style
cy: Arddull

# #737
source: Colour
cy: Lliw

# #739
source: Bold
cy: Trwm

# #740
source: Italics
cy: Italig

# #741
source: Bold italics
cy: Italig trwm

# #742
source: White
cy: Gwyn

# #743
source: Yellow
cy: Melyn

# #744
source: Files
cy: Ffeiliau

# #745
source: No scanned information for this view
cy: Dim gwybodaeth wedi ei sganio ar gyfer y golwg hwn

# #746
source: Please turn off library mode
cy: Diffoddwch y modd llyfrgell

# #747
source: Error loading image
cy: Gwall llwytho delwedd

# #748
source: Edit path
cy: Golygu llwybr

# #749
source: Mirror image
cy: Delwedd drych

# #750
source: Are you sure?
cy: Ydych chi'n siŵr?

# #751
source: Removing source
cy: Tynnu ffynhonnell

# #754
source: Add program link
cy: Ychwanegu cyswllt rhaglen

# #755
source: Edit program path
cy: Golygu llwybr rhaglen

# #756
source: Edit program name
cy: Golygu enw rhaglen

# #757
source: Edit path depth
cy: Golygu dyfnder llwybr

# #759
source: View: Big list
cy: Golwg: Rhestr fawr

# #760
source: Yellow
cy: Melyn

# #761
source: White
cy: Gwyn

# #762
source: Blue
cy: Glas

# #763
source: Bright green
cy: Gwyrdd llachar

# #764
source: Yellow green
cy: Gwyrdd melyn

# #765
source: Cyan
cy: Coch

# #766
source: Light grey
cy: Llwyd golau

# #767
source: Grey
cy: Llwyd

# #770
source: Error %i: share not available
cy: Gwall %i: nid yw'r rhaniad ar gael

# #772
source: Audio output
cy: Allbwn sain

# #773
source: Seeking
cy: Chwilio

# #774
source: Slideshow folder
cy: Ffolder sioe sleidiau

# #775
source: Network interface
cy: Rhyngwyneb rhwydwaith

# #776
source: Wireless network name (ESSID)
cy: Enw rhwydwaith diwyfr (ESSID)

# #777
source: Wireless password
cy: Cyfrinair y Diwyfr

# #778
source: Wireless security
cy: Diogelwch y diwyfr

# #779
source: Save and apply network interface settings
cy: Cadw a gosod gosodiadau rhyngwyneb rhyngrwyd

# #780
source: No encryption
cy: Dim amgryptiad

# #784
source: Applying network interface settings. Please wait.
cy: Gosod gosodiadau rhyngwyneb rhwydwaith. Arhoswch.

# #785
source: Network interface restarted successfully.
cy: Rhyngwyneb rhwydwaith wedi ailgychwyn yn llwyddiannus.

# #786
source: Network interface did not start successfully.
cy: Nid yw'r rhyngwyneb rhwydwaith wedi cychwyn yn llwyddiannus.

# #787
source: Interface disabled
cy: Analluogwyd y rhyngwyneb

# #788
source: Network interface disabled successfully.
cy: Analluogwyd rhyngwyneb rhwydwaith yn llwyddiannus.

# #789
source: Wireless network name (ESSID)
cy: Enw rhwydwaith diwyfr (ESSID)

# #790
source: Remote control
cy: Rheolydd pell

# #791
source: Allow programs on this system to control Kodi
cy: Caniatáu i raglenni ar y system reoli Kodi

# #792
source: Port
cy: Porth

# #793
source: Port range
cy: Ystod porth

# #794
source: Allow programs on other systems to control Kodi
cy: Caniatáu i raglenni ar systemau eraill reoli Kodi

# #795
source: Initial repeat delay (ms)
cy: Oedi ailadrodd cyntaf (me)

# #796
source: Continuous repeat delay (ms)
cy: Oedi ailadrodd parhaus (me)

# #797
source: Maximum number of clients
cy: Uchafswm nifer y clientiaid

# #798
source: Internet access
cy: Mynediad i'r rhyngrwyd

# #799
source: Library Update
cy: Diweddaru Llyfrgell

# #800
source: Music library needs to rescan tags from files.
cy: Mae angen i'r llyfrgell cerddoriaeth ailsganio tagiau'r ffeiliau.

# #801
source: Would you like to scan now?
cy: Hoffech chi sganio nawr?

# #850
source: Invalid port number entered
cy: Rhoddwyd rhif porth annilys

# #851
source: Valid port range is 1-65535
cy: Ystod porth dilys yw 1-65535

# #852
source: Valid port range is 1024-65535
cy: Ystod porth dilys yw 1024-65535

# #997
source: Add Pictures...
cy: Ychwanegu Lluniau...

# #998
source: Add Music...
cy: Ychwanegu Cerddoriaeth...

# #999
source: Add Videos...
cy: Ychwnanegu Fideo...

# #1000
source: Preview
cy: Rhagolwg

# #1001
source: Unable to connect
cy: Methu cysylltu

# #1002
source: Kodi was unable to connect to the network location.
cy: Roedd Kodi yn methu cysylltu a'r lleoliad rhwydwaith.

# #1003
source: This could be due to the network not being connected.
cy: Gall hyn fod oherwydd nad yw'r rhwydwaith wedi ei chysylltu.

# #1004
source: Would you like to add it anyway?
cy: Hoffech chi ei hychwanegu beth bynnag?

# #1006
source: IP address
cy: Cyfeiriad IP

# #1007
source: Add network location
cy: Ychwanegu lleoliad rhwydwaith

# #1009
source: Server address
cy: Cyfeiriad gweinydd

# #1010
source: Server name
cy: Enw gweinydd

# #1011
source: Remote path
cy: Llwybr pell

# #1012
source: Shared folder
cy: Ffolder rhanedig

# #1013
source: Port
cy: Porth

# #1014
source: Username
cy: Enw defnyddiwr

# #1015
source: Browse for network server
cy: Pori am weinydd rhwydwaith

# #1016
source: Enter the network address of the server
cy: Rhowch gyfeiriad rhwydwaith y gweinydd

# #1017
source: Enter the path on the server
cy: Rhowch lwybr i'r gweinydd

# #1018
source: Enter the port number
cy: Rhowch rif y porth

# #1019
source: Enter the username
cy: Rhowch enw defnyddiwr

# #1020
source: Add %s source
cy: Ychwanegu ffynhonell %s

# #1021
source: Enter the paths or browse for the media locations.
cy: Rhowch lwybrau neu bori am leoliadau cyfrwng.

# #1022
source: Enter a name for this media Source.
cy: Rhowch enw i'r Ffynhonnell cyfrwng.

# #1023
source: Browse for new share
cy: Pori am rhan newydd

# #1024
source: Browse
cy: Pori

# #1025
source: Could not retrieve directory information.
cy: Methu estyn gwybodaeth cyfeiriadur.

# #1026
source: Add source
cy: Ychwanegu ffynhonnell

# #1027
source: Edit source
cy: Golygu ffynhonell

# #1028
source: Edit %s source
cy: Golygu %s ffynhonell

# #1029
source: Enter the new label
cy: Rhowch label newydd

# #1030
source: Browse for image
cy: Pori am ddelwedd

# #1031
source: Browse for image folder
cy: Pori am ffolder delwedd

# #1032
source: Add network location...
cy: Ychwanegu lleoliad rhwydwaith...

# #1033
source: Browse for file
cy: Pori am ffeil

# #1034
source: Submenu
cy: Isddewislen

# #1035
source: Enable submenu buttons
cy: Galluogi botymau isddewislen

# #1036
source: Favourites
cy: Ffefrynnau

# #1037
source: Video Add-ons
cy: Ychwanegion Fideo

# #1038
source: Music Add-ons
cy: Ychwanegion Cerddoriaeth

# #1039
source: Picture Add-ons
cy: Ychwanegion Lluniau

# #1040
source: Loading directory
cy: Llwytho cyfeiriadur

# #1041
source: Retrieved %i items
cy: Estynnwyd %i eitem

# #1042
source: Retrieved %i of %i items
cy: Estynnwyd %i o %i eitem

# #1043
source: Program Add-ons
cy: Ychwanegion Rhaglenni

# #1044
source: Set plug-in thumb
cy: Gosod llun bach ategyn

# #1045
source: Add-on settings
cy: Gosodidau ychwanegion

# #1046
source: Access points
cy: Pwyntiau mynediad

# #1047
source: Other...
cy: Eraill...

# #1048
source: Username
cy: Enw defnyddiwr

# #1049
source: Script settings
cy: Gosodiadau sgriptiau

# #1050
source: Singles
cy: Senglau

# #1051
source: Enter web address
cy: Rhowch gyfeiriad gwe

# #1180
source: Proxy type
cy: Math o ddirprwy

# #1185
source: SOCKS5 with remote dns resolving
cy: SOCKS5 gyda datrys dns pell

# #1200
source: SMB client
cy: Cleient SMB

# #1202
source: Workgroup
cy: Grŵp Gwaith

# #1203
source: Default username
cy: Enw defnyddiwr rhagosodedig

# #1204
source: Default password
cy: Cyfrinair rhagosodedig

# #1207
source: WINS server
cy: Gweinydd WINS

# #1208
source: Mount SMB shares
cy: Arosod rhaniadau SMB

# #1210
source: Remove
cy: Tynnu

# #1211
source: Music
cy: Cerddoriaeth

# #1212
source: Video
cy: Fideo

# #1213
source: Pictures
cy: Lluniau

# #1214
source: Files
cy: Ffeiliau

# #1215
source: Music & video
cy: Cerddoriaeth a fideo

# #1216
source: Music & pictures
cy: Cerddoriaeth a lluniau

# #1217
source: Music & files
cy: Cerddoriaeth a ffeiliau

# #1218
source: Video & pictures
cy: Fideo a lluniau

# #1219
source: Video & files
cy: Fideo a ffeiliau

# #1220
source: Pictures & files
cy: Lluniau a fideo

# #1221
source: Music & video & pictures
cy: Cerddoriaeth a fideo a lluniau

# #1222
source: Music & video & pictures & files
cy: Cerddoriaeth a fideo a lluniau a ffeiliau

# #1223
source: Disabled
cy: Analluogwyd

# #1226
source: Files & music & video
cy: Ffeiliau a cherddoriaeth a fideo

# #1227
source: Files & pictures & music
cy: Ffeiliau a lluniau a cherddoriaeth

# #1228
source: Files & pictures & video
cy: Ffeiliau a lluniau a fideo

# #1229
source: Music & programs
cy: Cerddoriaeth a rhaglenni

# #1230
source: Video & programs
cy: Fideo a rhaglenni

# #1231
source: Pictures & programs
cy: Lluniau a rhaglenni

# #1232
source: Music & video & pictures & programs
cy: Cerddoriaeth a fideo a lluniau a rhaglenni

# #1233
source: Programs & video & music
cy: Rhaglenni a fideo a cherddoriaeth

# #1234
source: Programs & pictures & music
cy: Rhaglenni a lluniau a cherddoriaeth

# #1235
source: Programs & pictures & video
cy: Rhaglenni a lluniau a fideo

# #1260
source: Announce these services to other systems via Zeroconf
cy: Cyhoeddi'r gwasanaethau hyn i systemau eraill drwy Zeroconf

# #1269
source: Allow volume control
cy: Caniatáu rheoli sain

# #1270
source: Allow Kodi to receive AirPlay content
cy: Caniatáu i Kodi dderbyn cynnwys AirPlay

# #1271
source: Device name
cy: Enw dyfais

# #1272
source: Use password protection
cy: Defnyddio diogelu cyfrinair

# #1275
source: Filter %s
cy: Hidl %s

# #1300
source: Custom audio device
cy: Dyfais sain cyfaddas

# #1301
source: Custom passthrough device
cy: Dyfais hebrwng cyfaddas

# #1396
source: Drifting
cy: Symud yn araf

# #1397
source: and
cy: a

# #1398
source: Freezing
cy: Rhewi

# #1399
source: Late
cy: Hwyr

# #1400
source: Isolated
cy: Ysbeidiol

# #1401
source: Thundershowers
cy: Cawodydd taranau

# #1402
source: Thunder
cy: Taranau

# #1403
source: Sun
cy: Haul

# #1404
source: Heavy
cy: Trwm

# #1405
source: in
cy: yn

# #1406
source: the
cy: yr

# #1407
source: Vicinity
cy: Ardal

# #1408
source: Ice
cy: Rhew

# #1409
source: Crystals
cy: Crisialau

# #1410
source: Calm
cy: Llonydd

# #1411
source: with
cy: gyda

# #1412
source: windy
cy: gwynt

# #1413
source: Patches
cy: Ysbeidiau

# #1414
source: Thunderstorm
cy: Storm taranau

# #1415
source: Drizzle
cy: Glaw mân

# #1416
source: Foggy
cy: Niwlog

# #1417
source: Grains
cy: Gronynnau

# #1418
source: Thunderstorms
cy: Stormydd taranau

# #1419
source: Shallow
cy: Isel

# #1420
source: Moderate
cy: Cymhedrol

# #1421
source: Very High
cy: Uchel Iawn

# #1422
source: Windy
cy: Gwyntog

# #1423
source: Mist
cy: Tarth

# #1424
source: Overcast
cy: Cymylog

# #1425
source: Pellets
cy: Pelennau

# #1426
source: Hail
cy: Cenllysg

# #1427
source: Smoke
cy: Mwg

# #1428
source: Volcanic
cy: Flocanig

# #1429
source: Ash
cy: Lludw

# #1430
source: Widespread
cy: Eang

# #1431
source: Dust
cy: Llwch

# #1432
source: Sand
cy: Tywod

# #1433
source: Spray
cy: Chwistrelliad

# #1434
source: Whirls
cy: Chwyrliau

# #1435
source: Sandstorm
cy: Storm Tywod

# #1436
source: Blowing
cy: Chwythu

# #1437
source: Pellet
cy: Pelen

# #1438
source: Small
cy: Bach

# #1439
source: and
cy: a

# #1440
source: Sleet
cy: Eirlaw

# #1441
source: with
cy: gyda

# #1442
source: Chance
cy: Tebygolrwydd

# #1443
source: of
cy: o

# #1444
source: Funnel
cy: Twndis

# #1445
source: Cloud
cy: Cwmwl

# #1446
source: Unknown
cy: Anhysbys

# #1447
source: Squals
cy: Hyrddwynt

# #1448
source: Precipitation
cy: Dyodiad

# #1449
source: Partial
cy: Rhannol

# #1450
source: Put display to sleep when idle
cy: Oedi'r dangosiad pan yn segur

# #2050
source: Runtime
cy: Amser rhedeg

# #2080
source: Empty list
cy: Rhestr wag

# #2081
source: Went back to parent list because the active list has been emptied
cy: Wedi mynd nôl i'r rhestr rhiant gan fod y rhestr weithredol wedi ei wagio

# #2100
source: Script failed! : %s
cy: Methodd y sgript! : %s

# #2101
source: Newer version needed - See log
cy: Mae angen y fersiwn diweddarach - Gw. cofnod

# #10000
source: Home
cy: Cartref

# #10001
source: Programs
cy: Rhaglenni

# #10002
source: Pictures
cy: Lluniau

# #10003
source: File manager
cy: Rheolwr ffeiliau

# #10004
source: Settings
cy: Gosodiadau

# #10005
source: Music
cy: Ceddoriaeth

# #10006
source: Videos
cy: Fideo

# #10007
source: System information
cy: Gwybodaeth system

# #10008
source: Settings - General
cy: Gosodiadau - Cyffredinol

# #10009
source: Settings - Screen
cy: Gosodiadau - Sgrin

# #10010
source: Settings - Appearance - GUI Calibration
cy: Gosodiadau - Gwedd - Calibro GUI

# #10011
source: Settings - Videos - Screen Calibration
cy: Gosodiadau - Fideo - Calibro Sgrin

# #10012
source: Settings - Pictures
cy: Gosodiadau - Lluniau

# #10013
source: Settings - Programs
cy: Gosodiadau - Rhaglenni

# #10014
source: Settings - Weather
cy: Gosodiadau - Tywydd

# #10015
source: Settings - Music
cy: Gosodiadau - Cerddoriaeth

# #10016
source: Settings - System
cy: Gosodiadau - System

# #10017
source: Settings - Videos
cy: Gosodiadau - Fideo

# #10018
source: Settings - Network
cy: Gosodiadau - Rhwydwaith

# #10019
source: Settings - Appearance
cy: Gosodiadau - Gwedd

# #10020
source: Scripts
cy: Sgriptiau

# #10021
source: Web Browser
cy: Porwr Gwe

# #10025
source: Videos
cy: Fideo

# #10028
source: Videos/Playlist
cy: Fideo/Rhestr Chwarae

# #10029
source: Login screen
cy: Sgrin mewngofnodi

# #10034
source: Settings - Profiles
cy: Gosodiadau - Proffiliau

# #10035
source: Reset
cy: Ailosod

# #10036
source: Basic
cy: Sylfaenol

# #10037
source: Standard
cy: Safonnol

# #10038
source: Advanced
cy: Uwch

# #10039
source: Expert
cy: Arbenigwr

# #10040
source: Add-on browser
cy: Porwr ychwanegyn

# #10041
source: Reset above settings to default
cy: Ailosod y gosodiadau uchod i'r rhagosidiad

# #10042
source: Are you sure you want to reset the settings in this category?
cy: Ydych chi'n siŵr eich bod am ailosod y gosodiadau yn y categori hwn?

# #10043
source: Help
cy: Cymorth

# #10044
source: No help available
cy: Dim cymorth ar gael

# #10045
source: Resets all the visible settings to their default values.
cy: Ailosod pob gosodiad gweladwy i'w gwerthoedd rhagosodedig.

# #10046
source: No categories available
cy: Dim categorïau ar gael

# #10047
source: Try changing the setting level to see additional categories and settings.
cy: Ceisiwch newid lefel y gosodiad i weld categorïau ychwanegol a gosodiadau.

# #10100
source: Yes/No dialogue
cy: Deialog Iawn/Na

# #10101
source: Progress dialogue
cy: Deialog cynnydd

# #10126
source: File browser
cy: Porwr ffeiliau

# #10128
source: Network setup
cy: Gosodiad y rhwydwaith

# #10129
source: Media source
cy: Ffynhonell cyfrwng

# #10130
source: Profile settings
cy: Gosodiadau proffil

# #10131
source: Lock settings
cy: Gosodiadau cloi

# #10132
source: Content settings
cy: Gosodiadau'r cynnwys

# #10134
source: Favourites
cy: Ffefrynnau

# #10135
source: Songs/Info
cy: Caneuon/Gwybodaeth

# #10136
source: Smart playlist editor
cy: Golygydd clyfar rhestr chwarae

# #10137
source: Smart playlist rule editor
cy: Golygydd rheol rhestr chwarae

# #10139
source: Pictures/Info
cy: Lluniau/Gwybodaeth

# #10140
source: Add-on settings
cy: Gosodidau ychwanegion

# #10146
source: Add-ons/Info
cy: Ychwanegion/Gwybodaeth

# #10210
source: Looking for subtitles...
cy: Chwilio am isdeitlau...

# #10211
source: Looking for or caching subtitles...
cy: Chwilio am neu storio isdeitlau...

# #10212
source: terminating
cy: cau

# #10213
source: buffering
cy: byffro

# #10214
source: Opening stream
cy: Agor ffrwd

# #10500
source: Music/Playlist
cy: Cerddoriaeth/Rhestr Chwarae

# #10501
source: Music/Files
cy: Cerddoriaeth/Ffeiliau

# #10502
source: Music/Library
cy: Cerddoriaeth/Llyfrgell

# #10503
source: Playlist editor
cy: Golygydd rhestrau chwarae

# #10504
source: Top 100 songs
cy: 100 cân orau

# #10505
source: Top 100 albums
cy: 100 albwm gorau

# #10506
source: Programs
cy: Rhaglenni

# #10507
source: Configuration
cy: Ffurfweddiad

# #10508
source: Weather forecast
cy: Rhagolygon tywydd

# #10509
source: Network gaming
cy: Gemau rhwydwaith

# #10510
source: Extensions
cy: Estyniadau

# #10511
source: System info
cy: Gwybodaeth system

# #10516
source: Music - Library
cy: Cerddoriaeth - Llyfrgell

# #10517
source: Now Playing - Music
cy: Chwarae - Cerddoriaeth

# #10522
source: Now Playing - Videos
cy: Chwarae - Fideo

# #10523
source: Album info
cy: Gwybodaeth albwm

# #10524
source: Movie info
cy: Gwybodaeth ffilm

# #12000
source: Select dialogue
cy: Dewis y ddeialog

# #12001
source: Music/Info
cy: Cerddoriaeth/Gwybodaeth

# #12002
source: Dialogue OK
cy: Deialog yn Iawn

# #12003
source: Videos/Info
cy: Fideo/Gwybodaeth

# #12004
source: Scripts/Info
cy: Sgriptiau/Gwybodaeth

# #12005
source: Fullscreen video
cy: Fideo sgrin lawn

# #12006
source: Audio visualisation
cy: Delweddu gweledol

# #12008
source: File stacking dialogue
cy: Deialog stacio ffeiliau

# #12009
source: Rebuild index...
cy: Ailadeiladu mynegai...

# #12010
source: Return to music window
cy: Dychwelyd i'r ffenestr cerddoriaeth

# #12011
source: Return to videos window
cy: Dychwelyd i'r ffenestr fideo
