Repository: xbmc/xbmc
Catalog: language/Welsh/strings.po
Languages: cy

# #14011
source: Enable auto switching to thumbs view
cy: Galluogi awto-newid i olwg lluniau bach

# #14012
source: - Use large icons
cy: - Defnyddio eiconau mawr

# #14013
source: - Switch based on
cy: - Newid ar sail

# #14014
source: - Percentage
cy: - Canran

# #14015
source: No files and at least one thumb
cy: Dim ffeiliau ac o leiaf un llun bach

# #14016
source: At least one file and thumb
cy: O leiaf un ffeil a llun bach

# #14017
source: Percentage of thumbs
cy: Canran y lluniau bach

# #14018
source: View options
cy: Gweld y dewisiadau

# #14019
source: Change area code 1
cy: Newid cod ardal 1

# #14020
source: Change area code 2
cy: Newid cod ardal 2

# #14021
source: Change area code 3
cy: Newid cod ardal 3

# #14022
source: Library
cy: Llyfrgell

# #14023
source: No TV
cy: Dim teledu

# #14024
source: Enter the nearest large town
cy: Rhowch enw'r dref agosaf

# #14025
source: Video/Audio/DVD cache - Hard disk
cy: Storfa Fideo/Sain/DVD - Disg caled

# #14026
source: Video cache - DVD-ROM
cy: Storfa Fideo - DVD-ROM

# #14027
source: Video cache - Local Network
cy: Storfa fideo - Rhwydwaith Lleol

# #14028
source: Video cache - Internet
cy: Storfa Fideo - Rhyngrwyd

# #14030
source: Audio cache - DVD-ROM
cy: Storfa Sain - DVD-ROM

# #14031
source: Audio cache - Local Network
cy: Storfa Sain - Rhwydwaith Lleol

# #14032
source: Audio cache - Internet
cy: Storfa sain - Rhyngrwyd

# #14034
source: DVD cache - DVD-ROM
cy: Storfa DVD - DVD-ROM

# #14035
source: Local Network
cy: Rhwydwaith Leol

# #14036
source: Services
cy: Gwasanaethau

# #14037
source: DVD cache - Local Network
cy: Storfa DVD - Rhwydwaith Lleol

# #14038
source: Network settings changed
cy: Gosodiadau rhwydwaith wedi newid

# #14039
source: Kodi requires to restart to change your
cy: Mae Kodi angen ailgychwyn er mwyn newid

# #14040
source: network setup. Would you like to restart now?
cy: eich gosodiadau rhwydwaith. Hoffech chi ailgychwyn nawr?

# #14041
source: Internet connection bandwidth limitation
cy: Cyfyngiadau lled band cysylltiad rhyngrwyd

# #14043
source: - Shutdown while playing
cy: - Cau wrth chwarae

# #14044
source: %i min
cy: %i mun

# #14045
source: %i sec
cy: %i eil

# #14046
source: %i ms
cy: %i me

# #14051
source: Time format
cy: Fformat amser

# #14052
source: Date format
cy: Fformat dyddiad

# #14053
source: GUI filters
cy: Hidlau rhyngwyneb

# #14055
source: Use background scanning
cy: Defnyddio sganio cefndirol

# #14056
source: Stop scan
cy: Atal y sganio

# #14057
source: Not possible while scanning for media info
cy: Ddim yn bosib wrth sganio gwybodaeth cyfryngau

# #14058
source: Film grain effect
cy: Effaith graen ffilm

# #14059
source: Search for thumbnails on remote shares
cy: Chwilio am luniau bach ar raniadau pell

# #14060
source: Unknown type cache - Internet
cy: Math anhysbys o storfa - Rhyngrwyd

# #14061
source: Auto
cy: Awto

# #14062
source: Enter username for
cy: Rhowch enw defnyddiwr

# #14063
source: Date & time
cy: Dyddiad ac amser

# #14064
source: Set date
cy: Gosod dyddiad

# #14065
source: Set time
cy: Gosod yr amser

# #14066
source: Enter the time in 24 hour HH:MM format
cy: Rhowch yr amser yn fformat 24 awr AA:MM

# #14067
source: Enter the date in DD/MM/YYYY format
cy: Rhowch y dyddiad yn fformat DD/MM/BBBB

# #14068
source: Enter the IP address
cy: Rhowch Gyfeiriad IP

# #14069
source: Apply these settings now?
cy: Gosod rhain nawr?

# #14070
source: Apply changes now
cy: Gosod newidiadau nawr

# #14071
source: Allow file renaming and deletion
cy: Caniatáu ailenwi a dileu ffeiliau

# #14074
source: Set timezone
cy: Gosod cylch amser

# #14075
source: Use daylight saving time
cy: Defnyddio amser cynnilo golau dydd

# #14076
source: Add to favourites
cy: Ychwanegu at y ffefrynnau

# #14077
source: Remove from favourites
cy: Tynnu o'r ffefrynnau

# #14078
source: Colours
cy: Lliwiau

# #14079
source: Timezone country
cy: Gwlad y cylch amser

# #14080
source: Timezone
cy: Cylch amser

# #14081
source: File lists
cy: Rhestr ffeiliau

# #14082
source: Show EXIF picture information
cy: Dangos gwybodaeth llun EXIF

# #14083
source: Use a fullscreen window rather than true fullscreen
cy: Defnyddio ffenestr sgrin llawn yn lle gwir sgrin llawn

# #14084
source: Queue songs on selection
cy: Rhoi'r caneuon mewn rhestr wrth eu dewis

# #14086
source: Playback
cy: Chwarae

# #14087
source: DVDs
cy: DVD

# #14088
source: Play DVDs automatically
cy: Chwarae DVD yn awtomatig

# #14089
source: Font to use for text subtitles
cy: Ffont testun isdeitlau

# #14090
source: International
cy: Rhyngwladol

# #14091
source: Character set
cy: Set nod

# #14092
source: Debugging
cy: Dadfygio

# #14093
source: Security
cy: Diogelwch

# #14094
source: Input devices
cy: Dyfeisiau mewnbynnu

# #14095
source: Power saving
cy: Arbed ynni

# #14096
source: Rip
cy: Rhwygo

# #14097
source: Audio CD Insert Action
cy: Gweithred Mewnosod CD Sain

# #14098
source: Play
cy: Chwarae

# #14099
source: Eject disc when CD ripping is complete
cy: Bwrw allan disg wrth gwblhau rhwygo CD

# #14100
source: Stop ripping CD
cy: Atal rhwygo CD

# #14101
source: Acceleration
cy: Cyflymu

# #15012
source: Unavailable source
cy: Ffynhonnell ddim ar gael

# #15013
source: What would you like to do with media items from %s
cy: Beth hoffech chi ei wneud gydag eitemau cyfrwng o %s

# #15014
source: Keep
cy: Cadw

# #15015
source: Remove
cy: Tynnu

# #15016
source: Games
cy: Gemau

# #15019
source: Add
cy: Ychwanegu

# #15052
source: Password
cy: Cyfrinair

# #15100
source: Library
cy: Llyfrgell

# #15101
source: Database
cy: Cronfa Ddata

# #15102
source: * All albums
cy: * Pob albwm

# #15103
source: * All artists
cy: * Pob artist

# #15104
source: * All songs
cy: * Pob cân

# #15105
source: * All genres
cy: * Pob math

# #15107
source: Buffering...
cy: Byffro...

# #15108
source: Navigation sounds
cy: Synau symud

# #15109
source: Skin default
cy: Croen rhagosodedig

# #15110
source: Larger font size
cy: Maint ffont mwy

# #15111
source: Theme
cy: Thema

# #15112
source: Default theme
cy: Thema ragosodedig

# #15207
source: Connected
cy: Wedi cysylltu

# #15208
source: Not connected
cy: Heb gysylltu

# #15213
source: Play using...
cy: Chwarae gan ddefnyddio...

# #15214
source: Use smoothed A/V synchronisation
cy: Defnyddio cydweddu A?V llyfn

# #15215
source: Hide file names in thumbs view
cy: Cuddio enwau ffeil yn golwg lluniau bach

# #15216
source: Play in party mode
cy: Chwarae ym modd parti

# #15300
source: Path not found or invalid
cy: Heb ganfod y llwybr neu mae'n annilys

# #15301
source: Could not connect to network server
cy: Methu cysylltu â'r gweinydd rhwydwaith

# #15302
source: No servers found
cy: Heb ganfod gweinyddion

# #15303
source: Workgroup not found
cy: Methu canfod grŵp gwaith

# #15310
source: Opening multi-path source
cy: Agor ffynhonnell llwybr lluosog

# #15311
source: Path:
cy: Llwybr:

# #16000
source: General
cy: Cyffredinol

# #16002
source: Internet lookup
cy: Chwilio'r rhyngrwyd

# #16003
source: Player
cy: Chwaraewr

# #16004
source: Play media from disc
cy: Chwarae cyfrwng o ddisg

# #16008
source: Enter new title
cy: Rhowch deitl newydd

# #16009
source: Enter the movie name
cy: Rhowch enw ffilm

# #16010
source: Enter the profile name
cy: Rhowch enw proffil

# #16011
source: Enter the album name
cy: Rhowch enw albwm

# #16012
source: Enter the playlist name
cy: Rhowch enw rhestr chwarae

# #16013
source: Enter new filename
cy: Rhowch enw ffeil newydd

# #16014
source: Enter folder name
cy: Rhowch enw ffolder

# #16015
source: Enter directory
cy: Rhowch enw cyfeiriadur

# #16016
source: Available options: %A, %T, %N, %B, %D, %G, %Y, %F, %S
cy: Dewisiadau: %A, %T, %N, %B, %D, %G, %Y, %F, %S

# #16017
source: Enter search string
cy: Rhowch llinyn chwilio

# #16018
source: None
cy: Dim

# #16019
source: Auto select
cy: Awtoddewis

# #16020
source: De-interlace
cy: Dadgydblethiad

# #16022
source: Bob (inverted)
cy: Bob (yn groes)

# #16024
source: Cancelling...
cy: Diddymu...

# #16025
source: Enter the artist name
cy: Rhowch enw artist

# #16026
source: Playback failed
cy: Methodd y chwarae

# #16027
source: One or more items failed to play.
cy: Methodd un neu fwy o eitemau a chwarae.

# #16028
source: Enter value
cy: Rhowch werth

# #16029
source: Check the log file for details.
cy: Gwiriwch y ffeil cofnod am fanylion.

# #16030
source: Party mode aborted.
cy: Ataliwyd y modd parti.

# #16031
source: No matching songs in the library.
cy: Dim caneuon yn cydweddu yn y lyfrgell.

# #16032
source: Could not initialise database.
cy: Methy cychwyn cronfeydd data.

# #16033
source: Could not open database.
cy: Methu agor y gronfa ddata.

# #16034
source: Could not get songs from database.
cy: Methu estyn y caneuon o'r gronfa ddata.

# #16035
source: Party mode playlist
cy: Rhestr chwarae'r modd parti

# #16036
source: De-interlace (Half)
cy: Dadgydblethiad (Hanner)

# #16037
source: Deinterlace video
cy: Dadgydblethiad fideo

# #16038
source: Deinterlace method
cy: Dull dadgydblethu

# #16039
source: Off
cy: Diffodd

# #16040
source: Auto
cy: Awto

# #16041
source: On
cy: Ymlaen

# #16100
source: All Videos
cy: Pob Fideo

# #16101
source: Unwatched
cy: Heb eu Gwylio

# #16102
source: Watched
cy: Wedi eu Gwylio

# #16103
source: Mark as watched
cy: Nodi wedi Gwylio

# #16104
source: Mark as unwatched
cy: Nodi heb eu Gwylio

# #16105
source: Edit title
cy: Golygu teitl

# #16106
source: Manage...
cy: Rheoli...

# #16107
source: Edit sort title
cy: Golygu'r teitl trefnu

# #16200
source: Operation was aborted
cy: Atal y weithred

# #16201
source: Copy failed
cy: Methwyd y copïo

# #16202
source: Failed to copy at least one file
cy: Methwyd copïo o leiaf un ffeil

# #16203
source: Move failed
cy: Methodd y symud

# #16204
source: Failed to move at least one file
cy: Methwyd symud o leiaf un ffeil

# #16205
source: Delete failed
cy: Methodd y dileu

# #16206
source: Failed to delete at least one file
cy: Methwyd dileu o leiaf un ffeil

# #16300
source: Video scaling method
cy: Dull graddio fideo

# #16301
source: Nearest neighbour
cy: Cymydog agosaf

# #16302
source: Bilinear
cy: Deulinell

# #16303
source: Bicubic
cy: Deugiwbig

# #16307
source: Bicubic (software)
cy: Deugiwbig (meddalwedd)

# #16308
source: Lanczos (software)
cy: Lanczos (meddalwedd)

# #16309
source: Sinc (software)
cy: Sinc (meddalwedd)

# #16310
source: Temporal
cy: Amserol

# #16311
source: Temporal/Spatial
cy: Amserol/Gofodol

# #16312
source: (VDPAU)Noise Reduction
cy: (VDPAU)Lleihau Sain

# #16313
source: (VDPAU)Sharpness
cy: (VDPAU)Miniogrwydd

# #16314
source: Inverse Telecine
cy: Telcine yn groes

# #16315
source: Lanczos3 optimised
cy: Gwella ar gyfer Lanczos3

# #16316
source: Auto
cy: Awto

# #16317
source: Temporal (Half)
cy: Amserol (Hanner)

# #16318
source: Temporal/Spatial (Half)
cy: Amserol/Gofodol (Hanner)

# #16321
source: DXVA Best
cy: DXVA Gorau

# #16323
source: Spline36 optimised
cy: Gwella ar gyfer Spline36

# #16324
source: Software Blend
cy: Cymysgedd Meddalwedd

# #16400
source: Post-processing
cy: Ôl-brosesu

# #17500
source: Display sleep timeout
cy: Dangos terfyn amser cysgu

# #17997
source: %i MByte
cy: %i MBeit

# #17998
source: %i hours
cy: %i awr

# #17999
source: %i days
cy: %i diwrnod

# #19000
source: Switch to channel
cy: Newid i sianel

# #19001
source: Separate the search words by using AND, OR and/or NOT.
cy: Gwahannu'r geiriau chwilio drwy ddefnyddio AND, OR a/neu NOT.

# #19002
source: or use phrases to find an exact match, like "The wizard of Oz".
cy: neu ddefnyddio ymadroddion i ganfod r union air, fel "Y dewin dwl".

# #19003
source: Find similar
cy: Canfod tebyg

# #19004
source: Importing EPG from clients
cy: Mewnforio Amserlenydd o'r rhaglenni

# #19005
source: PVR stream information
cy: Gwybodaeth ffrwd Recordydd

# #19006
source: Receiving device
cy: Derbyn dyfais

# #19007
source: Device status
cy: Statws dyfais

# #19008
source: Signal quality
cy: Ansawdd signal

# #19012
source: PVR Backend
cy: Cefn y Recordydd

# #19013
source: Free to air
cy: Darllediadau rhydd

# #19014
source: Fixed
cy: Sefydlog

# #19015
source: Encryption
cy: Amgryptiad

# #19016
source: PVR Backend %i - %s
cy: Cefn y Recordydd %i - %s

# #19017
source: Recordings
cy: Recordiadau

# #19018
source: Folder with channel icons
cy: Ffolder gyda eiconau sianel

# #19019
source: Channels
cy: Sianeli

# #19020
source: TV
cy: Teledu

# #19022
source: Hidden
cy: Cudd

# #19023
source: TV channels
cy: Sianeli teledu

# #19024
source: Radio channels
cy: Sianeli radio

# #19025
source: Upcoming recordings
cy: Recordiadau ar y gorwel

# #19026
source: Add timer...
cy: Ychwanegu amserydd...

# #19027
source: No search results
cy: Dim canlyniadau chwilio

# #19028
source: No EPG entries
cy: Dim cofnodion Amserlenydd

# #19029
source: Channel
cy: Sianel

# #19030
source: Now
cy: Nawr

# #19031
source: Next
cy: Nesaf

# #19032
source: Timeline
cy: Llinell amser

# #19033
source: Information
cy: Gwybodaeth

# #19034
source: Already started recording on this channel
cy: Eisoes wedi cychwyn recordio ar y sianel

# #19035
source: %s could not be played. Check the log for details.
cy: Methwyd chwarae %s. Gwiriwch y cofnod am fanylion.

# #19036
source: This recording cannot be played. Check the log for details.
cy: Niod oes modd chwarae'r recordiad. Darllenwch y cofnod am wybodaeth bellach.

# #19037
source: Show signal quality
cy: Dangos ansawdd signal

# #19038
source: Not supported by the PVR backend.
cy: Nid yw'n cael ei gynnal gan gefn y Recordydd.

# #19039
source: Are you sure you want to hide this channel?
cy: Ydych chi'n siŵr eich bod am guddio'r sianel hon?

# #19040
source: Timer
cy: Amserydd

# #19041
source: Are you sure you want to rename this recording?
cy: Ydych chi'n siŵr eich bod am ailenwi'r recordiad hwn?

# #19042
source: Are you sure you want to rename this timer?
cy: Ydych chi'n siŵr eich bod am ailenwi'r amserydd?

# #19043
source: Recording
cy: Recordio

# #19044
source: Please check your configuration or check the log for details.
cy: Gwiriwch eich ffurfweddiad neu ddarllen eich cofnod am fanylion.

# #19045
source: No PVR clients have been started yet. Wait for the PVR clients to start up or check the log for details.
cy: Nid oes clientiaid Recordydd wedi eu cychwyn eto. Arhoswch i'r client Recordydd gychwyn neu ddarllen y cofnod am fanylion.

# #19046
source: New channel
cy: Sianel newydd

# #19047
source: Programme info
cy: Gwybodaeth rhaglenni

# #19048
source: Group management
cy: Rheolwr grŵp

# #19049
source: Show channel
cy: Dangos sianel

# #19050
source: Show visible channels
cy: Dangos sianeli gweladwy

# #19051
source: Show hidden channels
cy: Dangos sianeli cudd

# #19052
source: Move channel to:
cy: Symud sianel i:

# #19053
source: Recording information
cy: Gwybodaeth am recordio

# #19054
source: Hide channel
cy: Cuddio sianel

# #19055
source: No information available
cy: Dim gwybodaeth ar gael

# #19056
source: New timer
cy: Amserydd newydd

# #19057
source: Edit timer
cy: Golygu amserydd

# #19058
source: Timer enabled
cy: Galluogi amserydd

# #19059
source: Stop recording
cy: Atal recordio

# #19060
source: Delete timer
cy: Dileu'r amserydd

# #19061
source: Add timer
cy: Ychwanegu amserydd

# #19062
source: Sort by: Channel
cy: Trefnu: Sianel

# #19063
source: Go to begin
cy: Mynd i'r dechrau

# #19064
source: Go to end
cy: Mynd i'r diwedd

# #19066
source: Channel icons
cy: Eiconau sianel

# #19067
source: This event is already being recorded.
cy: Mae'r digwyddiad eisoes yn cael ei recordio.

# #19068
source: This recording could not be deleted. Check the log for details.
cy: Nid oedd modd dileu'r recordiad hwn. Gwiriwch y cofnod am fanylion.

# #19069
source: EPG
cy: Amserlenydd

# #19070
source: Go to now
cy: Mynd i nawr

# #19071
source: EPG update interval
cy: Diweddaru'r Amserlenydd pob

# #19072
source: Do not store the EPG in the database
cy: Peidio cadw'r Amserlenydd yn y gronfa ddata

# #19073
source: Delay channel switch
cy: Oedi newid sianel

# #19074
source: Active:
cy: Byw:

# #19075
source: Name:
cy: Enw:

# #19076
source: Folder:
cy: Ffolder:

# #19078
source: Channel:
cy: Sianel:

# #19079
source: Day:
cy: Diwrnod:

# #19080
source: Begin:
cy: Cychwyn:

# #19081
source: End:
cy: Diwedd:

# #19082
source: Priority:
cy: Blaenoriaeth:

# #19083
source: Lifetime (days):
cy: Oes (dyddiau):

# #19084
source: First day:
cy: Diwrnod cyntaf:

# #19085
source: Unknown channel %u
cy: Sianel anhysbys %u

# #19086
source: Mo-__-__-__-__-__-__
cy: Ll-__-__-__-__-__-__

# #19087
source: __-Tu-__-__-__-__-__
cy: __-Ma-__-__-__-__-__

# #19088
source: __-__-We-__-__-__-__
cy: __-__-Me-__-__-__-__

# #19089
source: __-__-__-Th-__-__-__
cy: __-__-__-Ia-__-__-__

# #19090
source: __-__-__-__-Fr-__-__
cy: __-__-__-__-Gw-__-__

# #19093
source: Mo-Tu-We-Th-Fr-__-__
cy: Ll-Ma-Me-Ia-Gw-__-__

# #19094
source: Mo-Tu-We-Th-Fr-Sa-__
cy: Ll-Ma-Me-Ia-Gw-Sa-__

# #19095
source: Mo-Tu-We-Th-Fr-Sa-Su
cy: Ll-Ma-Me-Ia-Gw-Sa-Su

# #19097
source: Enter the name for the recording
cy: Rhowch enw i'r recordiad

# #19098
source: Warning
cy: Rhybudd

# #19099
source: Service
cy: Gwasanaeth

# #19101
source: Provider
cy: Darparwr

# #19102
source: Please switch to another channel.
cy: Newidiwch i sianel arall.

# #19103
source: Go to channel
cy: Mynd i sianel

# #19104
source: Enter the name of the folder for the recording
cy: Rhowch enw ffolder ar gyfer y recordiad

# #19105
source: Please select a channel
cy: Dewiswch sianel

# #19106
source: Next timer on
cy: Amserydd nesaf ar

# #19107
source: at
cy: am

# #19109
source: Couldn't save timer. Check the log for details.
cy: Methu cadw'r amserydd. Darllenwch y cofnod am fanylion.

# #19110
source: An unexpected error occurred. Try again later or check the log for details.
cy: Digwyddodd gwall annisgwyl. Ceisiwch eto'n hwyrach neu darllenwch y cofnod am fanylion.

# #19111
source: PVR backend error. Check the log for details.
cy: Gwall offer cefn y Recordydd. Darllenwch y cofnod am fanylion.

# #19112
source: Delete this recording?
cy: Dileu'r recordiad?

# #19113
source: Delete all recordings in this folder?
cy: Dileu pob recordiad yn y ffolder?

# #19114
source: Version
cy: Fersiwn

# #19115
source: Address
cy: Cyfeiriad

# #19116
source: Disksize
cy: Maint disg

# #19117
source: Search for channels
cy: Chwilio am sianeli

# #19118
source: Cannot use PVR functions while searching.
cy: Methu defnyddio swyddogaethau Recordydd tra'n chwilio.

# #19119
source: On which server do you want to search?
cy: Ar ba weinydd hoffech chi chwilio?

# #19120
source: Client number
cy: Rhif cleient

# #19121
source: Avoid repeats
cy: Osgoi ailadroddiadau

# #19122
source: This timer is still recording. Are you sure you want to delete this timer?
cy: Mae'r amserydd yn dal i recordio. Ydych chi'n siŵr eich bod eisiau dileu'r amserydd?

# #19123
source: Free to air channels only
cy: Sianeli rhydd yn unig

# #19124
source: Ignore present timers
cy: Anwybyddu'r amseryddion cyfredol

# #19125
source: Ignore present recordings
cy: Anwybyddu'r recordiadau cyfredol

# #19126
source: Start time
cy: Amser cychwyn

# #19127
source: End time
cy: Amser gorffen

# #19128
source: Start date
cy: Dyddiad cychwyn

# #19129
source: End date
cy: Dyddiad gorffen

# #19130
source: Minimum duration
cy: Hyd mwyaf

# #19131
source: Maximum duration
cy: Hyd mwyaf

# #19132
source: Include unknown genres
cy: Cynnwys mathau anhysbys

# #19133
source: Search string
cy: Chwilio llinyn

# #19134
source: Include description
cy: Cynnwys disgrifiad

# #19135
source: Case sensitive
cy: Llythrennau MAWR/bach

# #19136
source: Channel unavailable
cy: Sianel ddim ar gael

# #19137
source: No groups defined
cy: Neb ddiffinio grwpiau

# #19138
source: Please create a group first
cy: Crëwch grŵp yn gyntaf

# #19139
source: Name of the new group
cy: Enw'r grŵp newydd

# #19140
source: Search...
cy: Chwilio...

# #19141
source: Group
cy: Grŵp

# #19142
source: Search guide
cy: Canllaw chwilio

# #19143
source: Group management
cy: Rheoli grŵp

# #19144
source: No groups defined
cy: Neb ddiffinio grwpiau

# #19145
source: Grouped
cy: Wedi eu grwpio

# #19146
source: Groups
cy: Grwpiau

# #19147
source: The PVR backend does not support this action. Check the log for details.
cy: Nid yw offer cefn y Recordydd yn cynnal y weithred hon. Darllenwch y cofnod am fanylion.

# #19148
source: Channel
cy: Sianel

# #19149
source: Mo
cy: Ll

# #19150
source: Tu
cy: Ma

# #19151
source: We
cy: Me

# #19152
source: Th
cy: Ia

# #19153
source: Fr
cy: Gw

# #19156
source: from
cy: o

# #19157
source: Next recording
cy: Recordiad nesaf

# #19158
source: Currently recording
cy: Wrthi'n recordio

# #19159
source: from
cy: o

# #19160
source: to
cy: tan

# #19162
source: Recording active
cy: Recordio'n fyw

# #19163
source: Recordings
cy: Recordiadau

# #19164
source: Cannot start recording. Check the log for details.
cy: Methu cychwyn recordio. Darllenwch y cofnod am fanylion.

# #19165
source: Switch
cy: Newid

# #19166
source: PVR information
cy: Gwybodaeth am y Recordydd

# #19167
source: Scan for missing icons
cy: Sganio am eiconau coll

# #19169
source: Hide video information box
cy: Cuddio blwch gwybodaeth fideo

# #19170
source: Timeout when starting playback
cy: Amser allan wrth gychwyn chwarae

# #19171
source: Start playback minimised
cy: Cychwyn chwarae nôl yn fach

# #19172
source: Instant recording duration
cy: Hyd recordio cyflym

# #19173
source: Default recording priority
cy: Blaenoriaeth recordio rhagosodedig

# #19174
source: Default recording lifetime
cy: Cadw recordiad am

# #19175
source: Margin at the start of a recording
cy: Cyfnod ar gychwyn recordiad

# #19176
source: Margin at the end of a recording
cy: Cyfnod ar ddiwedd recordiad

# #19177
source: Playback
cy: Chwarae

# #19178
source: Show channel information when switching channels
cy: Dangos gwybodaeth am y sianel wrth ei newid

# #19180
source: TV
cy: Teledu

# #19181
source: Menu/OSD
cy: Dewislen/Dangosydd

# #19182
source: Days to display in the EPG
cy: Sawl diwrnod i'w dangos yn yr Amserlenydd

# #19185
source: Reset the PVR database
cy: Ailosod cronfa ddata'r Recordydd

# #19186
source: All data in the PVR database is being erased
cy: Mae'r holl ddata yng ngronfa ddata'r Recordydd yn cael ei ddileu

# #19187
source: Reset the EPG database
cy: Ailosod cronfa ddata'r Amserlenydd

# #19188
source: EPG is being reset
cy: Mae'r Amserlenydd yn cael ei ailosod

# #19189
source: Continue last channel on startup
cy: Parhau ar y sianel diwethaf wrth gychwyn

# #19190
source: Background
cy: Cefndir

# #19191
source: PVR service
cy: Gwasanaeth Recordydd

# #19192
source: None of the connected PVR backends supports scanning for channels.
cy: Nid oes yr un o'r offer cefn Recordydd yn cynnal sganio am sianeli.

# #19193
source: The channel scan cannot be started. Check the log for details.
cy: Nid oes modd cychwyn sganio sianeli. Darllenwch y cofnod am wybodaeth.

# #19194
source: Continue?
cy: Parhau?

# #19195
source: Client actions
cy: Gweithredoedd clientiaid

# #19196
source: PVR client specific actions
cy: Gweithredoedd penodol cleient Recordydd

# #19197
source: Recording started on: %s
cy: Cychwynodd recordio ar: %s

# #19198
source: Recording finished on: %s
cy: Gorffennodd recordio ar: %s

# #19199
source: Channel manager
cy: Rheolwr sianeli

# #19200
source: EPG source:
cy: Ffynhonnell Amserlenydd:

# #19201
source: Channel name:
cy: Enw sianel:

# #19202
source: Channel icon:
cy: Eicon sianel:

# #19203
source: Edit channel
cy: Golygu sianel

# #19204
source: New channel
cy: Sianel newydd

# #19205
source: Group management
cy: Rheoli grŵp

# #19206
source: Activate EPG:
cy: Cychwyn yr Amserlenydd:

# #19207
source: Group:
cy: Grŵp:

# #19208
source: Enter the name of the new channel
cy: Rhowch enw'r sianel newydd
