Repository: xbmc/xbmc
Catalog: language/Welsh/strings.po
Languages: cy

# #0
source: Programs
cy: Rhaglenni

# #1
source: Pictures
cy: Lluniau

# #2
source: Music
cy: Cerddoriaeth

# #3
source: Videos
cy: Fideo

# #4
source: TV-Guide
cy: Rhaglenni Teledu

# #5
source: Settings
cy: Gosodiadau

# #6
source: Kodi SVN
cy: SVN Kodi

# #7
source: File manager
cy: Rheolwr ffeiliau

# #8
source: Weather
cy: Tywydd

# #9
source: Kodi media center
cy: canolfan cyfryngau Kodi

# #11
source: Monday
cy: Dydd Llun

# #12
source: Tuesday
cy: Dydd Mawrth

# #13
source: Wednesday
cy: Dydd Mercher

# #14
source: Thursday
cy: Dydd Iau

# #15
source: Friday
cy: Dydd Gwener

# #16
source: Saturday
cy: Dydd Sadwrn

# #17
source: Sunday
cy: Dydd Sul

# #21
source: January
cy: Ionawr

# #22
source: February
cy: Chwefror

# #23
source: March
cy: Mawrth

# #24
source: April
cy: Ebrill

# #25
source: May
cy: Mai

# #26
source: June
cy: Mehefin

# #27
source: July
cy: Gorffennaf

# #28
source: August
cy: Awst

# #29
source: September
cy: Medi

# #30
source: October
cy: Hydref

# #31
source: November
cy: Tachwedd

# #32
source: December
cy: Rhagfyr

# #41
source: Mon
cy: Llu

# #42
source: Tue
cy: Maw

# #43
source: Wed
cy: Mer

# #44
source: Thu
cy: Iau

# #45
source: Fri
cy: Gwe

# #46
source: Sat
cy: Sad

# #47
source: Sun
cy: Sul

# #51
source: Jan
cy: Ion

# #52
source: Feb
cy: Chw

# #53
source: Mar
cy: Maw

# #54
source: Apr
cy: Ebr

# #55
source: May
cy: Mai

# #56
source: Jun
cy: Meh

# #57
source: Jul
cy: Gorf

# #58
source: Aug
cy: Aws

# #59
source: Sep
cy: Med

# #60
source: Oct
cy: Hyd

# #61
source: Nov
cy: Tac

# #62
source: Dec
cy: Rha

# #71
source: N
cy: G

# #72
source: NNE
cy: GGD

# #73
source: NE
cy: GD

# #74
source: ENE
cy: DGD

# #75
source: E
cy: D

# #76
source: ESE
cy: DDeD

# #77
source: SE
cy: DeD

# #78
source: SSE
cy: DeDeD

# #79
source: S
cy: De

# #80
source: SSW
cy: DeDeG

# #81
source: SW
cy: DeGo

# #82
source: WSW
cy: GoDeG

# #83
source: W
cy: Go

# #84
source: WNW
cy: GoGGo

# #85
source: NW
cy: GGo

# #86
source: NNW
cy: GGGo

# #88
source: South
cy: De

# #89
source: North
cy: Gogledd

# #90
source: West
cy: Gorllewin

# #91
source: East
cy: DwyrAIN

# #92
source: Variable
cy: Amrywiol

# #98
source: View: Auto
cy: Golwg: Awto

# #99
source: View: Auto big
cy: Golwg: Awto mawr

# #100
source: View: Icons
cy: Golwg: Eiconau

# #101
source: View: List
cy: Golwg: Rhestr

# #102
source: Scan
cy: Sganio

# #103
source: Sort by: Name
cy: Trefnu: Enw

# #104
source: Sort by: Date
cy: Trefnu: Dyddiad

# #105
source: Sort by: Size
cy: Trefnu: Maint

# #106
source: No
cy: Na

# #107
source: Yes
cy: Iawn

# #108
source: Slideshow
cy: Sioe Sleidiau

# #109
source: Create thumbs
cy: Creu lluniau

# #110
source: Create thumbnails
cy: Creu lluniau

# #111
source: Shortcuts
cy: Llwybrau byr

# #112
source: Paused
cy: Oediwyd

# #113
source: Update failed
cy: Methodd y diweddariad

# #114
source: Installation failed
cy: Methwyd gosod

# #115
source: Copy
cy: Copïo

# #116
source: Move
cy: Symud

# #117
source: Delete
cy: Dileu

# #118
source: Rename
cy: Ailenwi

# #119
source: New folder
cy: Ffolder newydd

# #120
source: Confirm file copy
cy: Cadarnhau copïo ffeil

# #121
source: Confirm file move
cy: Cadarnhau symud ffeil

# #122
source: Confirm delete
cy: Cadarnhau dileu

# #123
source: Copy these files?
cy: Copïo'r ffeiliau?

# #124
source: Move these files?
cy: Symud y ffeiliau?

# #125
source: Delete these files? - Deleting files cannot be undone!
cy: Dileu'r ffeiliau? - Nid oes modd dadwneud hyn!

# #126
source: Status
cy: Statws

# #127
source: Objects
cy: Gwrthrychau

# #128
source: General
cy: Cyffredinol

# #129
source: Slideshow
cy: Sioe Sleidiau

# #130
source: System info
cy: Gwybodaeth system

# #131
source: Display
cy: Dangosydd

# #132
source: Albums
cy: Album

# #133
source: Artists
cy: Artistiaid

# #134
source: Songs
cy: Caneuon

# #135
source: Genres
cy: Mathau

# #136
source: Playlists
cy: Rhestrau chwarae

# #137
source: Search
cy: Chwilio

# #138
source: System Information
cy: Gwybodaeth System

# #139
source: Temperatures:
cy: Tymheredd:

# #142
source: Time:
cy: Amser:

# #143
source: Current:
cy: Cyfredol:

# #144
source: Build:
cy: Adeiledd:

# #145
source: Network:
cy: Rhwydwaith:

# #146
source: Type:
cy: Math:

# #147
source: Static
cy: Statig

# #149
source: MAC address
cy: Cyfeiriad MAC

# #150
source: IP address
cy: Cyfeiriad IP

# #151
source: Link:
cy: Cysylltiad:

# #152
source: Half duplex
cy: Hanner duplex

# #153
source: Full duplex
cy: Duplex llawn

# #154
source: Storage
cy: Storfa

# #155
source: Drive
cy: Gyrrwr

# #156
source: Free
cy: Rhydd

# #157
source: Video
cy: Fideo

# #158
source: Free memory
cy: Cof rhydd

# #159
source: No link
cy: Dim cysylltiad

# #160
source: Free
cy: Rhydd

# #161
source: Unavailable
cy: Dim ar gael

# #162
source: Tray open
cy: Dror ar agor

# #163
source: Reading
cy: Darllen

# #164
source: No disc
cy: Dim disg

# #165
source: Disc present
cy: Disg ar gael

# #166
source: Skin
cy: Croen

# #167
source: Cancel file operations
cy: Diddymu gweithrediad ffeil

# #169
source: Resolution
cy: Cydraniad

# #170
source: Adjust display refresh rate to match video
cy: Cyfradd adnewyddu dangosydd i gydfynd â'r fideo

# #171
source: Sort title
cy: Trefnu teitl

# #172
source: Release date
cy: Dyddiad ryddhau

# #173
source: Display 4:3 videos as
cy: Dangos fideo 4:3 fel

# #175
source: Moods
cy: Hwyliau

# #176
source: Styles
cy: Arddulliau

# #179
source: Song
cy: Cân

# #180
source: Duration
cy: Hyd

# #181
source: Select album
cy: Dewis album

# #182
source: Tracks
cy: Traciau

# #183
source: Review
cy: Adolygiadau

# #184
source: Refresh
cy: Adnewyddu

# #185
source: Searching album
cy: Chwilio album

# #186
source: OK
cy: Iawn

# #187
source: No albums found!
cy: Heb ganfod album!

# #188
source: Select all
cy: Dewis popeth

# #189
source: Scanning media info
cy: Sganio gwybodaeth cyfrwng

# #190
source: Save
cy: Cadw

# #191
source: Shuffle
cy: Cymysgu

# #192
source: Clear
cy: Clirio

# #193
source: Scan
cy: Sgan

# #194
source: Searching...
cy: Chwilio...

# #195
source: No info found!
cy: Heb ganfod gwybodaeth!

# #196
source: Select movie:
cy: Dewis ffilm:

# #197
source: Querying %s info
cy: Ymholi gwybodaeth %s

# #198
source: Loading movie details
cy: Llwytho manylion ffilm

# #199
source: Web interface
cy: Rhyngwyneb gwe

# #200
source: Audio encoders
cy: Amgodwyr sain

# #202
source: Tagline
cy: Llinell tag

# #203
source: Plot outline
cy: Amlinelliad y stori

# #205
source: Votes
cy: Pleidleisiau

# #208
source: Play
cy: Chwarae

# #209
source: Next
cy: Nesaf

# #210
source: Previous
cy: Blaenorol

# #213
source: Calibrate user interface...
cy: Calibro rhyngwyneb y defnyddiwr...

# #214
source: Video calibration...
cy: Calibro'r fideo...

# #215
source: Soften
cy: Meddalu

# #216
source: Zoom amount
cy: Maint y chwyddo

# #217
source: Pixel ratio
cy: Cymhareb picseli

# #218
source: DVD drive
cy: Gyrrwr DVD

# #219
source: Please insert disc
cy: Mewnosodwch ddisg

# #220
source: Remote share
cy: Rhaniad pell

# #221
source: Network is not connected
cy: Nid yw'r rhwydwaith wedi ei gysylltu

# #222
source: Cancel
cy: Diddymu

# #224
source: Speed
cy: Cyflymder

# #225
source: Vertical Shift
cy: Symud fertigol

# #226
source: Test patterns...
cy: Patrymau prawf...

# #227
source: Lookup audio CD track names from freedb.org
cy: Chwilio enwau'r traciau CD o freedb.org

# #228
source: Shuffle playlist on load
cy: Cymysgu'r rhestr chwarae wrth lwytho

# #229
source: HDD spindown time
cy: Amser arafu'r disg caled

# #230
source: Video filters
cy: Hidlau fideo

# #231
source: None
cy: Dim

# #232
source: Point
cy: Pwynt

# #233
source: Linear
cy: Llinellol

# #234
source: Anisotropic
cy: Anisotropig

# #236
source: Gaussian cubic
cy: Ciwbig Gausianaidd

# #237
source: Minification
cy: Lleihau

# #238
source: Magnification
cy: Mwyhau

# #239
source: Clear playlist on finish
cy: Clirio'r rhestr chwarae wrth gau

# #240
source: Display Mode
cy: Modd Dangos

# #241
source: Full Screen #%d
cy: #%d Sgrin Lawn

# #242
source: Windowed
cy: Ffenestrwyd

# #243
source: Refresh Rate
cy: Cyfradd Adnewyddu

# #244
source: Full screen
cy: Sgrin Lawn

# #245
source: Sizing: (%i,%i)->(%i,%i) (Zoom x%2.2f) AR:%2.2f:1 (Pixels: %2.2f:1) (VShift: %2.2f)
cy: Meintioli: (%i,%i)->(%i,%i) (Chwyddo x%2.2f) AR:%2.2f:1 (Picseli: %2.2f:1) (VShift: %2.2f)

# #247
source: Scripts
cy: Sgriptiau

# #248
source: Language
cy: Iaith

# #249
source: Music
cy: Cerddoriaeth

# #250
source: Visualisation
cy: Delweddu

# #251
source: Select destination directory
cy: Dewis cyfeiriadur targed

# #252
source: Stereo upmix
cy: Uwch gymysgu stereo

# #253
source: Number of channels
cy: Nifer o sianeli

# #254
source: DTS capable receiver
cy: Derbynnydd DTS galluog

# #256
source: Fetching CD information
cy: Estyn gwybodaeth CD

# #257
source: Error
cy: Gwall

# #258
source: Enable tag reading
cy: Galluogi darllen tag

# #259
source: Opening
cy: Agor

# #261
source: Waiting for start...
cy: Aros i ddechrau...

# #262
source: Scripts output
cy: Allbwn sgriptiau

# #263
source: Allow control of Kodi via HTTP
cy: Caniatáu rheoli Kodi drwy HTTP

# #264
source: Record
cy: Recordio

# #265
source: Stop Rec.
cy: Atal Rec.

# #266
source: Sort by: Track
cy: Trefnu: Trac

# #267
source: Sort by: Time
cy: Trefnu: Amser

# #268
source: Sort by: Title
cy: Trefnu: Teitl

# #269
source: Sort by: Artist
cy: Trefnu: Artist

# #270
source: Sort by: Album
cy: Trefnu: Album

# #271
source: Top 100
cy: 100 Uchaf

# #272
source: Top-Left overscan compensation
cy: Cydadferiad tros-sganio Brig Chwith

# #273
source: Bottom-Right overscan compensation
cy: Cydadferiad tros-sganio Gwaelod De

# #274
source: Subtitle positioning
cy: Gosod isdeitlau

# #275
source: Pixel ratio adjustment
cy: Newid cyfradd picseli

# #276
source: Adjust the arrow to change the amount of overscan
cy: Newid y saeth i newid maint y tros-sganio

# #277
source: Adjust the bar to change the subtitles position
cy: Newid y bar i newid safle'r isdeitlau

# #278
source: Adjust the rectangle so it is perfectly square
cy: Newid y petryal fel ei fod yn berffaith sgwâr

# #279
source: Unable to load settings
cy: Methu llwytho'r gosodiadau

# #280
source: Using default settings
cy: Defnyddio'r gosodiadau rhagosodedig

# #281
source: Please check the XML files
cy: Gwiriwch y ffeil XML

# #282
source: Found %i items
cy: Canfuwyd %i eitem

# #283
source: Search results
cy: Canyniadau chwilio

# #284
source: No results found
cy: Dim canlyniadau

# #285
source: Preferred audio language
cy: Hoff iaith sain

# #286
source: Preferred subtitle language
cy: Hoff iaith isdeitlau

# #287
source: Subtitles
cy: Isdeitlau

# #288
source: Font
cy: Ffont

# #289
source: Size
cy: Maint

# #290
source: Dynamic range compression
cy: Cywasgiad ystod dynamig

# #291
source: Video
cy: Fideo

# #292
source: Audio
cy: Sain

# #293
source: Browse for subtitles
cy: Pori am isdeitlau

# #294
source: Create bookmark
cy: Creu nod tudalen

# #296
source: Clear bookmarks
cy: Clirio nodau tudalen

# #297
source: Audio offset
cy: Atred sain

# #298
source: Bookmarks
cy: Nodau Tudalen

# #300
source: MP1 capable receiver
cy: Derbynnydd MP1 galluog

# #301
source: MP2 capable receiver
cy: Derbynnydd MP2 galluog

# #302
source: MP3 capable receiver
cy: Derbynnydd MP3 galluog

# #303
source: Delay
cy: Oediad

# #304
source: Language
cy: Iaith

# #305
source: Enabled
cy: Galluogwyd

# #306
source: Non-interleaved
cy: Anrhyngweithiol

# #308
source: Original stream's language
cy: Iaith wreiddiol y ffrwd

# #309
source: User interface language
cy: Defnyddio iaith y rhyngwyneb

# #310
source: Keyboard layouts
cy: Cynllun bysellfwrdd

# #313
source: Cleaning database
cy: Glanhau'r gronfa ddata

# #314
source: Preparing...
cy: Paratoi...

# #315
source: Database error
cy: Gwall cronfa ddata

# #316
source: Searching songs...
cy: Chwilio caneuon...

# #317
source: Cleaned database successfully
cy: Wedi glanhau'r gronfa ddata'n llwyddiannus

# #318
source: Cleaning songs...
cy: Glanhau caneuon...

# #319
source: Error cleaning songs
cy: Gwall wrth lanhau caneuon

# #320
source: Cleaning artists...
cy: Glanhau artistiaid...

# #321
source: Error cleaning artists
cy: Gwall wrth lanhau artistiaid

# #322
source: Cleaning genres...
cy: Glanhau mathau...

# #323
source: Error cleaning genres
cy: Gwall wrth lanhau mathau

# #324
source: Cleaning paths...
cy: Glanhau llwybrau...

# #325
source: Error cleaning paths
cy: Gwall wrth lanhau llwybrau

# #326
source: Cleaning albums...
cy: Glanhau albymau...

# #327
source: Error cleaning albums
cy: Gwall wrth lanhau albymau

# #328
source: Writing changes...
cy: Ysgrifennu newidiadau...

# #329
source: Error writing changes
cy: Gwall wrth ysgrifennu newidiadau

# #330
source: This may take some time...
cy: Gall hyn gymryd peth amser...

# #331
source: Compressing database...
cy: Cywasgu cronfa ddata...

# #332
source: Error compressing database
cy: Gwall wrth gywasgu cronfa ddata

# #333
source: Do you want to clean the library?
cy: Hoffech chi lanhau'r llyfrgell?

# #334
source: Clean library...
cy: Glanhau'r llyfrgell...

# #335
source: Start
cy: Cychwyn

# #336
source: Framerate conversion
cy: Trosi'r raddfa fframiau

# #337
source: Output configuration
cy: Ffurfweddu'r allbwn

# #338
source: Fixed
cy: Sefydlog

# #339
source: Optimized
cy: Gorau

# #340
source: Various artists
cy: Artistiaid amrywiol

# #341
source: Play disc
cy: Disgiau

# #342
source: Movies
cy: Ffilmiau

# #343
source: Adjust framerate
cy: Newid graddfa ffrâm

# #344
source: Actors
cy: Actorion

# #345
source: Year
cy: Blwyddyn

# #346
source: Normalize levels on downmix
cy: Normaleiddio lefelau'r isgymysgu

# #347
source: DTS-HD capable receiver
cy: Derbynnydd DTS-HD galluog

# #348
source: Enable passthrough
cy: Galluogi pasio drwodd

# #349
source: TrueHD capable receiver
cy: Derbynnydd TrueHD galluog

# #350
source: Programs
cy: Rhaglenni

# #351
source: Off
cy: Diffodd

# #352
source: Dim
cy: Pylu

# #353
source: Black
cy: Du

# #354
source: Matrix trails
cy: Olion matrics

# #355
source: Screensaver time
cy: Cychwyn yr arbedwr sgrin ar ôl

# #356
source: Screensaver mode
cy: Arbedwr sgrin

# #357
source: Shutdown function timer
cy: Amserydd swyddogaeth cau

# #358
source: All albums
cy: Pob albwm

# #359
source: Recently added albums
cy: Albymau wedi eu hychwanegu'n ddiweddar

# #360
source: Screensaver
cy: Arbedwr sgrin

# #361
source: R. Slideshow
cy: Sioe sleidiau R.

# #362
source: Screensaver dim level
cy: Lefel pylu arbedwr sgrin

# #363
source: Sort by: File
cy: Trefnu: Ffeil

# #364
source: Dolby Digital (AC3) capable receiver
cy: Derbynnydd Dolby Digital (AC3) galluog

# #365
source: Sort by: Name
cy: Trefnu: Enw

# #366
source: Sort by: Year
cy: Trefnu: Blwyddyn

# #367
source: Sort by: Rating
cy: Trefnu: Graddio

# #369
source: Title
cy: Teitl

# #370
source: Thunderstorms
cy: Mellt

# #371
source: Partly
cy: Rhannol

# #372
source: Mostly
cy: Gan fwyaf

# #373
source: Sunny
cy: Heulog

# #374
source: Cloudy
cy: Cymylog

# #375
source: Snow
cy: Eira

# #376
source: Rain
cy: Glaw

# #377
source: Light
cy: Ysgafn

# #380
source: Showers
cy: Cawodydd

# #381
source: Few
cy: Ychydig o

# #382
source: Scattered
cy: Ar wasgar

# #383
source: Wind
cy: Gwynt

# #384
source: Strong
cy: Cryf

# #385
source: Fair
cy: Braf

# #386
source: Clear
cy: Clir

# #387
source: Clouds
cy: Cymylau

# #388
source: Early
cy: Cynnar

# #389
source: Shower
cy: Cawodydd

# #390
source: Flurries
cy: Cawodydd

# #391
source: Low
cy: Isel

# #392
source: Medium
cy: Canolig

# #393
source: High
cy: Uchel

# #394
source: Fog
cy: Niwl

# #395
source: Haze
cy: Tawch

# #396
source: Select location
cy: Dewis lleoliad

# #397
source: Refresh time
cy: Amser adnewyddu

# #398
source: Temperature units
cy: Unedau tymeredd

# #399
source: Speed units
cy: Unedau cyflymder

# #400
source: Weather
cy: Tywydd

# #401
source: Temp
cy: Tym

# #402
source: Feels like
cy: Teimlo fel

# #403
source: UV index
cy: Mynegai UV

# #404
source: Wind
cy: Gwynt

# #405
source: Dew point
cy: Gwlithbwynt

# #406
source: Humidity
cy: Lleithder

# #409
source: Defaults
cy: Rhagosodiad

# #410
source: Accessing weather service
cy: Cyrchu gwasanaeth tywydd

# #411
source: Getting weather for:
cy: Cyrchu tywydd:

# #412
source: Unable to get weather data
cy: Methu cyrchu data tywydd

# #413
source: Manual
cy: Gyda llaw

# #414
source: No review for this album
cy: Dim adolygiad o'r albwm

# #415
source: Downloading thumbnail...
cy: Llwytho llun bach i lawr ...

# #416
source: Not available
cy: Dim ar gael

# #417
source: View: Big icons
cy: Golwg: Eiconau mawr

# #418
source: Low
cy: Isel

# #419
source: High
cy: Uchel

# #420
source: Best Match
cy: Cydweddiad Gorau

# #421
source: Keep audio device alive
cy: Cadw'r ddyfais sain yn fyw

# #422
source: Delete album info
cy: Dileu gwybodaeth albwm

# #423
source: Delete CD information
cy: Dileu gwybodaeth CD

# #424
source: Select
cy: Dewis

# #425
source: No album information found
cy: Heb ganfod gwybodaeth albwm

# #426
source: No CD information found
cy: Dim gwyboaeth CD ar gael

# #427
source: Disc
cy: Disg

# #428
source: Insert correct CD/DVD
cy: Mewnosod y CD/DVD cywir

# #429
source: Please insert the following disc:
cy: Mewnosodwch y ddisg ganlynol:

# #430
source: Sort by: DVD#
cy: Trefnu: DVD#

# #431
source: No cache
cy: Dim storfa

# #432
source: Remove movie from library
cy: Tynnu ffilm o'r llyfrgell

# #433
source: Really remove '%s'?
cy: Tynnu '%s'?

# #434
source: From %s at %i %s
cy: O %s yn %i %s

# #435
source: No optical disc drive detected
cy: Heb ganfod gyrrwr disg optegol

# #436
source: You need an optical disc drive to play this video
cy: Mae angen gyrrwr disg optegol i rhwarae'r fideo hwn

# #437
source: Removable disk
cy: Disg tynadwy

# #438
source: Opening file
cy: Agor ffeil

# #439
source: Cache
cy: Storfa

# #440
source: Hard disk
cy: Disg Caled

# #442
source: Local network
cy: Rhwydwaith leol

# #443
source: Internet
cy: Rhyngrwyd

# #444
source: Video
cy: Fideo

# #445
source: Audio
cy: Sain

# #447
source: Autorun media
cy: Cyfrwng awtoredeg

# #448
source: Dolby Digital Plus (E-AC3) capable receiver
cy: Derbynnydd Dolby Digital Plus (E-AC3) galluog

# #449
source: Enabled
cy: Galluogwyd

# #450
source: Columns
cy: Colofnau

# #451
source: Row 1 address
cy: Cyfeiriad rhes 1

# #452
source: Row 2 address
cy: Cyfeiriad rhes 2

# #453
source: Row 3 address
cy: Cyfeiriad rhes 3

# #454
source: Row 4 address
cy: Cyfeiriad rhes 4

# #455
source: Rows
cy: Rhesi

# #456
source: Mode
cy: Modd

# #457
source: Switch view
cy: Newid golwg

# #458
source: Limit sampling rate (kHz)
cy: Cyfyngu'r raddfa samplo (kHz)

# #460
source: Audio stream
cy: Ffrwd sain

# #462
source: Subtitle
cy: Isdeitl

# #463
source: Backlight
cy: Golau cefn

# #464
source: Brightness
cy: Disgleirdeb

# #465
source: Contrast
cy: Cyferbyniad

# #467
source: Type
cy: Math

# #468
source: Move the bar to change the OSD position
cy: Symud y bar i newid safle'r Dangosydd ar Sgrin

# #469
source: OSD position
cy: Safle'r Dangosydd ar Sgrin

# #470
source: Credits
cy: Diolchiadau

# #474
source: Off
cy: Diffodd

# #475
source: Music only
cy: Cerddoriaeth yn unig

# #476
source: Music & video
cy: Cerddoriaeth a fideo

# #477
source: Unable to load playlist
cy: Methu llwytho rhestr chwarae

# #478
source: OSD
cy: Dangosydd ar Sgrin

# #479
source: Skin & language
cy: Croen ac iaith

# #480
source: Appearance
cy: Gwedd

# #481
source: Audio options
cy: Dewisiadau sain

# #482
source: About Kodi
cy: Ynghylch Kodi

# #485
source: Delete album
cy: Dileu albwm

# #486
source: Repeat
cy: Ailadrodd

# #487
source: Repeat one
cy: Ailadrodd un

# #488
source: Repeat folder
cy: Ffolder ailadrodd

# #489
source: Play the next song automatically
cy: Chwarae'r gân nesaf yn awtomatig

# #491
source: - Use big icons
cy: - Eiconau mawr

# #492
source: Resize VobSubs
cy: Newid maint VobSubs

# #493
source: Advanced options (Experts Only!)
cy: Dewisiadau Uwch (Arbenigwyr yn unig!)

# #494
source: Overall audio headroom
cy: Gofod sain cyffredinol

# #495
source: Upsample videos to GUI resolution
cy: Uwchsamplo fideo i gydraniad GUI

# #496
source: Calibration
cy: Calibro

# #497
source: Show file extensions
cy: Dangos estyniadau ffeil

# #498
source: Sort by: Type
cy: Trefnu: Math

# #499
source: Unable to connect to online lookup service
cy: Methu cysylltu â gwasanaeth chwilio ar-lein

# #500
source: Downloading album information failed
cy: Methodd llwytho gwybodaeth albwm i lawr

# #501
source: Looking for album names...
cy: Chwilio am enwau albwm...

# #502
source: Open
cy: Agor

# #503
source: Busy
cy: Prysur

# #504
source: Empty
cy: Gwag

# #505
source: Loading media info from files...
cy: Llwytho gwybodaeth cyfrwng o ffeiliau...

# #507
source: Sort by: Usage
cy: Trefnu: Defnydd

# #510
source: Enable visualisations
cy: Galluogi delweddu

# #511
source: Enable video mode switching
cy: Galluogi newid modd fideo

# #512
source: Startup window
cy: Ffenestr cychwyn

# #513
source: Home window
cy: Ffenestr cartref

# #514
source: Manual settings
cy: Gosodiadau â llaw

# #515
source: Genre
cy: Math

# #517
source: Recently played albums
cy: Albymau diweddar

# #518
source: Launch
cy: Cychwyn

# #519
source: Launch in...
cy: Cychwyn yn...

# #521
source: Compilations
cy: Casgliadau

# #522
source: Remove source
cy: Tynnu'r ffynhonnell

# #523
source: Switch media
cy: Newid cyfrwng

# #524
source: Select playlist
cy: Dewis rhestr chwarae

# #525
source: New playlist...
cy: Rhestr chwarae newydd...

# #526
source: Add to playlist
cy: Ychwanegu at y rhestr chwarae

# #527
source: Manually add to library
cy: Ychwanegu â llaw i'r llyfrgell

# #528
source: Enter title
cy: Rhowch deitl

# #529
source: Error: Duplicate title
cy: Gwall: Teitl dyblyg

# #530
source: Select genre
cy: Dewis math

# #531
source: New genre
cy: Math newydd

# #532
source: Manual addition
cy: Ychwanegu â llaw

# #533
source: Enter genre
cy: Rhoi math

# #534
source: View: %s
cy: Gweld: %s

# #535
source: List
cy: Rhestr

# #536
source: Icons
cy: Eiconau

# #537
source: Big list
cy: Rhestr fawr

# #538
source: Big icons
cy: Eiconau mawr

# #539
source: Wide
cy: Llydan

# #540
source: Big wide
cy: Llydan iawn

# #541
source: Album icons
cy: Eicoanau albwm

# #542
source: DVD icons
cy: Eiconau DVD

# #544
source: Media info
cy: Gwybodaeth cyfrwng

# #545
source: Audio output device
cy: Dyfais allbwm sain

# #546
source: Passthrough output device
cy: Dyfais allbwn drwodd

# #547
source: No biography for this artist
cy: Dim bywgraffiad i'r artist

# #548
source: Downmix multichannel audio to stereo
cy: Cymysgu lawr sail sianel lluosog i stereo

# #549
source: Number
cy: Rhif

# #550
source: Sort by: %s
cy: Trefnu: %s

# #551
source: Name
cy: Enw

# #552
source: Date
cy: Dyddiad

# #553
source: Size
cy: Maint

# #554
source: Track
cy: Trac

# #555
source: Time
cy: Amser

# #556
source: Title
cy: Teitl

# #558
source: Album
cy: Albwm

# #559
source: Playlist
cy: Rhestr Chwarae

# #560
source: ID
cy: Enw

# #561
source: File
cy: Ffeil

# #562
source: Year
cy: Blwyddyn

# #563
source: Rating
cy: Graddio

# #564
source: Type
cy: Math

# #565
source: Usage
cy: Defnydd

# #566
source: Album artist
cy: Artist albwm

# #567
source: Play count
cy: Cyfrif chwarae

# #568
source: Last played
cy: Chwarae diwethaf

# #569
source: Comment
cy: Sylw

# #570
source: Date added
cy: Dyddiad ychwanegwyd

# #571
source: Default
cy: Rhagosodiad

# #572
source: Studio
cy: Stiwdio

# #573
source: Path
cy: Llwybr

# #574
source: Country
cy: Gwlad

# #575
source: In progress
cy: Cynnydd

# #576
source: Times played
cy: Troeon chwaraewyd

# #577
source: Date Taken
cy: Dyddiad Cymerwyd

# #580
source: Sort direction
cy: Cyfeiriad trefnu

# #581
source: Sort method
cy: Dull trefnu
