Repository: xbmc/xbmc
Catalog: language/Welsh/strings.po
Languages: cy

# #12021
source: Start from beginning
cy: Cychwyn o'r cychwyn

# #12022
source: Resume from %s
cy: Ailgychwyn o %s

# #12321
source: Ok
cy: Iawn

# #12325
source: Locked! Enter code...
cy: Wedi cloi! Rhowch y cod...

# #12326
source: Enter password
cy: Rhowch y cyfrinair

# #12327
source: Enter master code
cy: Rhowch y prif gyfrinair

# #12328
source: Enter unlock code
cy: Rhowch y cod datgloi

# #12329
source: or press C to cancel
cy: neu pwyso C i ddiddymu

# #12330
source: Enter gamepad button combo and
cy: Rhowch gyfuniad botwm pad chwarae a

# #12331
source: press OK, or Back to cancel
cy: pwyso Iawn, neu Nôl i ddiddymu

# #12332
source: Set lock
cy: Gosod clo

# #12333
source: Unlock
cy: Datgloi

# #12334
source: Reset lock
cy: Ailosod clo

# #12335
source: Remove lock
cy: Tynnu clo

# #12337
source: Numeric password
cy: Cyfrinair rhifol

# #12338
source: Gamepad button combo
cy: Cyfuniad botwm pad chwarae

# #12339
source: Full-text password
cy: Cyfrinair testun llawn

# #12340
source: Enter new password
cy: Rhowch gyfrinair newydd

# #12341
source: Re-Enter new password
cy: Rhowch y cyfrinair newydd eto

# #12342
source: Incorrect password,
cy: Cyfrinair anghywir,

# #12343
source: retries left
cy: sawl cais ar ôl

# #12344
source: Passwords entered did not match.
cy: Nid yw'r cyfrineiriau'n cydfynd.

# #12345
source: Access denied
cy: Mynediad wedi ei wrthod

# #12346
source: Password retry limit exceeded.
cy: Dim cais cyfrinair pellach.

# #12347
source: The system will now power down.
cy: Bydd y system nawr yn cau

# #12348
source: Item locked
cy: Eitem wedi ei gloi

# #12349
source: Updating video library art
cy: Diweddaru celf llyfrgell fideo

# #12350
source: Processing %s
cy: Prosesu %s

# #12351
source: The art cache in your video library needs updating.
cy: Mae storfa celf eich llyfrgell fideo angen ei ddiweddaru.

# #12352
source: No downloading is needed.
cy: Nid oes angen llwytho i lawr.

# #12353
source: Reactivate lock
cy: Ailalluogi'r clo

# #12354
source: Would you like to update it now?
cy: Hoffech chi ddiweddaru nawr?

# #12356
source: Change lock
cy: Newid y clo

# #12357
source: Source lock
cy: Clo ffynhonnell

# #12358
source: Password entry was blank. Try again.
cy: Roedd y cyfrinair yn wag. Ceisio eto.

# #12360
source: Master lock
cy: Prif glo

# #12362
source: Shutdown system if Master Lock retries exceeded
cy: Cau'r system os fydd ceisio agor y Prif Glo yn rhy niferus

# #12367
source: Master code is not valid
cy: Nid yw'r prif god yn ddilys

# #12368
source: Please enter a valid master code
cy: Rhowch prif god dilys

# #12373
source: Settings & file manager
cy: Rheolwr gosodiadau a ffeiliau

# #12376
source: Set as default for all videos
cy: Gosod fel y rhagosodedig ar gyfer pob fideo

# #12377
source: This will reset any previously saved values
cy: Bydd hyn yn ailosod urhyw werthoedd cadwyd yn flaenorol

# #12378
source: Amount of time to display each image
cy: Cyfnod dangos pob delwedd

# #12379
source: Use pan and zoom effects
cy: Defnyddio effeithiau chwyddo a throi

# #12383
source: 12 hour clock
cy: Cloc 12 awr

# #12384
source: 24 hour clock
cy: Cloc 24 awr

# #12385
source: Day/Month
cy: Diwrnod/Mis

# #12386
source: Month/Day
cy: Mis/Diwrnod

# #12390
source: System uptime
cy: System ar waith ers

# #12391
source: Minutes
cy: Munud

# #12392
source: Hours
cy: Awr

# #12393
source: Days
cy: Diwrnod

# #12394
source: Total uptime
cy: Cyfanswm amser ar waith

# #12395
source: Battery level
cy: Cyflwr y batri

# #12396
source: Auto updates: On
cy: Diweddariadau awtomatig: Ymlaen

# #12397
source: Auto updates: Notify
cy: Diweddariadau awtomatig: Hysbysu

# #12398
source: Auto updates: Never
cy: Diweddariadau awtomatig: Byth

# #12600
source: Weather
cy: Tywydd

# #12900
source: Screensaver
cy: Arbedwr sgrin

# #12901
source: Fullscreen OSD
cy: Dangosydd ar Sgrin Sgrin Lawn

# #13001
source: Immediate HD spindown
cy: Diffodd y disc caled yn syth

# #13002
source: Video only
cy: Fideo'n unig

# #13003
source: - Delay
cy: - Oedi

# #13004
source: - Minimum file duration
cy: - Lleiafswm amser ffeil

# #13005
source: Shutdown
cy: Cau

# #13008
source: Shutdown function
cy: Swyddogaeth cau

# #13009
source: Quit
cy: Gadael

# #13010
source: Hibernate
cy: Cysgu

# #13011
source: Suspend
cy: Oedi

# #13012
source: Exit
cy: Gadael

# #13013
source: Reboot
cy: Ailgychwyn

# #13014
source: Minimise
cy: Lleihau

# #13015
source: Power button action
cy: Gweithred botwm pŵer

# #13016
source: Power off System
cy: Diffodd y System

# #13017
source: Inhibit idle shutdown
cy: Atal cau wrth oedi

# #13018
source: Allow idle shutdown
cy: Caniatáu cau wrth oedi

# #13020
source: Is another session active, perhaps over ssh?
cy: Oes sesiwn arall yn fyw, ar draws ssh efallai?

# #13021
source: Mounted removable harddrive
cy: Disg caled tynadwy arosodedig

# #13022
source: Unsafe device removal
cy: Tynnu dyfais anniogel

# #13023
source: Successfully removed device
cy: Tynnu dyfais yn llwyddianus

# #13024
source: Joystick plugged
cy: Ffon hwyl wedi ei gysylltu

# #13025
source: Joystick unplugged
cy: Ffon hwyl wedi ei ddatgysylltu

# #13026
source: Try to wake remote servers on access
cy: Ceisio deffro'r gweinyddion pell i gael mynediad

# #13027
source: Wake on Lan (%s)
cy: Deffro gan Rhwydwaith (%s)

# #13028
source: Waiting for network to connect...
cy: Aros i'r rhwydwaith gysylltu...

# #13029
source: Failed to execute Wake on Lan!
cy: Methwyd gweithredu deffro gan y Rhwydwaith!

# #13030
source: Waiting for server to wake up...
cy: Aros i'r gweinydd ddefro...

# #13031
source: Extended wait for server to wake up...
cy: Aros estynedig i'r gweinydd ddefro...

# #13032
source: Waiting for services to launch...
cy: Aros i wasanaethau gychwyn...

# #13033
source: MAC Discovery
cy: Canfod MAC

# #13034
source: Updated for %s
cy: Diweddarwyd i %s

# #13035
source: Found for %s
cy: Canfuwyd i %s

# #13036
source: Failed for %s
cy: Methwyd i %s

# #13050
source: Running low on battery
cy: Mae'r batri'n rhedeg yn isel

# #13100
source: Flicker filter
cy: Hidl Flicker

# #13101
source: Let driver choose (requires restart)
cy: Gadael i'r gyrrwr ddewis (angen ailgychwyn)

# #13105
source: Vertical blank sync
cy: Cydweddu gwacter fertigol

# #13106
source: Disabled
cy: Analluogwyd

# #13107
source: Enabled during video playback
cy: Galluogwyd yn ystod chwarae fideo

# #13108
source: Always enabled
cy: Galluogwyd bob amser

# #13109
source: Test & apply resolution
cy: Profi a gosod cydraniad

# #13110
source: Save resolution?
cy: Cadw'r cydraniad?

# #13111
source: Would you like to keep this change?
cy: Hoffech chi gadw'r newid hwn?

# #13112
source: High quality upscaling
cy: Uwchraddio ansawdd uchel

# #13113
source: Disabled
cy: Analluogwyd

# #13114
source: Enabled for SD content
cy: Galluogwyd ar gyfer cynnwys sd

# #13115
source: Always enabled
cy: Galluogwyd bob amser

# #13116
source: Upscaling method
cy: Dull uwchraddio

# #13117
source: Bicubic
cy: Deugiwbig

# #13121
source: VDPAU HQ Upscaling level
cy: Lefel Uwchraddio VDPAU HQ

# #13122
source: VDPAU Studio level colour conversion
cy: Trosi lefel lliw VDPAU Studio

# #13123
source: Keep skin?
cy: Cadw'r croen?

# #13130
source: Blank other displays
cy: Gwagio dangosyddion eraill

# #13131
source: Disabled
cy: Anablwyd

# #13132
source: Blank displays
cy: Dangosyddion gwag

# #13140
source: Active connections detected!
cy: Canfuwyd cysylltiadau byw!

# #13141
source: If you proceed, you might not be able to control Kodi
cy: Os ewch yn eich blaen, efallai na fydd modd i chi reoli Kodi

# #13142
source: any longer. Are you sure you want to stop the Event server?
cy: ymhellach. Ydych ch'n siŵr eich bod am atal y gweinydd Event?

# #13144
source: Change Apple Remote mode?
cy: Newid modd Apple Remote?

# #13145
source: If you are currently using the Apple Remote to control
cy: Os ydych yn defnyddio Apple Remote i reoli Kodi,

# #13146
source: Kodi, changing this setting might affect your ability
cy: bydd newid y gosodiad hwn o bosib yn effeithio

# #13147
source: to continue controlling it. Do you want to proceed?
cy: ar eich gallu i barhau i'w reoli. Hoffech chi barhau?

# #13159
source: Subnet mask
cy: Masg isrwyd

# #13160
source: Gateway
cy: Porth

# #13161
source: Primary DNS
cy: DNS Cynradd

# #13162
source: Initialise failed
cy: Methu cychwyn

# #13170
source: Never
cy: Byth

# #13171
source: Immediately
cy: Nawr

# #13172
source: After %i secs
cy: Wedi %i eiliad

# #13173
source: HDD install date:
cy: Dyddiad gosod HDD:

# #13174
source: HDD power cycle count:
cy: Cyfrif cylch pŵer HDD:

# #13200
source: Profiles
cy: Proffiliau

# #13201
source: Delete profile '%s'?
cy: Diweddaru proffil '%s'?

# #13204
source: Last loaded profile:
cy: Proffil diwethaf lwythwyd:

# #13205
source: Unknown
cy: Anhysbys

# #13206
source: Overwrite
cy: Trosysgrifennu

# #13208
source: Alarm clock
cy: Cloc larwm

# #13209
source: Alarm clock interval (in minutes)
cy: Cyfnod cloc larwm (mun)

# #13210
source: Started, alarm in %im
cy: Cychwyn, larwm ymhen %im

# #13211
source: Alarm!
cy: Larwm!

# #13212
source: Cancelled with %im%is left
cy: Diffodd gyda %im%is yn weddill

# #13249
source: Search for subtitles in RARs
cy: Chwilio am isdeitlau yn RARs

# #13250
source: Browse for subtitle...
cy: Pori am isdeitl...

# #13251
source: Move item
cy: Symud eitem

# #13252
source: Move item here
cy: Symud eitem i fan hyn

# #13253
source: Cancel move
cy: Diddymu'r symud

# #13270
source: Hardware:
cy: Caledwdd:

# #13271
source: CPU Usage:
cy: Defnydd CPU:

# #13274
source: Connected, but no DNS is available.
cy: Cysylltwyd, ond dim DNS ar gael.

# #13275
source: Hard Disk
cy: Disc Caled

# #13277
source: Storage
cy: Gofod Storio

# #13278
source: Default
cy: Rhagosodedig

# #13279
source: Network
cy: Rhwydwaith

# #13280
source: Video
cy: Fideo

# #13281
source: Hardware
cy: Caledwedd

# #13283
source: Operating system:
cy: System weithredu:

# #13284
source: CPU speed:
cy: Cyflymder CPU:

# #13286
source: Video encoder:
cy: Amgodiwr fideo:

# #13287
source: Screen resolution:
cy: Cydraniad sgrin:

# #13292
source: A/V cable:
cy: Cebl A/V:

# #13294
source: DVD region:
cy: Ardal DVD:

# #13295
source: Internet:
cy: Rhyngrwyd:

# #13296
source: Connected
cy: Cysylltu

# #13297
source: Not connected. Check network settings.
cy: Heb gysylltu. Gwiriwch y gosodiadau rhwydwaith.

# #13299
source: Target temperature
cy: Tymheredd targed

# #13300
source: Fan speed
cy: Cyflymder gwyntyll

# #13301
source: Auto temperature control
cy: Rheolwr tymheredd awtomatig

# #13302
source: Fan speed override
cy: Rheolwr cyflymder gwyntyll

# #13303
source: Fonts
cy: Ffontiau

# #13304
source: Enable flipping bi-directional strings
cy: Galluogi newid llinynnau dau gyfeiriad

# #13305
source: Show RSS news feeds
cy: Dangos llif newyddion RSS

# #13306
source: Show parent folder items
cy: Dangos eitemau ffolder rhiant

# #13307
source: Track naming template
cy: Tracio templed enwu

# #13308
source: Do you wish to reboot your system
cy: Hoffech chi ailgychwyn eich system

# #13309
source: instead of just Kodi?
cy: yn lle dim ond Kodi?

# #13310
source: Zoom effect
cy: Effaith chwyddo

# #13311
source: Float effect
cy: Effaith arnofio

# #13312
source: Black bar reduction
cy: Lleihau'r bar du

# #13313
source: Restart
cy: Ailgychwyn

# #13314
source: Crossfade between songs
cy: Croes-dawelu rhwng caneuon

# #13315
source: Regenerate thumbnails
cy: Diweddaru lluniau bach

# #13316
source: Recursive thumbnails
cy: Ailadrodd lluniau bach

# #13317
source: View slideshow
cy: Gweld sioe sleidiau

# #13318
source: Recursive slideshow
cy: Ailadrodd sioe sleidiau

# #13319
source: Randomise
cy: Hapio

# #13321
source: Left only
cy: Chwith yn unig

# #13322
source: Right only
cy: De yn unig

# #13323
source: Enable karaoke support
cy: Galluogi cynnal karaoke

# #13324
source: Background transparency
cy: Tryloywder y cefndir

# #13325
source: Foreground transparency
cy: Tryloywder y blaendir

# #13326
source: A/V delay
cy: Oedi A/V

# #13328
source: %s not found
cy: Heb ganfod %s

# #13329
source: Error opening %s
cy: Gwall wrth agor %s

# #13330
source: Unable to load %s
cy: Methu llwytho %s

# #13331
source: Error: Out of memory
cy: Gwall: Dim cof

# #13332
source: Move up
cy: Symud i fyny

# #13333
source: Move down
cy: Symud i lawr

# #13334
source: Edit label
cy: Golygu labeli

# #13335
source: Make default
cy: Gosod fel rhagosodiad

# #13336
source: Remove button
cy: Tynnu botwm

# #13340
source: Leave as is
cy: Gadael fel ag y mae

# #13341
source: Green
cy: Gwyrdd

# #13342
source: Orange
cy: Oren

# #13343
source: Red
cy: Coch

# #13344
source: Cycle
cy: Cylchu

# #13345
source: Switch LED off on playback
cy: Diffodd LED wrth chwarae

# #13346
source: Movie information
cy: Gwybodaeth am y ffilm

# #13347
source: Queue item
cy: Eitem mewn ciw

# #13348
source: Search IMDb...
cy: Chwilio IMDb...

# #13349
source: Scan for new content
cy: Sganio am gynnwys newydd

# #13350
source: Current playlist
cy: Rhestr chwarae gyfredol

# #13351
source: Album information
cy: Gwybodaeth am yr albwm

# #13352
source: Scan item to library
cy: Sganio eitem i'r llyfrgell

# #13353
source: Stop scanning
cy: Atal y sganio

# #13354
source: Render method
cy: Dull rendro

# #13355
source: Low quality pixel shader
cy: Cysgodwr picsel ansawdd isel

# #13356
source: Hardware overlays
cy: Troshaenau caledwedd

# #13357
source: High quality pixel shader
cy: Cysgodwr picsel ansawdd uchel

# #13358
source: Play item
cy: Chwarae'r eitem

# #13359
source: Set artist thumb
cy: Gosod llun yr artist

# #13360
source: Automatically generate thumbnails
cy: Cynhyrchu lluniau bach yn awtomatig

# #13361
source: Enable voice
cy: Galluogi llais

# #13375
source: Enable device
cy: Galluogi dyfais

# #13376
source: Volume
cy: Lefel sain

# #13377
source: Default view mode
cy: Modd gweld rhagosoddig

# #13378
source: Default brightness
cy: Gloywder rhagosodedig

# #13379
source: Default contrast
cy: Cyferbyniad rhagosodedig

# #13380
source: Default gamma
cy: Gamma rhagosodedig

# #13381
source: Resume video
cy: Ailgychwyn y fideo

# #13382
source: Voice mask - Port 1
cy: Masg llais - Porth 1

# #13383
source: Voice mask - Port 2
cy: Masg llais - Porth 2

# #13384
source: Voice mask - Port 3
cy: Masg llais - Porth 3

# #13385
source: Voice mask - Port 4
cy: Masg llais - Porth 4

# #13386
source: Use time based seeking
cy: Defnyddio chwilio ar sail amser

# #13387
source: Track naming template - right
cy: Tracio templed enwi - de

# #13388
source: Preset
cy: Rhagosodyn

# #13389
source: There are no presets available for this visualisation
cy: Nid oes rhagosodiadau ar gael ar gyfer y delweddu hwn.

# #13390
source: There are no settings available for this visualisation
cy: Nid oes gosodiadau ar gael ar gyfer y delweddu hwn.

# #13391
source: Eject/Load
cy: Bwrw Allan/Llwytho

# #13392
source: Use visualisation if playing audio
cy: Defnyddio delweddu os yn chwarae sain

# #13393
source: Calculate size
cy: Cyfrifo maint

# #13394
source: Calculating folder size
cy: Cyfrifo maint folder

# #13395
source: Video settings
cy: Gosodiadau fideo

# #13396
source: Audio and subtitle settings
cy: Gosodiadau sain ac isdeitlau

# #13397
source: Enable subtitles
cy: Galluogi isdeitlau

# #13398
source: Shortcuts
cy: Llwybrau byr

# #13399
source: Ignore articles when sorting (e.g. "the")
cy: Anwybyddu'r fannod wrth drefnu (e.e. "y")

# #13400
source: Crossfade between songs on the same album
cy: Croesdewi rhwng caneuon ar yr un albwm

# #13401
source: Browse for %s
cy: Pori am %s

# #13402
source: Show track position
cy: Dangos safle ar drac

# #13403
source: Clear default
cy: Clirio'r rhagosodiad

# #13404
source: Resume
cy: Ailgychwyn

# #13405
source: Get thumb
cy: Estyn llun bach

# #13406
source: Picture information
cy: Gwybodaeth am y llun

# #13407
source: %s presets
cy: %s rhagosodyn

# #13408
source: (IMDb user rating)
cy: (Graddio defnyddwyr IMDb)

# #13409
source: Top 250
cy: 250 Gorau

# #13410
source: Tune in on Last.fm
cy: Gwrando ar Last.fm

# #13411
source: Minimum fan speed
cy: Cyflymder lleiaf gwyntyll

# #13412
source: Play from here
cy: Chwarae o fan hyn

# #13413
source: Downloading
cy: Llwytho i lawr

# #13414
source: Include artists who appear only on compilations
cy: Cynnwys artistiaid sydd dim ond yn ymddangos mewn casgliadau

# #13415
source: Render method
cy: Dull rendro

# #13416
source: Auto detect
cy: Awto ganfod

# #13417
source: Basic shaders (ARB)
cy: Cysgodwyr sylfaenol (ARB)

# #13418
source: Advanced shaders (GLSL)
cy: Cysgodwyr uwch (GLSL)

# #13419
source: Software
cy: Meddalwedd

# #13420
source: Remove safely
cy: Tynnu'n diogel

# #13422
source: Start slideshow here
cy: Cychwyn y sioe sleidiau o fan hyn

# #13423
source: Remember for this path
cy: Cofio ar gyfer y llwybr hwn

# #13424
source: Use pixel buffer objects
cy: Defnyddio gwrthrychau byffer picseli

# #13425
source: Allow hardware acceleration (VDPAU)
cy: Caniatáu cyflymu caledwedd (VDPAU)

# #13426
source: Allow hardware acceleration (VAAPI)
cy: Caniatáu cyflymu caledwedd (VAAPI)

# #13427
source: Allow hardware acceleration (DXVA2)
cy: Caniatáu cyflymu caledwedd (DXVA2)

# #13428
source: Allow hardware acceleration (CrystalHD)
cy: Caniatáu cyflymu caledwedd (CrystalHD)

# #13429
source: Allow hardware acceleration (VDADecoder)
cy: Caniatáu cyflymu caledwedd (VDADecoder)

# #13430
source: Allow hardware acceleration (OpenMax)
cy: Caniatáu cyflymu caledwedd (OpenMax)

# #13431
source: Pixel Shaders
cy: Cysgodwyr picseli

# #13432
source: Allow hardware acceleration (VideoToolbox)
cy: Caniatáu cyflymu caledwedd (VideoToolbox)

# #13433
source: Play the next video automatically
cy: Chwarae'r fideo nesaf yn awtomatig

# #13434
source: Play only this
cy: Chwarae dim ond hwn

# #13435
source: Enable HQ Scalers for scalings above
cy: Galluogi HQ Scalers ar gyfer y graddio uchod

# #13436
source: Allow hardware acceleration (libstagefright)
cy: Caniatáu cyflymu caledwedd (libstagefright)

# #13437
source: Prefer VDPAU Video Mixer
cy: Dewis Cymysgydd Fideo VDPAU

# #13438
source: Allow hardware acceleration (amcodec)
cy: Caniatau cyflymu caledwedd (amcodec)

# #13439
source: Allow hardware acceleration (MediaCodec)
cy: Caniatau cyflymu caledwedd (MediaCodec)

# #13440
source: Allow multi threaded software decoding
cy: Caniatau dadcodio meddalwedd trywydd lluosog

# #13441
source: Use MPEG-2 VDPAU
cy: Defnyddio MPEG-2 VDPAU

# #13442
source: Enable this option to use hardware acceleration for MPEG-(1/2) codecs. If disabled the CPU will be used instead. Older Radeon Cards tend to segfault with this enabled.
cy: Galluogwch y dewis hwn i ddefnyddio cyflymu caledwedd ar gyfer codec MPEG-(1/2). Os yw wedi ei analluogi bydd y CPU yn cael ei ddefnyddio yn lle hynny. Mae cardiau Radeon hŷn yn tueddu i gael gwall os yw hyn wedi ei alluogi.

# #13443
source: Use MPEG-4 VDPAU
cy: Defnyddio MPEG-4 VDPAU

# #13444
source: Enable this option to use hardware acceleration for the MPEG-4 codec. If disabled the CPU will be used instead. Some ION Hardware has problems with this being enabled by default.
cy: Galluogwch y dewis hwn i ddefnyddio cyflymu caledwedd ar gyfer codec MPEG-4). Os yw wedi ei analluogi bydd y CPU yn cael ei ddefnyddio yn lle hynny. Mae caledwedd ION yn tueddu i gael gwall os yw hyn wedi ei alluogi'n rhagosodedig.

# #13445
source: Use VC-1 VDPAU
cy: Defnyddio VC-1 VDPAU

# #13446
source: Enable this option to use hardware acceleration for VC-1 based codecs. If disabled the CPU will be used instead. AMD Hardware with VDPAU cannot decode VC-1 Simple.
cy: Galluogwch y dewis hwn i ddefnyddio cyflymu caledwedd ar gyfer codec MPEG-4). Os yw wedi ei analluogi bydd y CPU yn cael ei ddefnyddio yn lle hynny. Nid yw caledwedd AMD gyda VDPAU yn gallu dadgodio VC-1 Simple.

# #13447
source: Use MPEG-2 VAAPI
cy: Defnyddio MPEG-2 VAAPI

# #13448
source: Enable this option to use hardware acceleration for MPEG-(1/2) codecs. If disabled the CPU will be used instead. Some MPEG-2 Videos might have green artifacts.
cy: Galluogwch y dewis hwn i ddefnyddio cyflymu caledwedd ar gyfer codec MPEG-(1/2). Os yw wedi ei analluogi bydd y CPU yn cael ei ddefnyddio yn lle hynny. Gall rhai fideos MPEG-2 fod ag elfennau gwyrdd arnynt.

# #13449
source: Use MPEG-4 VAAPI
cy: Defnyddio MPEG-4 VAAPI

# #13450
source: Enable this option to use hardware acceleration for the MPEG-4 codec. If disabled the CPU will be used instead.
cy: Galluogwch y dewis hwn i ddefnyddio cyflymu caledwedd ar gyfer codec MPEG-4. Os yw wedi ei analluogi bydd y CPU yn cael ei ddefnyddio yn lle hynny.

# #13451
source: Use VC-1 VAAPI
cy: Defnyddio VC-1 VAAPI

# #13452
source: Enable this option to use hardware acceleration for VC-1 based codecs. If disabled the CPU will be used instead. Especially VC-1 Interlaced fails hard on Intel hardware.
cy: Galluogwch y dewis hwn i ddefnyddio cyflymu caledwedd ar gyfer codec VC-1. Os yw wedi ei analluogi bydd y CPU yn cael ei ddefnyddio yn lle hynny. Mae elfennau VC-1 yn gallu methu ar galedwedd Intel. .

# #13454
source: Decoding method
cy: Dull dadgodio

# #13455
source: Software
cy: Meddalwedd

# #13456
source: Hardware accelerated
cy: Caledwedd wedi ei gyflymu

# #13458
source: Allow hardware acceleration (OMXPlayer)
cy: Caniatáu cyflymu caledwedd (OMXPlayer)

# #13500
source: A/V sync method
cy: Dull cydweddu A/V

# #13501
source: Audio clock
cy: Cloc sain

# #13502
source: Video clock (Drop/Dupe audio)
cy: Cloc fideo (Sain Drop/Dupe)

# #13503
source: Video clock (Resample audio)
cy: Cloc fideo (Ailsamplo'r sain)

# #13504
source: Maximum speedup/slowdown amount (%)
cy: Cyflymder eithaf/swm arafu (%)

# #13505
source: Resample quality
cy: Ansawdd ailsamplo

# #13506
source: Low(fast)
cy: Isel(cyflym)

# #13507
source: Medium
cy: Canolig

# #13508
source: High
cy: Uchel

# #13509
source: Really high(slow!)
cy: Uchel iawn(araf!)

# #13510
source: Sync playback to display
cy: Cydweddu'r chwarae â'r dangosydd

# #13511
source: Choose art
cy: Dewis celf

# #13512
source: Current art
cy: Celf cyfredol

# #13513
source: Remote art
cy: Celf pell

# #13514
source: Local art
cy: Celf lleol

# #13515
source: No art
cy: Dim celf

# #13516
source: Add art
cy: Ychwanegu celf

# #13550
source: Pause during refresh rate change
cy: Oedi rhwng newid cyfradd adnewyddu

# #13551
source: Off
cy: Diffodd

# #13552
source: %.1f Second
cy: %.1f Eiliad

# #13553
source: %.1f Seconds
cy: %.1f Eiliad

# #13554
source: %d Minute
cy: %d Munud

# #13555
source: %d Minutes
cy: %d Munud

# #13600
source: Apple remote
cy: Rheolwr Pell Apple

# #13602
source: Allow start of Kodi using the remote
cy: Caniatáu cychwyn Kodi gyda'r rheolwr

# #13603
source: Sequence delay time
cy: Amser oedi dilyniant

# #13610
source: Disabled
cy: Analluogwyd

# #13611
source: Standard
cy: Safonnol

# #13612
source: Universal Remote
cy: Rheolwr Pell Cyffredinol

# #13613
source: Multi Remote (Harmony)
cy: Rheolwr Pell Lluosog (Harmony)

# #13620
source: Apple Remote Error
cy: Rheolwr Pell Apple

# #13621
source: Apple Remote support could not be enabled.
cy: Nid oedd mod galluogi cefnogaeth Apple Remote

# #14000
source: Stack
cy: Stac

# #14001
source: Unstack
cy: Dadstacio

# #14003
source: Downloading playlist file...
cy: Llwytho ffeil rhestr chwarae i lawr ...

# #14004
source: Downloading streams list...
cy: Llwytho ffeil rhestr llif i lawr ...

# #14005
source: Parsing streams list...
cy: Didoli ffeil rhestr llif...

# #14006
source: Downloading streams list failed
cy: Methodd didoli ffeil rhestr llif

# #14007
source: Downloading playlist file failed
cy: Methodd llwytho ffeil rhestr chwarae i lawr

# #14009
source: Games directory
cy: Cyfeiriadur gemau

# #14010
source: Auto switch to thumbs based on
cy: Awto-newid i luniau bach ar sail
