Repository: xbmc/xbmc
Catalog: language/Welsh/strings.po
Languages: cy

# #36256
source: Automatically fetch album and artist information via scrapers during scan.
cy: Estyn yn awtomatig gwybodaeth am yr albwm a'r artist drwy grafwyr wrth sganio.

# #36257
source: Select the default album information source.
cy: Dewis ffynhonnell arferol gwybodaeth albwm.

# #36258
source: Select the default artist information source. See the Add-ons Manager for options.
cy: Dewis ffynhonnell arferol gwybodaeth am artist. Gw Rheolwr Ychwanegion am ddewisiadau.

# #36259
source: Check for new and removed media files on Kodi startup.
cy: Edrych am ffeiliau cyfrwng newydd a rhai wedi eu tynnu wrth gychwyn Kodi.

# #36260
source: No info available yet.
cy: Dim gwybodaeth ar gael ar hyn o bryd.

# #36262
source: Export the Music Library database to XML files. This will optionally overwrite your current XML files.
cy: Allforio cronfa ddata'r Llyfrgell Cerddoriaeth i ffeiliau XML. Bydd hyn o ddewis yn trosysgrifennu eich ffeiliau XML cyfredol.

# #36263
source: Import a XML file into the Music Library database.
cy: Mewnforio ffeil XML i gronfa ddata'r Llyfrgell Cerddoriaeth.

# #36265
source: Kodi automatically plays the next item in the current folder. For example, in Files View: After a track has been played, Kodi would automatically play the next track in the same folder.
cy: Bydd Kodi yn chwarae'r eitem nesaf yn awtomatig yn y ffolder cyfredol. Er enghraifft, yn y Golwg Ffeiliau: Wedi i drac gael i chwarae, bydd Kodi yn chwarae'r trac nesaf yn yr un ffolder yn awtomatig.

# #36268
source: Default is 89dB per standard. Change with caution.
cy: Yr arferol yw 89dB yn ôl y safon. Newidiwch gyda gofal.

# #36269
source: Default is 89dB per standard. Change with caution.
cy: Yr arferol yw 89dB yn ôl y safon. Newidiwch gyda gofal.

# #36270
source: Reduce the volume of the file if clipping will occur.
cy: Gostwng sain os yn clipio.

# #36271
source: Smoothly fade from one audio track to the next. You can set the amount of overlap from 1-15 seconds.
cy: Tawelu'n llyfn o un trac sain i'r llall. Mae modd gosod maint y trosglwyddo o 1-15 eiliad.

# #36274
source: Read the tag information from song files. For large directories this can slow down read time, especially over a network.
cy: Darllen gwybodaeth tag o ffeiliau caneuon. Mewn cyfeiriaduron mawr mae modd i hyn arafu'r broses ddarllen, yn arbennig dros rwydwaith.

# #36281
source: Kodi will search for thumbs on remote shares and optical media. This can often slow down the listing of network folders.
cy: Bydd Kodi yn chwilio am luniau bach ar raniadau pell a chyfrwng optegol. Mae hyn yn gallu arafu rhestru ffolderi rhwydwaith.

# #36283
source: Autorun CDs when inserted in drive.
cy: Rhedeg CDau yn awtomatig ar ôl eu gosod yn y gyrrwr.

# #36284
source: Read the information belonging to an audio CD from an internet database.
cy: Darllen gwybodaeth am CD sain o gronfa ddata ar y rhyngrwyd.

# #36285
source: Select the location on your hard drive where ripped tracks will be saved to.
cy: Dewis lleoliad ar eich disg caled lle bydd traciau wedi eu rhwygo’n cael u cadw.

# #36287
source: Select which audio encoder to use when ripping.
cy: Dewis pa amgodiwr sain i'w ddefnyddio wrth rwygo.

# #36288
source: Select which quality you want to rip your files.
cy: Dewis i ba ansawdd i rwygo'r ffeiliau

# #36289
source: Select which bitrate to use for the specified audio encoder for audio compression.
cy: Dewis pa ddidradd i'w ddefnyddio ar gyfer amgodiwr sain benodol ar gyfer cywasgiad sain.

# #36291
source: Auto eject disc after rip is complete.
cy: Bwrw allan y ddisg yn awtomatig wedi cwblhau’r rhwygo.

# #36293
source: When playing any music file, Kodi will look for a matching .cdg file and display its graphics.
cy: Pan yn chwarae ffeil cerddoriaeth bydd Kodi yn chwilio am ffeil .cdg sy'n cyfateb ac yn dangos ei graffigau.

# #36295
source: Select the font type used during karaoke.
cy: Gosod y math o ffont i'w ddefnyddio yn ystod karaoke.

# #36296
source: Select the size of the font used during karaoke.
cy: Gosod maint y ffont i'w ddefnyddio yn ystod karaoke.

# #36297
source: Select the font colour used during karaoke.
cy: Gosod lliw'r ffont i'w ddefnyddio yn ystod karaoke.

# #36298
source: Select the character set used during karaoke.
cy: Gosod set nod y ffont i'w ddefnyddio yn ystod karaoke.

# #36301
source: No info available yet.
cy: Dim gwybodaeth ar gael ar hyn o bryd.

# #36302
source: No info available yet.
cy: Dim gwybodaeth ar gael ar hyn o bryd.

# #36303
source: No info available yet.
cy: Dim gwybodaeth ar gael ar hyn o bryd.

# #36306
source: If EXIF information exists (date, time, camera used, etc.), it will be displayed.
cy: Os oes gwybodaeth EXIF y bodoli (dyddiad, amser, camera, ac ati) bydd yn cael ei ddangos.

# #36307
source: Automatically generate picture thumbnails when entering picture folder.
cy: Cynhyrchu lluniau bach yn awtomatig wrth fynd i ffolder lluniau.

# #36308
source: Pictures will automatically rotate according to information in the EXIF tag, if found.
cy: Bydd lluniau'n tro'n awtomatig yn ôl y wybodaeth yn y tag EXIF, os yw ar gael.

# #36309
source: Show videos in picture file lists.
cy: Dangos fideos yn rhestrau ffeil lluniau.

# #36310
source: No info available yet.
cy: Dim gwybodaeth ar gael ar hyn o bryd.

# #36312
source: Select the amount of time that each image is displayed in a slideshow.
cy: Dewis am faint o amser y bydd pob llun yn cael ei ddangos mewn sioe sleidiau.

# #36313
source: Images in a slideshow will pan and zoom while displayed.
cy: Bydd delweddau mewn sioe sleidiau yn symud a chwyddo wrth gael ei dangos.

# #36314
source: View slideshow images in a random order.
cy: Gweld delweddau sioe sleidiau yn nhrefn hap.

# #36317
source: Select up to three locations for which the weather can be displayed.
cy: Dewis un o dri lleoliad i ddangos y tywydd.

# #36318
source: Specify the default weather information source. See the Add-ons Manager for options.
cy: Pennu ffynhonnell arferol y tywydd. Gw Rheolwr Ychwanegion am ddewisiadau.

# #36321
source: Display name of the Kodi installation when using various network services.
cy: Dangos enw'r gosodiad Kodi wrth ddefnyddio gwasanaethau rhwydwaith amrywiol.

# #36324
source: When a manual or automatical library update occurs, notify UPnP clients.
cy: Pan fydd diweddariad llyfrgell yn digwydd yn awtomatig neu â llaw, dweud wrth y cleientiaid UPnP.

# #36328
source: Enable remote users to control Kodi through the built-in webserver.
cy: Galluogi defnyddwyr pell i reoli Kodi drwy'r gweinydd gwe mewnol.

# #36329
source: Define the webserver port.
cy: Diffinio porth y gweinydd gw

# #36332
source: Select between web interfaces installed via the Add-on Manager.
cy: Dewis rhwng rhyngwynebau gwe sydd wedi eu gosod drwy'r Rheolwr Ychwanegion.

# #36334
source: Allow programs on this computer to control Kodi via the Web Interface or the JSON-RPC interface protocol.
cy: Caniatáu i raglenni ar y cyfrifiadur hwn i reoli Kodi drwy'r rhyngwyneb gwe neu drwy brotocol rhyngwyneb JSON-RPC.

# #36338
source: Allow programs on the network to control Kodi.
cy: Caniatáu i raglenni ar y rhwydwaith i reoli Kodi.

# #36355
source: In a multi-screen configuration, the screens where Kodi is not displayed are blacked out.
cy: Mewn ffurfweddiad sgrin lluosog bydd y sgriniau lle nad yw Kodi.

# #36356
source: Eliminate vertical tearing.
cy: Dileu rhwygo fertigol

# #36358
source: Test patterns for display hardware calibration.
cy: Profi patrymau ar gyfer calibro caledwedd arddangos

# #36363
source: Boost AC3 streams that have been downmixed to 2 channels.
cy: Cynyddu llif AC3 sydd wedi eu cymysgu i lawr i 2 sianel.

# #36365
source: Select this option if your receiver is capable of decoding AC3 streams.
cy: Dewis hwn os yw eich derbynnydd yn gallu datgodio llif AC3.

# #36366
source: Select this option if your receiver is capable of decoding DTS streams.
cy: Dewis hwn os yw eich derbynnydd yn gallu datgodio llif DTS.

# #36369
source: Select this option if your receiver is capable of decoding TrueHD streams.
cy: Dewis hwn os yw eich derbynnydd yn gallu datgodio llif TrueHD.

# #36370
source: Select this option if your receiver is capable of decoding DTS-HD streams.
cy: Dewis hwn os yw eich derbynnydd yn gallu datgodio llif DTS-HD.

# #36373
source: Configure how interface sounds are handled, such as menu navigation and important notifications.
cy: Ffurfweddu sut mae synau'r rhyngwyneb yn cael eu trin, megis symud rhwng dewislenni a hysbysiadau pwysig.

# #36376
source: When activated, your keyboard arrows will move the selection on the virtual keyboard. When deactivated, they will move the cursor from your text.
cy: Ar ôl ei weithredu, bydd saethau eich bysellfwrdd yn symud eich dewis ar y rhith fysellfwrdd. Pan nad yw wedi ei weithredu, byddant yn symud eich cyrchwr o'ch testun.

# #36377
source: Use a mouse or touch screen device to control Kodi. Note: disabling will cause you to lose control over Kodi when no keyboard or remote is present.
cy: Defnyddiwch lygoden neu ddyfais sgrin cyffwrdd i reoli Kodi. Nodyn: bydd analluogi un achosi i chi golli rheolaeth ar Kodi pan nad oes bysellfwrdd neu reolwr pell ar gael.

# #36378
source: Use a joystick to control Kodi.
cy: Defnyddio ffon hud i reoli Kodi.

# #36380
source: If your internet connection uses a proxy, configure it here.
cy: Os yw eich cysylltiad rhyngrwyd yn defnyddio dirprwy, mae modd ei ffurfweddu yma.

# #36381
source: Configure which proxy type is used.
cy: Ffurfweddu pa fath o ddirprwy sy'n cael ei ddefnyddio.

# #36382
source: Configure the proxy server address.
cy: Ffurfweddu cyfeiriad y gweinydd dirprwyo.

# #36383
source: Configure the proxy server port.
cy: Ffurfweddu porth y gweinydd dirprwyo

# #36384
source: Configure the proxy server username.
cy: Ffurfweddu enw defnyddiwr y gweinydd dirprwyo

# #36385
source: Configure the proxy server password.
cy: Ffurfweddu cyfrinair y gweinydd dirprwyo

# #36386
source: If you have limited bandwidth available, Kodi will try to keep within these limits.
cy: Os oes gennych ddarpariaeth band llydan cyfyng, bydd Kodi yn ceisio cadw o fewn y cyfyngiadau hyn.

# #36389
source: Define how long Kodi should idle before shutting down.
cy: Diffinio pa mor hir ddylai Kodi oedi cyn cau.

# #36390
source: Define what action Kodi should do when it has been idle for a long period of time.
cy: Diffinio pa weithredoedd ddylai Kodi eu cyflawni pan mae wedi oedi am amser maith.

# #36393
source: Folder used to save screenshots taken within Kodi.
cy: Y ffolder i'w ddefnyddio i gadw lluniau sgrin wedi eu cymryd o fewn Kodi.

# #36396
source: Define the PIN code used for the master lock.
cy: Diffinio cod PIN y prif glo.

# #36398
source: Define the maximum number of retries before Kodi is closed down.
cy: Diffinio'r nifer mwyaf o geisiadau cyn y bydd Kodi yn cau.

# #36410
source: No info available yet.
cy: Dim gwybodaeth ar gael ar hyn o bryd.

# #36411
source: No info available yet.
cy: Dim gwybodaeth ar gael ar hyn o bryd.

# #36412
source: No info available yet.
cy: Dim gwybodaeth ar gael ar hyn o bryd.

# #36413
source: No info available yet.
cy: Dim gwybodaeth ar gael ar hyn o bryd.

# #36414
source: No info available yet.
cy: Dim gwybodaeth ar gael ar hyn o bryd.

# #36415
source: No info available yet.
cy: Dim gwybodaeth ar gael ar hyn o bryd.

# #36419
source: Define locations used for retrieving weather information.
cy: Diffinio lleoliad o le ddaw'r wybodaeth am y tywydd.

# #36426
source: Switch to channel
cy: Newid i sianel

# #36428
source: Record
cy: Recordio

# #36502
source: Disabled
cy: Analluogwyd

# #36503
source: Over/Under
cy: Trosodd/Tanodd

# #36507
source: Interlaced
cy: Rhyngweol

# #36900
source: movie
cy: ffilm

# #36901
source: movies
cy: ffilm

# #36902
source: TV show
cy: Rhaglen deledu

# #36903
source: TV shows
cy: Rhaglenni teledu

# #36904
source: season
cy: tymor

# #36905
source: seasons
cy: tymor

# #36906
source: episode
cy: rhifyn

# #36907
source: episodes
cy: rhifyn

# #36908
source: musicvideo
cy: fideo cerddoriaeth

# #36909
source: musicvideos
cy: fideo cerddoriaeth

# #36911
source: sets
cy: set

# #36912
source: video
cy: fideo

# #36913
source: videos
cy: fideo

# #36914
source: music
cy: cerddoriaeth

# #36915
source: music
cy: cerddoriaeth

# #36917
source: artists
cy: artist

# #36918
source: album
cy: albwm

# #36919
source: albums
cy: albwm

# #36920
source: song
cy: cân

# #36921
source: songs
cy: cân

# #37000
source: (Visually Impaired)
cy: (Diffyg ar y golwg)

# #37001
source: (Directors Comments)
cy: (Sylwadau'r Cyfarwyddwyr)

# #37002
source: (Directors Comments 2)
cy: (Sylwadau'r Cyfarwyddwyr 2)

# #37012
source: (Forced)
cy: (Gorfodwyd)

# #37013
source: (Directors Comments)
cy: (Sylwadau'r Cyfarwyddwyr)

# #37014
source: Last used profile
cy: Proffil defnyddiwyd y tro diwethaf

# #37015
source: Browse Into
cy: Pori i

# #37017
source: Dual audio output
cy: Allbwn sain ddeuol

# #37026
source: Auto
cy: Awto

# #37030
source: Unlimited
cy: Di derfyn
