Repository: xbmc/xbmc
Catalog: language/Welsh/strings.po
Languages: cy

# #20254
source: WebDAV server (HTTPS)
cy: Gweinydd WebDAV (HTTP)

# #20255
source: First logon, edit your profile
cy: Mewngofnodwch yn gyntaf ac yna golygu eich proffil

# #20256
source: HTS Tvheadend client
cy: Cleient HTS Tvheadend

# #20257
source: VDR Streamdev client
cy: Cleient VDR Streamdev

# #20258
source: MythTV client
cy: Cleient MythTV

# #20259
source: Network Filesystem (NFS)
cy: System ffeiliau rhwydwaith (NFS)

# #20260
source: Secure Shell (SSH/SFTP)
cy: Cragen Diogel(SSH/SFTP)

# #20261
source: Apple Filing Protocol (AFP)
cy: Protocol Ffeilio Apple (AFP)

# #20300
source: Web server directory (HTTP)
cy: Cyfeiriadur gweinydd gwe (HTTP)

# #20301
source: Web server directory (HTTPS)
cy: Cyfeiriadur gweinydd gwe (HTTPS)

# #20302
source: Unable to write to folder:
cy: Methu ysgrifennu i ffolder:

# #20303
source: Do you want to skip and proceed?
cy: Hoffech chi hepgor hwn a pharhau?

# #20304
source: RSS Feed
cy: Llif RSS

# #20307
source: Secondary DNS
cy: DNS eilradd

# #20308
source: DHCP server:
cy: Gweinydd DHCP:

# #20309
source: Make new folder
cy: Creu ffolder newydd

# #20311
source: Unknown or onboard (protected)
cy: Anhysbys neu yn gynnwysiedig (diogelwyd)

# #20314
source: Videos - Library
cy: Fideo - Llyfrgell

# #20316
source: Sort by: ID
cy: Trefnu: yn ôl enw

# #20317
source: Scanning movies using %s
cy: Sganio ffilmiau gyda %s

# #20318
source: Scanning music videos using %s
cy: Sganio fideos cerddoriaeth gyda %s

# #20319
source: Scanning tvshows using %s
cy: Sganio rhaglenni teledu gyda %s

# #20320
source: Scanning artists using %s
cy: Sganio artistiaid gyda %s

# #20321
source: Scanning albums using %s
cy: Sganio albymau gyda %s

# #20323
source: Movie plot
cy: Plot y ffilm

# #20324
source: Play part...
cy: Chwarae rhan...

# #20325
source: Calibration reset
cy: Ailosod calibro

# #20326
source: This will reset the calibration values for %s
cy: Bydd hyn yn ailodsod gwerthoedd calibro %s

# #20327
source: to its default values.
cy: i'w werthoedd rhagosodedig

# #20328
source: Browse for destination
cy: Pori am gyrchfan

# #20329
source: Movies are in separate folders that match the movie title
cy: Mae ffilmiau mewn ffolder ar wahân sy'n debyg i deitl ffilmiau

# #20330
source: Use folder names for lookups
cy: Defnyddio enwau ffolder wrth chwilio

# #20331
source: File
cy: Ffeil

# #20332
source: Use file or folder names in lookups?
cy: Defnyddio enw ffeil neu ffolder wrth chwilio?

# #20333
source: Set content
cy: Gosod cynnwys

# #20334
source: Folder
cy: Ffolder

# #20335
source: Look for content recursively?
cy: Chwilio am ddeunydd yn ailadroddus?

# #20336
source: Unlock sources
cy: Datgloi'r ffynonellau

# #20338
source: Movie
cy: Ffilm

# #20339
source: Director
cy: Cyfarwyddwr

# #20340
source: Do you want to remove all items within
cy: Hoffech chi dynnu'r holl eitemau o fewn

# #20341
source: this path from the Kodi library?
cy: y llwybr hwn o lyfrgell Kodi?

# #20342
source: Movies
cy: Ffilmiau

# #20343
source: TV shows
cy: Rhaglenni teledu

# #20344
source: This directory contains
cy: Mae'r cyfarwyddiadur yn cynnwys

# #20345
source: Run automated scan
cy: Rhedeg sgam awtomatig

# #20346
source: Scan recursively
cy: Sgan ailadroddus

# #20347
source: as
cy: fel

# #20348
source: Directors
cy: Cyfarwyddwyr

# #20349
source: No video files found in this path!
cy: Heb ganfod ffeiliau fideo yn y lwybr hwn!

# #20350
source: votes
cy: pleidleisiau

# #20351
source: TV show information
cy: Gwybodaeth rhaglenni teledu

# #20352
source: Episode information
cy: Gwybodaeth am y rhifyn

# #20353
source: Loading TV show details
cy: Llwytho manylion rhaglenni teledu

# #20354
source: Fetching episode guide
cy: Estyn canllaw rhagleni

# #20355
source: Loading info for episodes in directory
cy: Llwytho gwybodaeth am rifynnau o fewn y cyfeiriadur

# #20356
source: Select TV show:
cy: Dewis rhaglen deledu:

# #20357
source: Enter the TV show name
cy: Rhowch enw'r rhaglen deledu

# #20358
source: Season %i
cy: Tymor %i

# #20359
source: Episode
cy: Rhifyn

# #20360
source: Episodes
cy: Rhifynnau

# #20361
source: Loading episode details
cy: Llwytho manylion rhifyn

# #20362
source: Remove episode from library
cy: Tynnu rhifyn o'r llyfrgell

# #20363
source: Remove TV show from library
cy: Tynnu rhaglen deledu o'r llyfrgell

# #20364
source: TV show
cy: Rhaglen deledu

# #20365
source: Episode plot
cy: Stori'r rhifyn

# #20366
source: * All seasons
cy: * Pob tymor

# #20367
source: Hide watched
cy: Cuddio'r gwylwyd

# #20368
source: Prod code
cy: Cod cynnych

# #20369
source: Show plot for unwatched items
cy: Dangos stori ffilmiau heb eu gwylio

# #20370
source: * Hidden to prevent spoilers *
cy: * Wedi eu cuddio rhag sbwylwyr *

# #20371
source: Set season thumb
cy: Gosod llun bach tymor

# #20372
source: Season image
cy: Delwedd y tymor

# #20373
source: Season
cy: Tymor

# #20374
source: Downloading movie information
cy: Llwytho i lawr gwybodaeth ffilm

# #20375
source: Unassign content
cy: Dadbenodi cynnwys

# #20376
source: Original title
cy: Teitl gwreiddiol

# #20377
source: Refresh TV show information
cy: Adnewyddu gwybodaeth rhaglenni teledu

# #20378
source: Refresh info for all episodes?
cy: Adnewyddu gwybodaeth ar gyfer pob rhifyn?

# #20379
source: Selected folder contains a single TV show
cy: Mae'r ffolder hon yn cynnwys un rhaglen deledu

# #20380
source: Exclude selected folder from scans
cy: Tynnu'r ffolder hon o sganiau

# #20381
source: Specials
cy: Arbennig

# #20383
source: Selected folder contains a single video
cy: Mae'r ffolder hon yn cynnwys un fideo

# #20384
source: Link to TV show
cy: Cysylltiad i raglen deledu

# #20385
source: Remove link to TV show
cy: Tynnu'r cysylltiad i raglen deledu

# #20386
source: Recently added movies
cy: Ffilmiau ychwanegwyd yn ddiweddar

# #20387
source: Recently added episodes
cy: Rhifynau ychwanegwyd yn ddiweddar

# #20389
source: Music videos
cy: Fideos cerddoriaeth

# #20390
source: Recently added music videos
cy: Fideos cerddoriaeth ychwanegwyd yn ddiweddar

# #20391
source: Music video
cy: Fideos cerddoriaeth

# #20392
source: Remove music video from library
cy: Tynnu fideos cerddoriaeth o'r llyfrgell

# #20393
source: Music video information
cy: Gwybodaeth fideo cerddoriaeth

# #20394
source: Loading music video information
cy: Llwytho gwybodaeth fideo cerddoriaeth

# #20395
source: Mixed
cy: Cymysgwyd

# #20396
source: Go to albums by artist
cy: Mynd i albymau gan artistiaid

# #20397
source: Go to album
cy: Mynd i albwm

# #20398
source: Play song
cy: Chwarae cân

# #20399
source: Go to music videos from album
cy: Mynd i fideos cerddoriaeth o albymau

# #20400
source: Go to music videos by artist
cy: Mynd i fideos cerddoriaeth gan artistiaid

# #20401
source: Play music video
cy: Chwarae fideos cerddoriaeth

# #20402
source: Download actor thumbnails when adding to library
cy: Llwytho i lawr lluniau bach wrth ychwanegu at y llyfrgell

# #20403
source: Set actor thumb
cy: Gosod llun bach actor

# #20404
source: Remove bookmark
cy: Tynnu nod tudalen

# #20405
source: Remove episode bookmark
cy: Tynnu nod tudalen rhifyn

# #20406
source: Set episode bookmark
cy: Gosod nod tudalen rhifyn

# #20407
source: Scraper settings
cy: Gosodiadau crafwr

# #20408
source: Downloading music video information
cy: Llwytho gwybodaeth fideo cerddoriaeth i lawr

# #20409
source: Downloading TV show information
cy: Llwytho gwybodaeth rhaglenni teledu i lawr

# #20410
source: Trailer
cy: Hysbysiad

# #20411
source: Flatten
cy: Gwastatáu

# #20412
source: Flatten TV show seasons
cy: Gwastatáu tymor rhaglenni teledu

# #20413
source: Get fanart
cy: Estyn celf selogion

# #20414
source: Show fanart in video and music libraries
cy: Dangos Celf Selogion mewn llyfrgelloedd fideo a cherddoriaeth

# #20415
source: Scanning for new content
cy: Sganio am gynnwys newydd

# #20416
source: First aired
cy: Darlledwyd gyntaf

# #20417
source: Writer
cy: Awdur

# #20418
source: Writers
cy: Awduron

# #20419
source: Replace file names with library titles
cy: Amnewid enw ffeiliau gyd theitlau llyfrgell

# #20420
source: Never
cy: Byth

# #20421
source: If only one season
cy: Os dim ond un tymor

# #20422
source: Always
cy: Bob tro

# #20423
source: Has trailer
cy: Hysbysiad ar gael

# #20424
source: False
cy: Gau

# #20425
source: Fanart slideshow
cy: Sioe sleidiau celf selogion

# #20426
source: Export to a single file or separate
cy: Allforio i ffeil unigol neu ar wahân

# #20427
source: files per entry?
cy: ffeil y cofnod?

# #20428
source: Single file
cy: Ffeil unigol

# #20429
source: Separate
cy: Ar wahân

# #20430
source: Export thumbnails and fanart?
cy: Allforio lluniau bach a chelf selogion?

# #20431
source: Overwrite old files?
cy: Trosysgrifennu hen ffeiliau?

# #20432
source: Exclude path from library updates
cy: Tynnu llwybr o ddiweddariadau llyfrgell

# #20433
source: Extract thumbnails and video information
cy: Echynnu gwybodaeth llun bach a fideo

# #20434
source: Sets
cy: Setiau

# #20435
source: Combine split video items
cy: Cyfuno eitemau fideo hollt

# #20436
source: Export actor thumbs?
cy: Allforio lluniau bach actor?

# #20437
source: Choose fanart
cy: Dewis celf selogion

# #20438
source: Local fanart
cy: Celf Selogion Lleol

# #20439
source: No fanart
cy: Dim Celf Selogion

# #20440
source: Current fanart
cy: Celf Selogion Cyfredol

# #20441
source: Remote fanart
cy: Celf Selogion Pell

# #20442
source: Change content
cy: Newid cynnwys

# #20443
source: Do you want to refresh info for all
cy: Hoffech chi adnewyddu gwybodaeth popeth

# #20444
source: items within this path?
cy: eitemau o fewn y llwybr hwn?

# #20445
source: Fanart
cy: Celf Selogion

# #20446
source: Locally stored information found.
cy: Wedi canfod gwybodaeth y lleol.

# #20447
source: Ignore and refresh from internet?
cy: Anwybyddu ac adnewyddu o'r rhyngrwyd?

# #20448
source: Could not download information
cy: Methwyd llwytho gwybodaeth i lawr

# #20449
source: Unable to connect to remote server
cy: Methu cysylltu â'r gweinydd pell

# #20450
source: Would you like to continue scanning?
cy: Hoffech chi barhau i sganio?

# #20451
source: Countries
cy: Gwledydd

# #20452
source: episode
cy: rhifyn

# #20453
source: episodes
cy: rhifyn

# #20454
source: Listener
cy: Gwrandawr

# #20455
source: Listeners
cy: Gwrandawr

# #20456
source: Flatten library hierarchy
cy: Gostwng hierarchaeth llyfrgell

# #20457
source: Movie set
cy: Set ffilmiau

# #20458
source: Group movies in sets
cy: Grwpio ffilmiau mewn setiau

# #20459
source: Tags
cy: Tagiau

# #20460
source: Add %s
cy: Ychwanegu %s

# #20461
source: Remove %s
cy: Tynnu %s

# #20462
source: New tag...
cy: Tag newydd...

# #20463
source: A tag with the name '%s' already exists.
cy: Mae tag o'r enw '%s' yn bod eisoes.

# #20464
source: Select %s
cy: Dewis %s

# #20465
source: Manage movie set
cy: Rheoli st ffilm

# #20466
source: Select movie set
cy: Dewis set film

# #20467
source: No set (Remove from %s)
cy: Dim set (Tynnu o %s)

# #20468
source: Add movie to a new set
cy: Ychwanegu ffilm i set newydd

# #20469
source: Keep current set (%s)
cy: Cadw'r set gyfredol (%s)

# #21330
source: Show hidden files and directories
cy: Dangos ffeiliau a chyfarwyddiadau cudd

# #21331
source: TuxBox client
cy: Cleientiaid TuxBox

# #21332
source: WARNING: Target TuxBox device is in recording-mode!
cy: RHYBUDD: Mae'r ddyfais TuxBox targed yn y modd recordio!

# #21333
source: The stream will be stopped!
cy: Bydd y ffrwd yn cael ei hatal!

# #21334
source: Zap to channel: %s failed!
cy: Methodd sapio i sianel %s!

# #21335
source: Are you sure to start the stream?
cy: Ydych chi'n siŵr eich bod cychwyn ffrydio?

# #21336
source: Connecting to: %s
cy: Cysylltu â: %s

# #21337
source: TuxBox device
cy: Dyfais TuxBox

# #21359
source: Add media share...
cy: Ychwanegu rhannu cyfrwng...

# #21360
source: Share video and music libraries through UPnP
cy: Rhannu llyfrgelloedd fideo a cherddoriaeth drwy UPnP

# #21361
source: Look for remote UPnP players
cy: Chwilio am chwaraewyr UPnP pell

# #21362
source: Bookmark created
cy: Nod tudalen wedi ei greu

# #21363
source: Episode Bookmark created
cy: Nod tudalen rhifyn wedi ei greu

# #21364
source: Edit media share
cy: Golygu rhannu cyfrwng

# #21365
source: Remove media share
cy: Tynnu rhaniad cyfrwng

# #21366
source: Custom subtitle folder
cy: Ffolder isdeitlai cyfaddas

# #21367
source: Movie & alternate subtitle directory
cy: Cyfeiriadur ffilmiau ac isdeitlau eraill

# #21368
source: Override ASS/SSA subtitles fonts
cy: Anwybyddu ffontiau isdeitlau ASS/SSA

# #21369
source: Enable mouse and touch screen support
cy: Galluogi cynnal llygoden a sgrin cyffwrdd

# #21370
source: Play navigation sounds during media playback
cy: Chwarae synau symud wrth chwarae cyfrwng

# #21371
source: Thumbnail
cy: Llun bach

# #21372
source: Forced DVD player region
cy: Gorfodi ardal chwarae DVD

# #21373
source: Video output
cy: Allbwn fideo

# #21374
source: Video aspect
cy: Cymhareb fideo

# #21376
source: Letterbox
cy: Blwch llythyron

# #21377
source: Widescreen
cy: Sgrin lydan

# #21378
source: Enable 480p
cy: Galluogi 480p

# #21379
source: Enable 720p
cy: Galluogi 720p

# #21380
source: Enable 1080i
cy: Galluogi 1080i

# #21381
source: Enter name of new playlist
cy: Rhowch enw rhestr chwarae newydd

# #21382
source: Show "Add source" buttons in file lists
cy: Dangos botymau "Ychwanegu ffynhonnell" i restr ffeiliau

# #21383
source: Enable scrollbars
cy: Galluogi bariau sgrolio

# #21384
source: Make watched filtering a toggle in video library
cy: Troi hidlo'r gwyliwyd yn newidyn yn y llyfrgell fideo

# #21385
source: Open
cy: Agor

# #21386
source: Acoustic management level
cy: Lefel rheoli acwstig

# #21387
source: Fast
cy: Cyflym

# #21388
source: Quiet
cy: Tawel

# #21389
source: Enable custom background
cy: Galluogi cefndir cyfaddas

# #21390
source: Power management level
cy: Lefel rheoli pŵer

# #21391
source: High power
cy: Pŵer uwch

# #21392
source: Low power
cy: Pŵer is

# #21393
source: High standby
cy: Oedi uchel

# #21394
source: Low standby
cy: Oedi isel

# #21395
source: Unable to cache files bigger than 4GB
cy: Methu storio ffeiliau mwy na 4GB

# #21396
source: Chapter
cy: Pennod

# #21397
source: High quality pixel shader v2
cy: Cysgodwr picseli ansawdd uchel f2

# #21398
source: Enable playlist at startup
cy: Galluogi rhestr chwarae wrth gychwyn

# #21399
source: Use tween animations
cy: Defnyddio animeiddiad tween

# #21400
source: contains
cy: yn cynnwys

# #21401
source: does not contain
cy: nad yw'n cynnwys

# #21402
source: is
cy: yn

# #21403
source: is not
cy: nad yw

# #21404
source: starts with
cy: cychwyn gyda

# #21405
source: ends with
cy: gorffen gyda

# #21406
source: greater than
cy: mwy na

# #21407
source: less than
cy: llai na

# #21408
source: after
cy: wedi

# #21409
source: before
cy: cyn

# #21410
source: in the last
cy: yn yr olaf

# #21411
source: not in the last
cy: nad yw yn yr olaf

# #21412
source: Scrapers
cy: Crafwyr

# #21413
source: Default movie scraper
cy: Crafwr ffilmiau rhagosodedig

# #21414
source: Default tvshow scraper
cy: Crafwr rhaglenni teledu rhagosodedig

# #21415
source: Default music video scraper
cy: Crafwr fideo cerddoriaeth rhagosodedig

# #21417
source: Settings
cy: Gosodiadau

# #21418
source: Multilingual
cy: Amlieithog

# #21419
source: No scrapers present
cy: Dim crafwyr ar gael

# #21420
source: Value to match
cy: Gwerth i'w gydweddu

# #21421
source: Smart playlist rule
cy: Rheol rhestr chwarae clyfar

# #21422
source: Match items where
cy: Cydweddu eitemau lle

# #21423
source: New rule...
cy: Rheol newydd...

# #21424
source: Items must match
cy: Rhaid i eitemau gydweddu

# #21425
source: all of the rules
cy: pob un o'r rheolau

# #21426
source: one or more of the rules
cy: un neu fwy o'r rheolau

# #21427
source: Limit to
cy: Cyfyngu i

# #21428
source: No limit
cy: Dim cyfyngiad

# #21429
source: Order by
cy: Trefnu yn ôl

# #21430
source: ascending
cy: esgyn

# #21431
source: descending
cy: disgyn

# #21432
source: Edit smart playlist
cy: Golygu rhestr chwarae clyfar

# #21433
source: Name of the playlist
cy: Enw'r rhestr chwarae

# #21434
source: Find items where
cy: Canfod eitemau lle

# #21435
source: Edit
cy: Golygu

# #21436
source: %i items
cy: %i eitem

# #21437
source: New smart playlist...
cy: Rhestr chwarae clyfar newydd...

# #21438
source: %c Drive
cy: Gyrrwr %c

# #21439
source: Edit party mode rules
cy: Golygu rheolau modd parti

# #21440
source: Home folder
cy: Ffolder cartref

# #21441
source: Watched count
cy: Cyfrif gwyliwyd

# #21442
source: Episode title
cy: Teitl rhifyn

# #21443
source: Video resolution
cy: Cydraniad fideo

# #21444
source: Audio channels
cy: Sianeli sain

# #21445
source: Video codec
cy: Codec fideo

# #21446
source: Audio codec
cy: Codec sain

# #21447
source: Audio language
cy: Iaith sain

# #21448
source: Subtitle language
cy: Iaith isdeitlau

# #21449
source: Remote control sends keyboard presses
cy: Rheolwr pell yn efelychu pwyso bysellfwrdd

# #21450
source: Edit
cy: Golygu

# #21451
source: Internet connection required.
cy: Mae angen cysylltiad â'r rhyngrwyd.

# #21452
source: Get More...
cy: Estyn Rhagor...

# #21453
source: Root filesystem
cy: System ffeiliau gwraidd

# #21454
source: Cache full
cy: Storfa lawn

# #21455
source: Cache filled before reaching required amount for continous playback
cy: Mae'r storfa wedi ei llanw cyn cyrraedd yr hyn sy'n angenrheidiol ar gyfer chwarae

# #21456
source: External storage
cy: Gofod Storio Allanol

# #21457
source: Watched episode count
cy: Cyfrif rhifyn gwyliwyd

# #21458
source: Group by
cy: Grwpio yn ôl

# #21459
source: mixed
cy: cymysgwyd

# #21460
source: Subtitle position on screen
cy: Lleoliad isdeitlau ar y sgrin

# #21461
source: Fixed
cy: Sefydlog

# #21462
source: Bottom of video
cy: Gwaelod fideo

# #21463
source: Below video
cy: Islaw'r fideo

# #21464
source: Top of video
cy: Brig y fideo

# #21465
source: Above video
cy: Uwchlaw'r fideo

# #21467
source: %.1f to %.1f
cy: %.1f i %.1f

# #21468
source: %d to %d
cy: %d i %d

# #21469
source: %s to %s
cy: %s i %s

# #21602
source: (External)
cy: (Allanol)

# #21800
source: File name
cy: Enw ffeil

# #21801
source: File path
cy: Llwybr ffeil

# #21802
source: File size
cy: Maint ffeil

# #21803
source: File date/time
cy: Dyddiad/amser ffeil

# #21804
source: Slide index
cy: Mynegai sleid

# #21805
source: Resolution
cy: Cydraniad

# #21806
source: Comment
cy: Sylw

# #21807
source: Colour/B&W
cy: Lliw/DuaGwyn

# #21808
source: JPEG process
cy: Proses JPEG

# #21820
source: Date/Time
cy: Dyddiad/Amser

# #21821
source: Description
cy: Disgrifiad

# #21822
source: Camera make
cy: Math o gamera

# #21823
source: Camera model
cy: Model camera

# #21824
source: EXIF comment
cy: Sylw EXIF

# #21825
source: Firmware
cy: Caledwedd

# #21826
source: Aperture
cy: Agorfa

# #21827
source: Focal length
cy: Hyd ffocal

# #21828
source: Focus distance
cy: Pellter ffocws

# #21829
source: Exposure
cy: Dinoethiad

# #21830
source: Exposure time
cy: Amser dinoethiad

# #21831
source: Exposure bias
cy: Tueddiad dinoethiad

# #21832
source: Exposure mode
cy: Modd dinoethiad

# #21833
source: Flash used
cy: Defnyddiwyd fflach

# #21834
source: White-balance
cy: Cymantoledd gwyn

# #21835
source: Light source
cy: Ffynhonnell golau

# #21836
source: Metering mode
cy: Modd mesurydd

# #21838
source: Digital zoom
cy: Chwyddo digidol

# #21839
source: CCD width
cy: Lled CCD

# #21840
source: GPS latitude
cy: Lledred GPS

# #21841
source: GPS longitude
cy: Hydred GPS

# #21842
source: GPS altitude
cy: Uchder GPS

# #21843
source: Orientation
cy: Cyfeiriadaeth

# #21857
source: Sub-location
cy: Is leoliad

# #21858
source: Image type
cy: Math delwedd

# #21859
source: Time created
cy: Amser crewyd

# #21860
source: Supplemental categories
cy: Categorïau ychwanegol

# #21861
source: Keywords
cy: Allweddeiriau

# #21862
source: Caption
cy: Pennawd

# #21863
source: Author
cy: Awdur

# #21864
source: Headline
cy: Prif Bennawd

# #21865
source: Special instructions
cy: Cyfarwyddiadau arbennig

# #21866
source: Category
cy: Categori

# #21867
source: Byline
cy: Islinell

# #21868
source: Byline title
cy: Teitl islinell

# #21869
source: Credit
cy: Diolch

# #21870
source: Source
cy: Ffynhonnell

# #21871
source: Copyright notice
cy: Hysbysiad hawlfraint

# #21872
source: Object name
cy: Enw gwrthrych

# #21873
source: City
cy: Dinas

# #21874
source: State
cy: Talaith

# #21875
source: Country
cy: Gwlad

# #21876
source: Original Tx Reference
cy: Cyfeiriant Tx Gwreiddiol

# #21877
source: Date created
cy: Dyddiad crëwyd

# #21878
source: Urgency
cy: Brys

# #21879
source: Country code
cy: Cod gwlad

# #21880
source: Reference service
cy: Gwasanaeth cyfeiriadu

# #21881
source: Allow control of Kodi via UPnP
cy: Caniatáu rheoli Kodi drwy UPnP

# #21882
source: Attempt to skip introduction before DVD menu
cy: Ceisio hepgor cyflwyniad cyn dewislen DVD

# #21883
source: Saved music
cy: Cerddoriaeth wedi eu cadw

# #21884
source: Query info for all artists
cy: Ymholi gwybodaeth pob artist

# #21885
source: Downloading album information
cy: Llwytho i lawr gwybodaeth am albymau

# #21886
source: Downloading artist information
cy: Llwytho i lawr gwybodaeth am artistiaid

# #21887
source: Biography
cy: Bywgraffiad

# #21888
source: Discography
cy: Disgyddiaeth

# #21889
source: Searching artist
cy: Chwilio am artist

# #21890
source: Select artist
cy: Dewis artist

# #21891
source: Artist information
cy: Gwybodaeth am artist

# #21892
source: Instruments
cy: Offerynau

# #21893
source: Born
cy: Ganed

# #21894
source: Formed
cy: Ffurfiwyd

# #21895
source: Themes
cy: Themâu

# #21896
source: Disbanded
cy: Gwahanwyd

# #21897
source: Died
cy: Marw

# #21898
source: Years active
cy: Blynyddoedd gweithredol

# #21900
source: Born/Formed
cy: Ganed/Ffurfiwyd

# #22000
source: Update library on startup
cy: Diweddaru'r llyfrgell wrth gychwyn

# #22001
source: Hide progress of library updates
cy: Cuddio cynnydd diweddaru'r llyfrgell

# #22002
source: DNS suffix
cy: Rhagosodiad DNS

# #22004
source: Delayed by: %2.3fs
cy: Oedwyd: %2.3fs

# #22005
source: Ahead by: %2.3fs
cy: O flaen: %2.3fs

# #22006
source: Subtitle offset
cy: Atred isdeitlau

# #22007
source: OpenGL vendor:
cy: Gwerthwr OpenGL:

# #22008
source: OpenGL renderer:
cy: Rendrwr OpenGL:

# #22009
source: OpenGL version:
cy: Fersiwn OpenGL:

# #22010
source: GPU temperature:
cy: Tymheredd GPU:

# #22011
source: CPU temperature:
cy: Tymheredd CPU:

# #22012
source: Total memory
cy: Cyfanswm y cof

# #22013
source: Profile data
cy: Data proffil

# #22014
source: Use dim if paused during video playback
cy: Pylu wrth oedi pan yn chwarae fideo

# #22015
source: All recordings
cy: Pob recordiad

# #22016
source: By title
cy: Yn ôl teitl

# #22017
source: By group
cy: Fesul grŵp

# #22018
source: Live channels
cy: Sianeli

# #22019
source: Recordings by title
cy: Recordiadau yn ôl teitl

# #22020
source: Guide
cy: Canllaw

# #22021
source: Allowed error in aspect ratio to minimise black bars
cy: Caniatáu gwall yn y gymhareb agwedd i leihau'r barau duon

# #22022
source: Show video files in listings
cy: Dangos ffeiliau fideo yn y rhestrau

# #22023
source: DirectX vendor:
cy: Gwerthwr DirectX:

# #22024
source: Direct3D version:
cy: Fersiwn Direct3D:

# #22030
source: Font
cy: Ffont

# #22031
source: Size
cy: Maint

# #22032
source: Colours
cy: Lliwiau

# #22033
source: Charset
cy: Set Nod

# #22034
source: Export karaoke titles as HTML
cy: Allforio teitlau Kareoke fel HTML

# #22035
source: Export karaoke titles as CSV
cy: Allforio teitlau Kareoke fel CSV

# #22036
source: Import karaoke titles...
cy: Mewnforio teitlau kareoke...
