Repository: xbmc/xbmc
Catalog: addons/metadata.tvshows.themoviedb.org.python/resources/language/resource.language.*/strings.po
Languages: sk_sk

# Addon Summary
source: Fetch TV Show metadata from themoviedb.org
sk_sk: Získať metadáta pre seriály z themoviedb.org

# #30000
source: Preferred language
sk_sk: Uprednostňovaný jazyk

# #30001
source: Preferred certification country
sk_sk: Uprednostňovaná krajina certifikácie

# #30002
source: Include certification prefix
sk_sk: Zahrnúť prefix hodnotenia prístupnosti

# #30004
source: Keep original title
sk_sk: Ponechať pôvodný názov

# #30007
source: Add keywords as tags
sk_sk: Pridať kľúčové slová ako štítky

# #30101
source: Client key (optional)
sk_sk: Klientský kľúč (nepovinné)

# #30102
source: Enable fanart
sk_sk: Povoliť Fanart

# #30103
source: Enable poster
sk_sk: Povoliť plagát

# #30104
source: Enable banner
sk_sk: Povoliť banner

# #30105
source: Enable clearlogo
sk_sk: Povoliť clearlogo

# #30106
source: Enable clearart
sk_sk: Povoliť cleanart

# #30150
source: Enable season poster
sk_sk: Povoliť plagáty série

# #30151
source: Enable season banner
sk_sk: Povoliť banner série

# #30200
source: Advanced
sk_sk: Rozšírené

# #30300
source: Ratings
sk_sk: Hodnotenie

# #30301
source: Default rating from
sk_sk: Predvolené hodnotenie z

# #30302
source: Also add IMDb ratings
sk_sk: Pridať tiež hodnotenie z IMDb

# #30303
source: Also add Trakt.tv ratings
sk_sk: Pridať tiež hodnotenie z Trakt.tv

# #30304
source: Also add TMDb ratings
sk_sk: Pridať tiež hodnotenie z TMDb

# #30305
source: Enable Trailer
sk_sk: Povoliť Upútavku

# #30306
source: Addon Player
sk_sk: Doplnok Prehrávača
