Repository: xbmc/xbmc
Catalog: addons/weather.wunderground/resources/language/*/strings.po
Languages: russian

# #32101
source: Location setup
russian: Настройка местоположения

# #32102
source: Advanced options
russian: Раширенные опции

# #32111
source: Location 1
russian: Местоположение 1

# #32112
source: Location 2
russian: Местоположение 2

# #32113
source: Location 3
russian: Местоположение 3

# #32114
source: Location 1 display name
russian: Название местоположения 1

# #32115
source: Location 2 display name
russian: Название местоположения 2

# #32116
source: Location 3 display name
russian: Название местоположения 3

# #32117
source: Location 1 id
russian: ID местоположения 1

# #32118
source: Location 2 id
russian: ID местоположения 2

# #32119
source: Location 3 id
russian: ID местоположения 3

# #32120
source: Enable logging
russian: Включить журнал

# #32121
source: Weekend
russian: Выходные

# #32122
source: Saturday/Sunday
russian: Суббота/воскресенье

# #32123
source: Friday/Saturday
russian: Пятница/суббота

# #32124
source: Thursday/Friday
russian: Четверг/пятница

# #32125
source: Map zoom level
russian: Увеличение карты

# #32126
source: Animated map
russian: Анимированая карта

# #32501
source: New Moon
russian: Новолуние

# #32502
source: Waxing Crescent
russian: Молодая луна

# #32503
source: First Quarter
russian: Первая четверть

# #32504
source: Waxing Gibbous
russian: Растущая луна

# #32505
source: Full Moon
russian: Полнолуние

# #32506
source: Waning Gibbous
russian: Убывающая луна

# #32507
source: Last Quarter
russian: Последняя четверть

# #32508
source: Waning Crescent
russian: Стареющая луна

# #32510
source: Warning
russian: Предупреждение

# #32511
source: Watch
russian: Наблюдение

# #32512
source: Advisory
russian: Предположение

# #32513
source: Statement
russian: Заявление

# #32514
source: Outlook
russian: Наблюдение

# #32515
source: Forecast
russian: Прогноз

# #32516
source: Synopsis
russian: Резюме
