Repository: xbmc/xbmc
Catalog: addons/weather.wunderground/resources/language/Croatian/strings.po
Languages: hr

# #32101
source: Location setup
hr: Namjesti lokaciju

# #32102
source: Advanced options
hr: Dodatne opcije

# #32111
source: Location 1
hr: Lokacija 1

# #32112
source: Location 2
hr: Lokacija 2

# #32113
source: Location 3
hr: Lokacija 3

# #32114
source: Location 1 display name
hr: Lokacija 1 ime ekrana

# #32115
source: Location 2 display name
hr: Lokacija 2 ime ekrana

# #32116
source: Location 3 display name
hr: Lokacija 3 ime ekrana

# #32117
source: Location 1 id
hr: Lokacija 1 id

# #32118
source: Location 2 id
hr: Lokacija 2 id

# #32119
source: Location 3 id
hr: Lokacija 3 id

# #32120
source: Enable logging
hr: Omogućiti prijave

# #32121
source: Weekend
hr: Vikend

# #32122
source: Saturday/Sunday
hr: Subota/Nedjelja

# #32123
source: Friday/Saturday
hr: Petak/Subota

# #32124
source: Thursday/Friday
hr: Četvrtak/Petak

# #32125
source: Map zoom level
hr: Razina zumiranja karte

# #32126
source: Animated map
hr: Animirane mape

# #32501
source: New Moon
hr: Mladi Mjesec

# #32502
source: Waxing Crescent
hr: Prva četvrt

# #32503
source: First Quarter
hr: Prva četvrtina

# #32504
source: Waxing Gibbous
hr: Prva četvrt

# #32505
source: Full Moon
hr: Puni Mjesec

# #32506
source: Waning Gibbous
hr: Zadnja četvrt

# #32507
source: Last Quarter
hr: Posljednja četvrtina

# #32508
source: Waning Crescent
hr: Mlađak

# #32510
source: Warning
hr: Obavjesti

# #32511
source: Watch
hr: Bdjeti

# #32512
source: Advisory
hr: Savjetnik

# #32513
source: Statement
hr: Izvještaj

# #32514
source: Outlook
hr: Izgledi

# #32515
source: Forecast
hr: Prognoza

# #32516
source: Synopsis
hr: Kratki sadržaj
