Repository: xbmc/xbmc
Catalog: addons/weather.wunderground/resources/language/Lithuanian/strings.po
Languages: lt

# #32101
source: Location setup
lt: Vietovės nustatymas

# #32102
source: Advanced options
lt: Išplėstinės parinktys

# #32111
source: Location 1
lt: Vietovė 1

# #32112
source: Location 2
lt: Vietovė 2

# #32113
source: Location 3
lt: Vietovė 3

# #32114
source: Location 1 display name
lt: 1 vietovės rodomas pavadinimas

# #32115
source: Location 2 display name
lt: 2 vietovės rodomas pavadinimas

# #32116
source: Location 3 display name
lt: 3 vietovės rodomas pavadinimas

# #32117
source: Location 1 id
lt: 1 vietovės ID

# #32118
source: Location 2 id
lt: 2 vietovės ID

# #32119
source: Location 3 id
lt: 3 vietovės ID

# #32120
source: Enable logging
lt: Įjungti registravimą

# #32121
source: Weekend
lt: Savaitgalio

# #32122
source: Saturday/Sunday
lt: Šeštadienis/Sekmadienis

# #32123
source: Friday/Saturday
lt: Penktadienis/Šeštadienis

# #32124
source: Thursday/Friday
lt: Ketvirtadienis/Penktadienis

# #32125
source: Map zoom level
lt: Žemėlapio mastelis

# #32126
source: Animated map
lt: Animuotas žemėlapis

# #32501
source: New Moon
lt: Jaunatis

# #32502
source: Waxing Crescent
lt: Priešpilnis

# #32503
source: First Quarter
lt: Pilnatis

# #32504
source: Waxing Gibbous
lt: Delčia

# #32505
source: Full Moon
lt: Pilnatis

# #32506
source: Waning Gibbous
lt: Priešpilnis

# #32507
source: Last Quarter
lt: Ketvirtinis

# #32508
source: Waning Crescent
lt: Priešpilnis

# #32510
source: Warning
lt: Įspėjimas

# #32511
source: Watch
lt: Žiūrėti

# #32512
source: Advisory
lt: Konsultacinis

# #32513
source: Statement
lt: Formuluotė

# #32514
source: Outlook
lt: Numatoma

# #32515
source: Forecast
lt: Prognozė

# #32516
source: Synopsis
lt: Trumpa apžvalga
