Repository: xbmc/xbmc
Catalog: addons/visualization.vortex/resources/language/resource.language.*/strings.po
Languages: fr_ca, pt_br, zh_cn

# #30000
source: Random Presets
fr_ca: Préréglages aléatoires
pt_br: Pré-definidos Randômicos
zh_cn: 随机预置

# #30001
source: Time Between Presets
fr_ca: Intervalle entre les préréglages
pt_br: Tempo entre predefinições
zh_cn: 预置切换时间

# #30002
source: Additional Random Time
fr_ca: Temps aléatoire additionnel
pt_br: Tempo Randômico Adicional
zh_cn: 附加随机时间

# #30003
source: Lock Preset
fr_ca: Verrouiller le préréglage
pt_br: Travar Pré-definição
zh_cn: 锁定预置

# #30004
source: Enable Transitions
fr_ca: Transitions activées
pt_br: Ativar Transições
zh_cn: 允许过渡

# #30005
source: Stop first preset
fr_ca: Arrêt au premier préréglage
pt_br: Interromper primeira pré-definição
zh_cn: 停止首个预置

# #30006
source: Show FPS
fr_ca: Afficher la fréquences d'images
pt_br: Mostrar FPS
zh_cn: 显示祯率

# #30007
source: Show debug console
fr_ca: Afficher la console de débogage
pt_br: Apresentar console de depuração
zh_cn: 显示调试控制台

# #30008
source: Show audio analysis
fr_ca: Afficher l'analyse audio
pt_br: Apresentar análise de áudio
zh_cn: 显示音频分析

# #30050
source: %2.0f secs
fr_ca: %2.0f s
pt_br: %2.0f segs
zh_cn: %2.0f 秒

# #30051
source: %2.0f fps
fr_ca: %2.0f mages-par-seconde
