Repository: xbmc/xbmc
Catalog: addons/visualization.projectm/resources/language/Tamil (India)/strings.po
Languages: ta_in

# #30000
source: Render Quality
ta_in: பதிப்புவரைதல் தரம்

# #30001
source: Low
ta_in: குறைவு

# #30002
source: Medium
ta_in: மிதம்

# #30003
source: High
ta_in: அதிகம்

# #30004
source: Maximum
ta_in: உச்ச அளவு

# #30005
source: Shuffle Mode
ta_in: குலை முறை

# #30006
source: Smooth Preset Duration
ta_in: மிருது முன்னமைவு காலம்

# #30007
source: Preset Duration
ta_in: முன்னமைவு காலம்

# #30008
source: Beat Sensitivity
ta_in: Beat உணர்திறன்

# #30009
source: Preset Pack
ta_in: முன்னமைவு தொகுப்பு

# #30010
source: Default Pack
ta_in: இயல்புநிலை தொகுப்பு

# #30011
source: User Defined Preset Folder
ta_in: பயனர் வரையறுக்கப்பட்ட முன்னமைவு கோப்புறை

# #30012
source: User Preset Folder
ta_in: பயனர் முன்னமைவு கோப்புறை

# #30050
source: %2.0f secs
ta_in: %2.0f நொடிகள்
