Repository: xbmc/xbmc
Catalog: addons/visualization.milkdrop/resources/language/resource.language.*/strings.po
Languages: bg_bg, ca_es, cs_cz, cy_gb, de_de, fr_ca, fr_fr, gl_es, hr_hr, hu_hu, id_id, ko_kr, lv_lv, nb_no, pl_pl, ro_ro, ru_ru, sk_sk, sv_se, tg_tj, vi_vn, zh_cn, zh_tw

# #30000
source: Automatic Blend Time
bg_bg: Време за автоматично сливане
ca_es: Temps de mescla automàtica
cs_cz: Automatický čas sloučení
cy_gb: Amser Cymysgu Awtomatig
de_de: Automatische Überblendezeit
fr_ca: Durée de mélange automatique
fr_fr: Durée des combinaisons
gl_es: Tempo de mistura automática
hr_hr: Automatsko vrijeme miješanja
hu_hu: Automatikus keverési idő
id_id: Waktu Aduk otomatis
ko_kr: 자동 블렌드 시간
lv_lv: Automātisks maisījuma laiks
nb_no: Automatisk tid for sammensmelting
pl_pl: Interwał automatycznego mieszania
ro_ro: Durată de contopire automată
ru_ru: Время автоматического перехода
sk_sk: Automatický čas prelínania
sv_se: Automatisk bländningstid
tg_tj: Вақти омезиши худкор
vi_vn: Tự động điều chỉnh Blend Time
zh_cn: 自动混合时间
zh_tw: 自動混音時間

# #30001
source: Time Between Presets
bg_bg: Време между отделните шаблони
ca_es: Temps entre predefinits
cs_cz: Čas mezi předvolbami
cy_gb: Amse Rhwg Rhagosodiadau
de_de: Zeit zwischen den Presets
fr_ca: Intervalle entre les préréglages
fr_fr: Intervalle des présélections
gl_es: Tempo entre preconfiguracións
hr_hr: Vrijeme između predloška
hu_hu: Idő a beállításkészletek között
id_id: Waktu Antara Presets
ko_kr: 프리셋사이 간격
lv_lv: Laiks starp sagatavēm
nb_no: Tid mellom forvalg
pl_pl: Interwał zdefiniowanych ustawień
ro_ro: Durată între vizualizări predefinite
ru_ru: Время между настройками
sk_sk: Čas medzi Predvoľbami
sv_se: Tid mellan förval
tg_tj: Вақт байни интихобҳо
vi_vn: Thời gian đổi Preset
zh_cn: 预置切换时间
zh_tw: 預置切換時間

# #30002
source: Additional Random Time
bg_bg: Допълнително произволно време
ca_es: Temps Aleatori Addicional
cs_cz: Dodatečný náhodný čas
cy_gb: Amser Hap Ychwanegol
de_de: Zusätzliche zufällige Zeit
fr_ca: Ajout aléatoire de temps
fr_fr: Ajout aléatoire de temps
gl_es: Tempo ó chou adicional
hr_hr: Dodatno naizmjenično vrijeme
hu_hu: Többlet véletlen idő
id_id: Tambahan Waktu Acak
ko_kr: 추가적 랜덤 간격
lv_lv: Papildus nejaušs laiks
nb_no: Ytterligere tilfeldig tid
pl_pl: Dodatkowy czas losowy
ro_ro: Timp aleatoriu adițional
ru_ru: Дополнительное случайное время
sk_sk: Pridaný náhodná čas
sv_se: Extra slumpmässig tid
tg_tj: Вақти тасодуфии иловагӣ
vi_vn: Thời gian random thêm vào
zh_cn: 附加随机时间
zh_tw: 附屬隨機時間

# #30003
source: Enable Anisotropic Filtering
bg_bg: Включи анизотропното филтриране
ca_es: Habilita el filtre anisotròpic
cs_cz: Povolit artroskopické filtrování
cy_gb: Galluogi Hidlo Anisotropig
de_de: Anisotropischen Filter aktivieren
fr_ca: Activer le filtrage anisotropique
fr_fr: Activer le filtre anisotropique
gl_es: Activar filtro anisotrópico
hr_hr: Omogućite Anizotropno filtriranje
hu_hu: Anisotropic szűrés bekapcsolása
id_id: Aktifkan Anisotropic Filtering
ko_kr: 비등방성 필터링 사용
lv_lv: Ieslēgt anizotropo filtrēšanu
nb_no: Aktiver anisotropisk filtrering
pl_pl: Aktywuj filtrowanie anizotropowe
ro_ro: Activează filtrare anisotropică
ru_ru: Включить анизотропную фильтрацию
sk_sk: Povoliť anizotropné filtrovanie
sv_se: Aktivera anisotropicfilter
tg_tj: Фаъол кардани филтри антизотропӣ
vi_vn: Sử dụng Anisotropic Filtering
zh_cn: 启用各向异性过滤
zh_tw: 啟用各向異性過濾器

# #30004
source: Enable Hard Cuts
bg_bg: Включи Hard Cuts
ca_es: Habilita talls en sec
cs_cz: Povolit ostrá utnutí
cy_gb: Galluogi Toriadau Caled
de_de: Harte Schnitte aktivieren
fr_ca: Activer les coupures brusques
fr_fr: Activer les coupures brusques
gl_es: Activar cortes abruptos
hr_hr: Omogući velike rezove
hu_hu: Éles váltások engedélyezése
id_id: Aktifkan Hard Cuts
ko_kr: 하드컷 사용
lv_lv: Ieslēgt ciešo griezšanu
nb_no: Aktiver umiddelbare overganger
pl_pl: Aktywuj "ostre cięcia"
ro_ro: Activează schimbări rapide
ru_ru: Включить жёсткие переходы
sk_sk: Povoliť tvrdé useknutia
sv_se: Aktivera hårda brytningar
tg_tj: Фаъол кардани буришҳои ноҳамвор
vi_vn: Sử dụng các đoạn Hard Cut
zh_cn: 启用硬切
zh_tw: 啟用 Hard Cuts

# #30005
source: Loudness Threshold For Hard Cuts
bg_bg: Прагове на усилване за Hard Cuts
ca_es: Llindar de volum pels talls en sec
cs_cz: Hrana hlasitosti pro ostré utnutí
cy_gb: Trothwy Sain ar gyfer Toriadau Caled
de_de: Lautstärken-Grenzwert für Hard Cuts
fr_ca: Seuil de volume pour les coupures brusques
fr_fr: Seuil de volume pour les changements brusques
gl_es: Umbral de volume alto para cortes abruptos
hr_hr: Prag glasnoće za velike rezove
hu_hu: Hangerőküszöb az éles váltásokhoz
id_id: Ambang kekerasan untuk Hard Cuts
ko_kr: 하드컷을 위한 음량 임계치
lv_lv: Skaļuma slieksnis ciešai griezšanai
nb_no: Lydgrense for umiddelbare overganger
pl_pl: Próg głośności dla "ostrych cięć"
ro_ro: Prag de intensitate pentru schimbări rapide
ru_ru: Минимальная громкость для жёсткого перехода
sk_sk: Úroveň hlasitosti pre tvrdé useknutia
sv_se: Loudnessgräns för hårda beskärningar
tg_tj: Ҳудуди баландии садо барои буришҳои ноҳамвор
vi_vn: Giới hạn âm lượng cho các đoạn Hard Cut
zh_cn: 硬切响度门限
zh_tw: Hard Cuts 響度限位

# #30006
source: Average Time Between Hard Cuts
bg_bg: Средно време между Hard Cuts
ca_es: Temps mig entre talls en sec
cs_cz: Průměrný čas mezi ostrými utnutími
cy_gb: Amser Cyfartalog Rhwng Toriadau Caled
de_de: Durchschnittszeit zwischen Hard Cuts
fr_ca: Temps moyen entre les coupures brusques
fr_fr: Temps moyen entre les coupures
gl_es: Tempo medio entre cortes abruptos
hr_hr: Prosječno vrijeme između veliki rezova
hu_hu: Átlagos idő az éles váltások között
id_id: Waktu rata-rata antara Hard Cuts
ko_kr: 하드컷 사이의 평균 시간
lv_lv: Vidējais laiks starp ciešajiem griezieniem
nb_no: Gjennomsnittlig tid mellom umiddelbare overganger
pl_pl: Średni czas pomiędzy "ostrymi cięciami"
ro_ro: Durată medie între schimbări rapide
ru_ru: Среднее время между жёсткими переходами
sk_sk: Priemerný čas medzi tvrdými useknutiami
sv_se: Medeltid mellan hårda brytningar
tg_tj: Вақти миёна байни буришҳои ноҳамвор
vi_vn: Thời gian trung bình giữa các đoạn Hard Cut
zh_cn: 硬切平均间隔
zh_tw: Hard Cuts平均間隔時間

# #30007
source: Maximum Refresh Rate
bg_bg: Максимум за честотата на обновяване
ca_es: Temps de refresc màxim
cs_cz: Maximální obnovovací frekvence
cy_gb: Cyfradd Adnewyddu Uchaf
de_de: Maximale Wiederholrate
fr_ca: Fréquence de rafraîchissement maximale
fr_fr: Taux de rafraichissement maximum
gl_es: Máximo ratio de refresco
hr_hr: Maksimalna brzina osvježavanja
hu_hu: Maximális frissítési frekvencia
id_id: Refresh Rate maksimum
ko_kr: 최대 리프레쉬 레이트
lv_lv: Maksimālais pārzīmēšanās biežums
nb_no: Høyeste oppdateringsfrekvens
pl_pl: Maksymalna częstotliwość odświeżania
ro_ro: Rată maximă de reîmprospătare
ru_ru: Максимальная частота обновления
sk_sk: Maximálna obnovovacia frekvencia
sv_se: Maximal uppdateringsfrekvens
tg_tj: Суръати зиёдтарини навсозӣ
vi_vn: Giá trị độ làm tươi Max
zh_cn: 最大刷新率
zh_tw: 最高更新率

# #30008
source: Enable Stereo 3D
bg_bg: Включи 3D стерео режим
ca_es: Habilita l'estèreo 3D
cs_cz: Povolit Stereo 3D
cy_gb: Galluogi Stereo 3D
de_de: Stereo 3D aktivieren
fr_ca: Activer la stéréo 3D
fr_fr: Activer la Stereo 3D
gl_es: Activar 3D Stereo
hr_hr: Omogući Stereo 3D
hu_hu: Sztereó 3D engedélyezése
id_id: Aktifkan Stereo 3D
ko_kr: 스테레오 3D 사용
lv_lv: Ieslēgt Stereo 3D
nb_no: Aktiver Sterio 3D
pl_pl: Aktywuj stereofoniczny tryb 3D
ro_ro: Activează 3D stereo
ru_ru: Включить стерео 3D
sk_sk: Povoliť Stereo 3D
sv_se: Aktivera stereo-3D
tg_tj: Фаъол кардани стереои 3D
vi_vn: Sử dụng Stereo 3D
zh_cn: 启用3D立体声
zh_tw: 啟用Stereo 3D

# #30009
source: Preset Pack
bg_bg: Пакет шаблони
ca_es: Paquet de predefinits
cs_cz: Balíček předvoleb
cy_gb: Pac Rhagosodiad
fr_ca: Jeu de préréglages
fr_fr: Pack de présélections
gl_es: Pack de preconfiguracións
hr_hr: Paket predložaka
hu_hu: Beállításkészlet-csomag
id_id: Paket Preset
ko_kr: 프리셋 팩
lv_lv: Sagatavju paka
nb_no: Forhåndsinnstillingspakke
pl_pl: Pakiet zdefiniowanych ustawień
ro_ro: Pachet vizualizări predefinite
ru_ru: Набор настроек
sk_sk: Balík Predvilieb
sv_se: Förvalspaket
tg_tj: Бастаи интихобшуда
vi_vn: Các gói Preset
zh_cn: 预置包
zh_tw: 預置封包

# #30010
source: User Preset Folder
bg_bg: Папка със шаблони
ca_es: Directori de predefinits de l'usuari
cs_cz: Složka uživatelských předvoleb
cy_gb: Defnyddio Ffolder Rhagosodiaid
de_de: Benutzer Vorlagen Ordner
fr_ca: Dossier de préréglages de l'utilisateur
fr_fr: Dossier de présélection de l'utilisateur
gl_es: Cartafol de preconfiguracións do usuario
hr_hr: Mapa korisnikovih predložaka
hu_hu: Saját-készlet mappa
id_id: Folder Preset Pengguna
ko_kr: 사용자 프리셋 폴더
lv_lv: Lietotāja sagatavju mape
nb_no: Mappe for egendefinertee forhåndsinnstillinger
pl_pl: Folder ustawień użytkownika
ro_ro: Dosar preferințe utilizator
ru_ru: Папка настроек пользователя
sk_sk: Užívateľský adresár Predvolieb
sv_se: Användarförvalsmapp
tg_tj: Ҷузвдони интихобшудаи корбарӣ
vi_vn: Thư mục Preset
zh_cn: 用户预置文件夹
zh_tw: 使用者預置資料夾

# #30011
source: Preset Shuffle Mode
bg_bg: Режим за смяна на шаблоните
ca_es: Mode aleatori de predefinits
cs_cz: Režim náhodné předvolby
cy_gb: Modd Rjhagosodiaid Hap
de_de: Zufallsvorlagen
fr_ca: Mode de préréglages aléatoire
fr_fr: Mode de présélections aléatoires
gl_es: Modo aleatorio de preconfiguracións
hr_hr: Način naizmjeničnih predložaka
hu_hu: Keverési mód
id_id: Preset Modus Acak
ko_kr: 무작위 프리셋 모드
lv_lv: Sagatavju jaukšanas režīms
nb_no: Blandingsmodus for forhåndsinnstillinger
pl_pl: Tryb losowych ustawień
ro_ro: Mod Amestec Preferinte
ru_ru: Режим перемешивания настроек
sk_sk: Náhodný výber Predvolieb
sv_se: Förvalsslumpningsläge
tg_tj: Ҳолати тасодуфии интихобшуда
vi_vn: Chế độ tự nhảy Preset
zh_cn: 预置随机模式
zh_tw: 預置隨機撥放模式

# #30020
source: WA51 Presets
bg_bg: WA51 Шаблони
ca_es: Predefinits WA51
cs_cz: Předvolby WA51
cy_gb: Rhagosodiaid WA51
de_de: WA51 Vorlagen
fr_ca: Préréglages WA51
fr_fr: Présélections WA51
gl_es: Preconfiguracións de WA51
hr_hr: WA51 predlošci
hu_hu: WA51 beállításkészlet
id_id: Preset WA51
ko_kr: WA51 프리셋
lv_lv: WA51 sagataves
nb_no: WA51 forhåndsinnstillinger
pl_pl: Ustawienia WA51
ro_ro: Preferinte WA51
ru_ru: Настройки WA51
sk_sk: WA51 Predvoľby
sv_se: WA51-förval
tg_tj: WA51-и танзимшуда
vi_vn: Preset từ WA51
zh_cn: WA51 预置
zh_tw: WA51 預置

# #30021
source: Winamp Presets
bg_bg: Шаблони от Winamp
ca_es: Predefinits Winamp
cs_cz: Předvolby Winamp
cy_gb: Rhagosodiaid Winamp
de_de: Winamp Vorlagen
fr_ca: Préréglages Winamp
fr_fr: Présélections Winamp
gl_es: Preconfiguracións de Winamp
hr_hr: Winamp predlošci
hu_hu: Winamp beállításkészlet
id_id: Preset Winamp
ko_kr: Winamp 프리셋
lv_lv: Winamp sagataves
nb_no: Winamp forhåndsinnstillinger
pl_pl: Ustawienia Winampa
ro_ro: Preferinte Winamp
ru_ru: Настройки Winamp
sk_sk: Winamp Predvoľby
sv_se: Winamp-förval
tg_tj: Winamp-и танзимшуда
vi_vn: Preset từ Winamp
zh_cn: Winamp 预置
zh_tw: Winamp 預置

# #30022
source: User Defined Preset Folder
bg_bg: Папка за шаблоните на потребителя
ca_es: Directori de predefinits establert per l'usuari
cs_cz: Uživatelem zadaná složka předvoleb
cy_gb: Ffolder Rhagosodiad Defnyddiwr Diffinedig
de_de: benutzerdefinierter Vorlagen Ordner
fr_ca: Dossier de préréglages de l'utilisateur
fr_fr: Dossier de présélection défini par l'utilisateur
gl_es: Cartafol de preconfiguracións definido polo usuario
hr_hr: Korisnički odabrana mapa predložaka
hu_hu: Felhasználói készlet
id_id: Folder Preset yang ditentukan Pengguna
ko_kr: 사용자 정의 프리셋 폴더
lv_lv: Lietotāja norādīta sagatavju mape
nb_no: Brukerdefinert forhåndsinnstillingsmappe
pl_pl: Folder zdefiniowanych ustawień użytkownika
ro_ro: Dosar presetări definite de utilizator
ru_ru: Папка для пользовательских настроек
sk_sk: Užívateľom nastavený adresár Predvolieb
sv_se: Användardefineradförvalsmapp
tg_tj: Ҷузвдони интихобшудаи корбари муайяншуда
vi_vn: Đặt thư mục Preset
zh_cn: 用户定义的预置文件夹
zh_tw: 使用者定義的預置資料夾

# #30050
source: %2.0f secs
bg_bg: %2.0f сек
ca_es: %2.0f seg
cs_cz: %2.0f s
cy_gb: %2.0f eil
de_de: %2.0f sec
fr_ca: %2.0f s
gl_es: %2.0f seg
hr_hr: %2.0f sekundi
hu_hu: %2.0f mp
id_id: %2.0f detik
ko_kr: %2.0f 초
lv_lv: %2.0f sekundes
nb_no: %2.0f sek
pl_pl: %2.0f sek.
ro_ro: %2.0f sec
ru_ru: %2.0f с
sv_se: %2.0f sek
tg_tj: %2.0f сония
vi_vn: %2.0f giây
zh_cn: %2.0f 秒
zh_tw: %2.0f 秒

# #30052
source: %2.0f fps
cy_gb: %2.0f ye
fr_ca: %2.0f images-par-seconde
ru_ru: %2.0f кадр/с
tg_tj: %2.0f кадр/с
vi_vn: %2.0f hình/s
