Repository: xbmc/xbmc
Catalog: addons/pvr.team-mediaportal.tvserver/resources/language/Hebrew/strings.po
Languages: he

# Addon Summary
source: XBMC frontend for the MediaPortal TV Server (ffmpeg + tsreader version)
he: ממשק XBMC עבור MediaPortal TV Server (גירסת ffmpeg + tsreader)

# Addon Description
source: MediaPortal TV Server frontend. Supports streaming of Live TV &amp; Recordings, listening to Radio channels, EPG and Timers. This addon combines the former ffmpeg and tsreader addons.
he: ממשק MediaPortal TV Server. תומך בהזרמה של שידורי טלוויזיה לייב &amp; הקלטות, האזנה לערוצי רדיו, מדריך תוכניות ותזמוני הקלטות. התוסף משלב את מזרימי ffmpeg וtsreader שקדמו לו.

# Addon Disclaimer
source: This is unstable software! The authors are in no way responsible for failed recordings, incorrect timers, wasted hours, or any other undesirable effects.
he: זוהי תוכנה לא יציבה! הכותבים אינם אחראים בשום צורה על הקלטות שכשלו, תזמוני הקלטות לא נכונים, שעות שביזבזתם או כל השפעות בלתי רצויות אחרות.

# #30000
source: Mediaportal Hostname
he: שם מחשב Mediaportal

# #30001
source: Mediaportal XBMC plugin Port
he: פורט לפלאגין XBMC בMediaportal

# #30002
source: Free-to-air only
he: ערוצים חופשיים Free-to-air בלבד

# #30003
source: Include Radio
he: כלול ערוצי רדיו

# #30004
source: Fast channel switching (don't stop timeshift)
he: העברה מהירה בין ערוצים (אל תעצור timeshift)

# #30005
source: Connect timeout (s)
he: זמן לניסיון חיבור (שניות)

# #30006
source: Import only TV Channels from group
he: ייבא ערוצי טלוויזיה רק מקבוצת

# #30007
source: Import only Radio Channels from group
he: ייבא ערוצי רדיו רק מקבוצת

# #30008
source: Convert hostname to IP-adress
he: הפוך שם מחשב לכתובת IP

# #30009
source: EPG: Read genre strings (slow)
he: מדריך התוכניות: קרא ז'אנרים של תוכניות (איטי)

# #30010
source: Wait time after tuning a channel (ms)
he: המתן אחרי מעבר ערוץ (מילישניות)

# #30015
source: Streaming method
he: שיטת הזרמה

# #30016
source: Windows user account (SMB)
he: חשבון משתמש של חלונות (SMB)

# #30017
source: Windows password (SMB)
he: סיסמה של חלונות (SMB)

# #30018
source: Use RTSP streaming
he: השתמש בהזרמת RTSP

# #30040
source: Connection
he: חיבור

# #30042
source: Playback
he: ניגון

# #30050
source: Your TVServerXBMC version '%s' is too old. Please upgrade to '%s' or higher!
he: גירסת '%s' של הפלאגין TVServerXBMC ישנה מדי. אנא עדכן ל'%s' או חדשה יותר!

# #30051
source: Your TVServerXBMC version is too old. Please upgrade to '%s' or higher!
he: גירסת הפלאגין TVServerXBMC ישנה מדי. אנא עדכן ל'%s' או חדשה יותר!

# #30052
source: Recording playback failed. Empty URL of filename.
he: ניגון ההקלטה נכשלה. נקה את הURL או שם הקובץ.

# #30060
source: All cards are busy
he: כל הכרטיסים עסוקים

# #30061
source: Channel is scrambled
he: הערוץ מעורבל/מוצפן

# #30062
source: No video or audio detected
he: לא זוהה וידאו או אודיו

# #30063
source: No signal detected
he: אין קליטה

# #30064
source: Unknown error
he: שגיאה לא ידועה

# #30065
source: Unable to start graph
he: אין אפשרות להתחיל את הגרף

# #30066
source: Unknown channel
he: ערוץ לא ידוע

# #30067
source: No tuning details
he: אין נתוני כוונון

# #30068
source: Channel is not mapped to any card
he: הערוץ לא ממופה לשום כרטיס

# #30069
source: Card is disabled
he: הכרטיס מנוטרל

# #30070
source: Connection to slave failed
he: התקשורת לslave נכשלה

# #30071
source: Not the owner
he: לא הבעלים

# #30072
source: Graph building failed
he: בניית גרף נכשלה

# #30073
source: SW Encoder missing
he: מקודד SW חסר

# #30074
source: No free disk space
he: אין מקום פנוי בדיסק הקשיח

# #30075
source: No PMT found
he: לא נמצא PMT
