Repository: xbmc/xbmc
Catalog: addons/metadata.album.universal/resources/language/resource.language.*/strings.po
Languages: be_by, bs_ba, es_es, et_ee, he_il, pl_pl, sv_se, tr_tr, uk_ua, zh_cn

# Addon Summary
source: Universal Scraper for Albums
be_by: Універсальны сродак атрымання звестак пра альбомы
bs_ba: Univerzalni strugač za albume
es_es: Scraper universal para álbumes
et_ee: Universaalne albumite kaabits
he_il: סקרייפר אוניברסלי עבור אלבומים
pl_pl: Uniwersalny ekstraktor informacji o albumach muzycznych
sv_se: Universiell albumskrapa
tr_tr: Albümler için Evrensel Bilgi Sağlayıcı
uk_ua: Універсальний екстрактор для альбомів
zh_cn: 通用音乐专辑信息刮削器

# Addon Description
source: This scraper collects information from the following supported sites: MusicBrainz, last.fm, allmusic.com and amazon.de, while grabs artwork from: fanart.tv, last.fm and allmusic.com. It can be set field by field that from which site you want that specific information.[CR][CR]The initial search is always done on MusicBrainz. In case allmusic and/or amazon.de links are not added on the MusicBrainz site, fields from allmusic.com and/or amazon.de cannot be fetched (very easy to add those missing links though).
bs_ba: Ovaj strugač prikuplja informacije sa sljedećih podržanih web lokacija: MusicBrainz, last.fm, allmusic.com i amazon.de, dok preuzima ilustracije sa: fanart.tv, last.fm i allmusic.com. Može se postaviti polje po polje sa koje stranice želite te specifične informacije.[CR][CR]Početna pretraga se uvijek vrši na MusicBrainz-u. U slučaju da linkovi za allmusic i/ili amazon.de nisu dodani na MusicBrainz stranicu, polja sa allmusic.com i/ili amazon.de ne mogu se preuzeti (vrlo je lako dodati te nedostajuće linkove).
es_es: Este scraper recopila información de las siguientes webs: MusicBrainz, last.fm, allmusic.com y amazon.de, mientras obtiene las imágenes de fanart.tv, last.fm y allmusic.com. Permite especificar de qué web se quiere obtener la información para cada campo. ⏎ ⏎ La búsqueda inicial se realiza siempre en MusicBrainz. En caso de que los enlaces a allmusic y/o amazon.de no estén añadidos en la web de MusicBrainz, no se podrán obtener los campos de información de estos dos sitios (aunque es muy fácil añadir esos enlaces que faltan).
et_ee: See kaabits kogub infot järgmistelt lehtedelt: MusicBrainz, last.fm, allmusic.com ja amazon.de, pilte: fanart.tv, last.fm ja allmusic.com. Võimalik on välja kaupa määrata, milliselt lehelt mis infot soovid.[CR][CR]Esmane otsing tehakse alati saidilt MusicBrainz. Kui MusicBrainz lehele pole allmusic ja/või amazon.de linke lisatud, siis neilt lehtedelt sisu hankida ei saa (puuduvaid linke saad ise lihtsalt lisada).
he_il: סקרייפר זה אוסף מידע מהתארים הנתמכים הבאים: TheAudioDb.com, MusicBrainz, last.fm, and allmusic.com, בעוד שמשיכת גרפיקה נעשית דרך: fanart.tv, htbackdrops.com, last.fm and allmusic.com. יש אפשרות להגדיר את זאת שדה אחר שדה מאיזה אתר ברצונך למשוך את המידע הספציפי.⏎ ⏎ החיפוש הפנימי נעשה תמיד דרך MusicBrainz. במקרה שקישור allmusic לא התווסף באתר MusicBrainz, השדות מאת allmusic.com אינן יכולות להימשך (למרות שזה מאוד קל להוסיף את הקישורים הריקים).
pl_pl: Ten scraper zbiera informacje z następujących stron: MusicBrainz, last.fm, allmusic.com oraz amazon.de, a grafiki pobiera z: fanart.tv, last.fm i allmusic.com. Dla każdego pola z informacjami można wybrać osobną stronę.[CR][CR]Początkowe wyszukiwanie jest zawsze wykonywane na MusicBrainz. Gdy linki do allmusic i/lub amazon.de nie są dodane na stronie MusicBrainz, nie można pobrać tych pól z allmusic.com i/lub amazon.de (pomimo to brakujące linki można bardzo łatwo dodać).
sv_se: Denna skrapa samlar information från följande sajter: MusicBrainz, last.fm, allmusic.com och amazon.de, och konstverk från: fanart.tv, last.fm och allmusic.com. Det kan anges fält för fält vilken sajt du vill få den specifika informationen.⏎ ⏎ Den initiala sökningen är alltid utförd på MusicBrainz sajt, fälten från allmusic.com och/eller amazon.de länkarna läggs inte till på MusicBrainz sajten, fälten från allmusic.com och/eller amazon.de kan inte hämtas (väldigt enkelt att lägga till dom saknade länkarna dock).
tr_tr: Bu bilgi sağlayıcı, bilgileri toplamak için şu siteleri desteklemektedir: MusicBrainz, last.fm, allmusic.com ve amazon.de, çizimleri için ise: fanart.tv, last.fm ve allmusic.com desteklenmektedir. Her bilginin özellikle nereden alınacağını tek tek ayarlayabilirsiniz.[CR][CR]İlk olarak arama daima MusicBrainz'de yapılır. MusicBrainz'e allmusic ve/veya amazon.de linkleri eklenmemiş olması durumunda allmusic.com'dan ve/veya amazon.de'den ilgili alanlar alınamaz (gerçi bu eksik linkleri eklemek çok kolaydır).
uk_ua: Цей екстрактор витягує загальну інформацію з веб-сайтів MusicBrainz, last.fm, allmusic.com та amazon.de, а зображення — з fanart.tv, last.fm та allmusic.com. Для кожного поля можна вказати з якого веб-сайту потрібно брати інформацію.[CR][CR]Початковий пошук завжди робиться на MusicBrainz. Якщо на веб-сайті MusicBrainz не додано посилання на allmusic та/або amazon.de, тоді поля з allmusic.com та/або amazon.de неможливо отримати (проте ці пропущені посилання дуже легко додати).
zh_cn: 本刮削器支持从以下网站获取信息：MusicBrainz、last.fm、allmusic.com 和 amazon.de，并从以下网站获取艺术图片：fanart.tv、last.fm 和 allmusic.com。你可以指定每一项内容的来源网站。[CR][CR]初始结果总是先从 MusicBrainz 获取。如果 MusicBrainz 网站没有到 allmusic 和/或 amazon.de 的外部链接，则无法获取 allmusic.com 的/或 amazon.de 的信息（当然你能很容易地加入缺失的链接）。

# #30000
source: Grab Album Thumbs from fanart.tv
be_by: Атрымліваць мініяцюры альбомаў з fanart.tv
bs_ba: Preuzmite sličice albuma sa fanart.tv
es_es: Obtener miniaturas del álbum de fanart.tv
et_ee: Hangi albumi pisipildid allikast fanart.tv
he_il: משיכת תמונות אלבומים מ־fanart.tv
pl_pl: Pobierz miniatury albumów z fanart.tv
sv_se: Hämta albumminiatyrer från fanart.tv
tr_tr: Albüm Kapaklarını fanart.tv sitesinden al
uk_ua: Отримати ескізи альбомів з fanart.tv
zh_cn: 启用 fanart.tv 专辑图片

# #30001
source: Grab Album Thumbs from Last.fm
be_by: Атрымліваць мініяцюры альбомаў з Last.fm
bs_ba: Preuzmite sličice albuma sa Last.fm-a
es_es: Obtener miniaturas del álbum de Last.fm
et_ee: Hangi albumi pisipildid allikast Last.fm
he_il: משיכת תמונות אלבומים מ־Last.fm
pl_pl: Pobierz miniatury albumu z Last.fm
sv_se: Hämta albumminiatyrer från Last.fm
tr_tr: Albüm Kapaklarını Last.fm sitesinden al
uk_ua: Отримати ескізи альбому з Last.fm
zh_cn: 启用 Last.fm 专辑图片

# #30002
source: Get Album Review from
be_by: Атрымліваць агляды альбомаў з
bs_ba: Preuzmite recenziju albuma sa
es_es: Obtener reseña del álbum de
et_ee: Hangi albumi arvustused allikast
he_il: משיכת סקירת אלבומים מתוך
pl_pl: Pobierz recenzje albumu z
sv_se: Hämta albumrecensioner från
tr_tr: Albüm İncelemesini Şuradan Al
uk_ua: Отримати огляд альбому з
zh_cn: 专辑评论获取于

# #30003
source: Preferred Language
be_by: Пераважная мова
bs_ba: Preferirani jezik
es_es: Idioma preferido
et_ee: Eelistatud keel
he_il: שפה מועדפת
pl_pl: Preferowany język
sv_se: Föredraget språk
tr_tr: Tercih Edilen Dil
uk_ua: Бажана мова
zh_cn: 首选语言

# #30004
source: Get Album Rating from
be_by: Атрымліваць рэйтынг альбомаў з
bs_ba: Preuzmite ocjenu albuma sa
es_es: Obtener valoración del álbum de
et_ee: Hangi albumi hinnang allikast
he_il: משיכת דירוג אלבומים מתוך
pl_pl: Pobierz ocenę albumu z
sv_se: Hämta albumbetyg från
tr_tr: Albüm Değerlendirmesini Şuradan Al
uk_ua: Отримати рейтинг альбому з
zh_cn: 专辑评分获取于

# #30005
source: Get Album Styles from
be_by: Атрымліваць стылі альбомаў з
bs_ba: Preuzmite stilove albuma sa
es_es: Obtener estilos del álbum de
et_ee: Hangi albumi stiil allikast
he_il: משיכת סגנונות אלבומים מתוך
pl_pl: Pobierz style albumu z
sv_se: Hämta albumstilar från
tr_tr: Albüm Türünü Şuradan Al
uk_ua: Отримати стилі альбому з
zh_cn: 专辑风格获取于

# #30006
source: Get Album Moods from
be_by: Атрымліваць настроі альбомаў з
bs_ba: Preuzmite raspoloženja albuma sa
es_es: Obtener estados de ánimo del álbum de
et_ee: Hangi albumi meeleolu allikast
he_il: משיכת מצבי רוח של אלבומים מתוך
pl_pl: Pobierz nastroje albumu z
sv_se: Hämta albumhumör från
tr_tr: Albüm Ruh Halini Şuradan Al
uk_ua: Отримати настрої альбому з
zh_cn: 专辑心情获取于

# #30007
source: Get Album Themes from
be_by: Атрымліваць тэмы альбомаў з
bs_ba: Preuzmite teme albuma sa
es_es: Obtener temas del álbum de
et_ee: Hangi albumi teema allikast
he_il: משיכת ערכות נושא של אלבומים מתוך
pl_pl: Pobierz motywy albumu z
sv_se: Hämta albumteman från
tr_tr: Albüm Temalarını Şuradan Al
uk_ua: Отримати теми альбому з
zh_cn: 专辑主题获取于

# #30008
source: Grab Album Thumbs from allmusic.com
be_by: Атрымліваць мініяцюры альбомаў з allmusic.com
bs_ba: Preuzmite sličice albuma sa allmusic.com
es_es: Obtener miniaturas del álbum de allmusic.com
et_ee: Hangi albumi pisipildid allikast allmusic.com
he_il: משיכת תמונות אלבומים מתוך allmusic.com
pl_pl: Pobierz miniatury albumu z allmusic.com
sv_se: Hämta albumminiatyrer från allmusic.com
tr_tr: Albüm Kapaklarını allmusic.com sitesinden al
uk_ua: Отримати ескізи альбому з allmusic.com
zh_cn: 从 allmusic.com 获取专辑图片

# #30009
source: Artwork
be_by: Вокладка
bs_ba: Umjetničko djelo
et_ee: Kunst
he_il: גרפיקה
pl_pl: Grafika
sv_se: Bakgrund
tr_tr: Resim
uk_ua: Обкладинка
zh_cn: 艺术图片

# #30010
source: Grab Album Thumbs from theaudiodb.com
be_by: Атрымліваць мініяцюры альбомаў з theaudiodb.com
bs_ba: Preuzmite sličice albuma sa theaudiodb.com
es_es: Obtener miniaturas del álbum de theaudiodb.com
et_ee: Hangi albumi pisipildid allikast theaudiodb.com
he_il: משיכת תמונות אלבומים מתוך theaudiodb.com
pl_pl: Pobierz miniatury albumu theaudiodb.com
sv_se: Hämta albumminiatyrer från theaudiodb.com
tr_tr: Albüm Kapaklarını theaudiodb.com sitesinden al
uk_ua: Отримати ескізи альбому з theaudiodb.com
zh_cn: 从 theaudiodb.com 获取专辑图片

# #30011
source: MB Mirror
be_by: Люстэрка MB
bs_ba: MB ogledalo
es_es: Espejo MB
et_ee: MB peegelserver
he_il: אתר מראה של MB
pl_pl: Serwer lustrzany MB
sv_se: MB-spegel
tr_tr: MB Yansısı
uk_ua: Дзеркало MB
zh_cn: MB 镜像

# #30012
source: MusicBrainz Mirror
be_by: Люстэрка MusicBrainz
bs_ba: MusicBrainz ogledalo
es_es: Espejo MusicBrainz
et_ee: MusicBrainz peegelserver
he_il: אתר מראה של MusicBrainz
pl_pl: Serwer lustrzany MusicBrainz
sv_se: MusicBrainz-spegel
tr_tr: MusicBrainz Yansısı
uk_ua: Дзеркало MusicBrainz
zh_cn: MusicBrainz 镜像

# #30013
source: Grab Album Discart from fanart.tv
be_by: Атрымліваць ілюстрацыі дыскаў з fanart.tv
bs_ba: Preuzmite odbacaj albuma sa fanart.tv
es_es: Obtener discart del álbum de fanart.tv
et_ee: Hangi albumi plaadipildid allikast fanart.tv
he_il: משיכת עיצובי תקליטורים של אלבומים מ־fanart.tv
pl_pl: Pobierz grafikę płyty albumu z fanart.tv
sv_se: Hämta albumets discart från fanart.tv
tr_tr: Albüm Disk Resmini fanart.tv sitesinden al
uk_ua: Отримувати обкладинку диска альбому з fanart.tv
zh_cn: 从 fanart.tv 获取专辑光盘艺术图

# #30014
source: Grab Album Back Cover from theaudiodb.com
be_by: Атрымліваць заднія вокладкі альбомаў з theaudiodb.com
bs_ba: Preuzmite zadnju koricu albuma sa theaudiodb.com
es_es: Obtener contraportada del álbum de theaudiodb.com
et_ee: Hangi albumi tagakaas allikast theaudiodb.com
he_il: משיכת עטיפות אחוריות של אלבומים מ־theaudiodb.com
pl_pl: Pobierz tylną okładkę albumu z theaudiodb.com
sv_se: Hämta albumets baksida från theaudiodb.com
tr_tr: Albüm Arka Kapak resmini theaudiodb.com sitesinden al
uk_ua: Отримувати задню обкладинку альбому з theaudiodb.com
zh_cn: 从 theaudiodb.com 获取专辑封底

# #30015
source: Grab Album Discart from theaudiodb.com
be_by: Атрымліваць ілюстрацыі дыскаў альбомаў з theaudiodb.com
bs_ba: Preuzmite odbacaj albuma sa theaudiodb.com
es_es: Obtener discart del álbum de theaudiodb.com
et_ee: Hangi albumi plaadipildid allikast theaudiodb.com
he_il: משיכת עיצובי תקליטורים של אלבומים מ־theaudiodb.com
pl_pl: Pobierz grafikę płyty albumu z theaudiodb.com
sv_se: Hämta albumets discart från theaudiodb.com
tr_tr: Albüm Disk Resmini theaudiodb.com sitesinden al
uk_ua: Отримувати обкладинку диска альбому з theaudiodb.com
zh_cn: 从 theaudiodb.com 获取专辑光盘艺术图

# #30016
source: Grab Album Spine from theaudiodb.com
be_by: Атрымліваць хрыбты альбомаў з theaudiodb.com
bs_ba: Preuzmite kralježnicu albuma sa theaudiodb.com
es_es: Obtener lomo del álbum de theaudiodb.com
et_ee: Hangi albumi küljepildid allikast theaudiodb.com
he_il: משיכת שדרות של תקליטורים מ־theaudiodb.com
pl_pl: Pobierz grzbiet albumu z theaudiodb.com
sv_se: Hämta albumets spine från theaudiodb.com
tr_tr: Albüm Sırtını theaudiodb.com sitesinden al
uk_ua: Отримувати корінець альбому з theaudiodb.com
zh_cn: 从 theaudiodb.com 获取专辑书脊
