Repository: xbmc/xbmc
Catalog: addons/weather.wunderground/resources/language/Tamil (India)/strings.po
Languages: ta_in

# #32101
source: Location setup
ta_in: இருப்பிடம் அமைப்பு

# #32102
source: Advanced options
ta_in: கூடுதல் விருப்பங்கள்

# #32111
source: Location 1
ta_in: இருப்பிடம் 1

# #32112
source: Location 2
ta_in: இருப்பிடம் 2

# #32113
source: Location 3
ta_in: இருப்பிடம் 3

# #32114
source: Location 1 display name
ta_in: இருப்பிடம் 1 காட்சி பெயர்

# #32115
source: Location 2 display name
ta_in: இருப்பிடம் 2 காட்சி பெயர்

# #32116
source: Location 3 display name
ta_in: இருப்பிடம் 3 காட்சி பெயர்

# #32117
source: Location 1 id
ta_in: இருப்பிடம் 1 எண்

# #32118
source: Location 2 id
ta_in: இருப்பிடம் 2 எண்

# #32119
source: Location 3 id
ta_in: இருப்பிடம் 3 எண்

# #32120
source: Enable logging
ta_in: பதிவெடுத்தலை செயல்படுத்து

# #32121
source: Weekend
ta_in: வார இறுதி

# #32122
source: Saturday/Sunday
ta_in: சனி/ஞாயிறு

# #32123
source: Friday/Saturday
ta_in: வெள்ளி/சனி

# #32124
source: Thursday/Friday
ta_in: வியாழன்/வெள்ளி

# #32125
source: Map zoom level
ta_in: நிலப்படம் பெரிதாக்கு நிலை

# #32126
source: Animated map
ta_in: அசைவூட்டபட்ட நிலப்படம்

# #32127
source: Location 4
ta_in: இருப்பிடம் 4

# #32128
source: Location 5
ta_in: இருப்பிடம் 5

# #32129
source: Location 4 display name
ta_in: இருப்பிடம் 4 காட்சி பெயர்

# #32130
source: Location 5 display name
ta_in: இருப்பிடம் 5 காட்சி பெயர்

# #32131
source: Location 4 id
ta_in: இருப்பிடம் 4 எண்

# #32132
source: Location 5 id
ta_in: இருப்பிடம் 5 எண்

# #32501
source: New Moon
ta_in: அமாவாசை

# #32502
source: Waxing Crescent
ta_in: வளர்பிறை

# #32503
source: First Quarter
ta_in: முதல் கால்பகுதி

# #32504
source: Waxing Gibbous
ta_in: வளர்பிறை

# #32505
source: Full Moon
ta_in: பௌர்ணமி

# #32506
source: Waning Gibbous
ta_in: தேய்பிறை

# #32507
source: Last Quarter
ta_in: கடைசி கால்பகுதி

# #32508
source: Waning Crescent
ta_in: தேய்பிறை

# #32510
source: Warning
ta_in: எச்சரிக்கை

# #32511
source: Watch
ta_in: கண்காணிப்பு

# #32512
source: Advisory
ta_in: ஆலோசனை

# #32513
source: Statement
ta_in: கூற்று

# #32514
source: Outlook
ta_in: கண்ணோட்டம்

# #32515
source: Forecast
ta_in: முன் அறிவிப்பு

# #32516
source: Synopsis
ta_in: தொகுப்பு
