Repository: xbmc/xbmc
Catalog: addons/skin.confluence/language/Lithuanian/strings.po
Languages: lt

# #31000
source: Change Your
lt: Keičiami

# #31003
source: Power Options
lt: Energijos nustatymai

# #31004
source: Working...
lt: Veikia...

# #31005
source: Hide Information
lt: Paslėpti informaciją

# #31006
source: View Options
lt: Rodinio parinktys

# #31008
source: Fullscreen
lt: Per visą ekraną

# #31009
source: Total Duration
lt: Bendra trukmė

# #31022
source: Music - Files
lt: Muzikos - Failai

# #31023
source: Playing
lt: Atkūrimas

# #31024
source: Page
lt: Puslapis

# #31025
source: Items
lt: Elementai

# #31026
source: Misc Options
lt: Kitos opcijos

# #31027
source: Location
lt: Vieta (Lokacija)

# #31028
source: Poster Wrap
lt: Posterių karuselė

# #31031
source: Pic Thumbs
lt: Miniatiūros

# #31032
source: Image Wrap
lt: Paveikslėliai žemai

# #31033
source: Info
lt: Informacija

# #31040
source: Now Playing
lt: Dabar Rodoma/Grojama

# #31042
source: PLAYING
lt: ATKŪRIMAS

# #31043
source: PAUSED
lt: PAUZĖ

# #31044
source: FAST FORWARD
lt: PRASUKTI PIRMYN

# #31045
source: REWIND
lt: PRASUKTI ATGAL

# #31048
source: Visualization Presets
lt: Vizualizacijos parinktys

# #31049
source: End Time
lt: Pabaigos laikas

# #31050
source: Sort: Ascending
lt: Ruš.: Didėjimo tvarka

# #31051
source: Sort: Descending
lt: Ruš.: Mažėjimo tvarka

# #31055
source: Open playlist
lt: Atidaryti grojaraštį

# #31056
source: Save playlist
lt: Įšsaugoti grojaraštį

# #31057
source: Close playlist
lt: Uždaryti grojaraštį

# #31058
source: System music files
lt: Sisteminiai audio failai

# #31059
source: Current playlist
lt: Aktualus grojaraštis

# #31060
source: This file is stacked, select the part you want to play from.
lt: Šie failai yra sugrupuoti, pasirinkite dalį katrą norite atkurti.

# #31061
source: Current Selected
lt: Dabartinis pasirinkimas

# #31101
source: Home screen options
lt: Pagrindinio ekrano nustatymai

# #31102
source: Background
lt: Fono

# #31103
source: Show "Paused" in picture slide show
lt: Rodyti [COLOR=red]Pauzė[/COLOR] prezentacijos režime

# #31104
source: Play Trailers in a window [COLOR=grey3](Video Information Dialog Only)[/COLOR]
lt: Rodyti Filmo anonsą lange [COLOR=grey3](Tik informacijai apie filmo santrauką)[/COLOR]

# #31106
source: Miscellaneous options
lt: Įvairios opcijos

# #31107
source: Hide Flagging read from video filenames [COLOR=grey3](Blu-ray, HD-DVD)[/COLOR]
lt: Paslėpti nuorodas iš skaitomo failo [COLOR=grey3](Blu-ray, HD-DVD)[/COLOR]

# #31108
source: Hide Main Menu Buttons
lt: Slėpti pagrindinio meniu nuorodas

# #31111
source: Hide
lt: Paslėpti

# #31112
source: Options
lt: Nustatymai

# #31116
source: Show Recently added Albums
lt: Rodyti neseniai patalpintus albumus

# #31117
source: Show Recently added Videos
lt: Rodyti neseniai patalpintus video

# #31118
source: Home Page Programs Submenu
lt: Pagrindinio ekrano submeniu

# #31119
source: Hide Background Fanart
lt: Slėpti [COLOR=red]Fanart[/COLOR] informaciją

# #31122
source: Weather Page
lt: Orų puslapis

# #31123
source: Use "Posters" instead of "Banners" for TV Shows
lt: Naudoti [COLOR=red]Posterius[/COLOR] vietoj [COLOR=red]Banerių[/COLOR] serialams

# #31124
source: Show Background "Now Playing" Video
lt: Rodyti foninį [COLOR=red]Atkuriamasis[/COLOR] video

# #31125
source: Show Background "Now Playing" Visualization
lt: Rodyti foninį [COLOR=red]Atkuriamasis[/COLOR] vizualizacija

# #31126
source: Play TV theme songs in video library (TvTunes add-on)
lt: Groti TV temų dainas vaizdo bibliotekoje [COLOR=red]TvTunes priedai[/COLOR]

# #31128
source: Lyrics
lt: Dainų tekstai

# #31132
source: Lyrics Add-on
lt: Dainų tekstų priedas

# #31133
source: Subtitle Add-on
lt: Subtitrų priedas

# #31134
source: Home Page Videos Submenu
lt: Pagrindinio puslapio video submeniu

# #31135
source: Home Page Music Submenu
lt: Pagrindinio puslapio muzikos submeniu

# #31136
source: Home Page Pictures Submenu
lt: Pagrindinio puslapio paveikslėlių submeniu

# #31140
source: Music OSD
lt: Muzikos OSD

# #31200
source: Shortcuts
lt: Etiketės

# #31203
source: Choose Your Song
lt: Išsirinkti savo dainą

# #31205
source: Lyrics Source
lt: Dainų tekstų šaltinis

# #31206
source: Found
lt: Iš viso

# #31207
source: Find More Items
lt: Rasti daugiau elementų

# #31208
source: Upcoming Episodes
lt: Artėjantys epizodai

# #31300
source: Current Temp
lt: Dabartinė temperatūra

# #31301
source: Last Updated
lt: Paskutiniai atnaujinimai

# #31303
source: Data provider
lt: Duomenų teikėjas

# #31307
source: Hide Fanart
lt: Paslėpti [COLOR=red]Fanart[/COLOR]

# #31308
source: Movie Details
lt: Daugiau apie filmą

# #31309
source: Memory Used:
lt: Išnaudota atminties:

# #31310
source: Track Number
lt: Takelio Num.:

# #31311
source: Fanart image[CR][CR]Unavailable[CR][CR] Click button to set
lt: [COLOR=red]Fanart[/COLOR][CR][CR]nepasiekiamas[CR][CR] paspauskite pasirinkimui

# #31312
source: Current Scraper
lt: Aktualus skreperis

# #31313
source: Choose a Scraper
lt: Pasirinkti skreperį

# #31314
source: Content Scanning Options
lt: Nuskaitomo turinio parinktys

# #31317
source: Set Fanart Path
lt: Nurodyti kelią iki [COLOR=red]Fanart[/COLOR]

# #31319
source: Selected Profile
lt: Pasirinktas profilis

# #31320
source: Last Logged In
lt: Paskutinis įėjimas

# #31321
source: Karaoke Song Selector
lt: Karaoke dainos pasirinkimas

# #31322
source: Aired
lt: Rodomas

# #31325
source: Playlist Options
lt: Sąrašo opcijos

# #31326
source: Created
lt: Sukurta

# #31327
source: Resolution
lt: Leidimas

# #31328
source: Recently Added
lt: Neseniai dadėta

# #31329
source: [B]Timer set![/B] [COLOR=grey2] - System auto shutdown in[/COLOR]
lt: [B]Nustatytas laikrodis![/B] [COLOR=grey2] - automatiškai atsijungs po[/COLOR]

# #31330
source: Click button to play[CR][CR]Movie trailer
lt: Spustelėkite norėdami atkūrti[CR][CR]Filmo anonsą

# #31331
source: Album Details
lt: Albumai detaliau

# #31351
source: Pause
lt: Pauzė

# #31353
source: Fast Forward
lt: Prasukimas pirmyn

# #31354
source: Rewind
lt: Prasukimas atgal

# #31355
source: Movie menu
lt: Filmo meniu

# #31356
source: Download Subtitles
lt: Atsisiųsti subtitrus

# #31390
source: Skin default
lt: Numatytasis viršelis

# #31391
source: Skin default with no Caps
lt: Viršelis pagal nutylėjimą šablonui be [COLOR=red]Kaps[/COLOR]

# #31392
source: Arial based
lt: [COLOR=red]Arial[/COLOR] pagrindu

# #31400
source: [B]CONFIGURE APPEARANCE SETTINGS[/B][CR][CR]Change the skin · Set language and region · Change file listing options[CR]Set up a screensaver
lt: [B][COLOR=red]VIRŠELIO PARAMETRŲ NUSTATYMAI[/COLOR][/B][CR]Pakeisti viršelį · Nustatyti kalbą ir regioną[CR][COLOR=red]Žemiau pateikiami trumpinių tokių kaip[/COLOR][CR][COLOR=blue](DXVA, Replaygain, EXIF, Zeroconf, AirPlay ir Prezentacija t.t...) paaiškinimai[/COLOR]

# #31401
source: [B]CONFIGURE VIDEO SETTINGS[/B][CR][CR]Manage your video library · Set video playback options · Change video listing options[CR]Set subtitle fonts
lt: [B][COLOR=red]VIDEO PARAMETRŲ NUSTATYMAI[/COLOR][/B][CR]Tvarkyti video biblioteką · Nustatyti video atkūrimo opcijas Nustatyti video sarašą[CR][COLOR=red]DXVA2[/COLOR] [COLOR=blue]aparatūrinis spartinimas (Direct-X) · Aparatūros video dekodavimas GPU(DXVA)[CR]gerokai sumažina CPU apkrovą kai kuriais atvejais žymiai pagerina vaizdo kokybę[/COLOR]

# #31402
source: [B]CONFIGURE MUSIC SETTINGS[/B][CR][CR]Manage your music library · Set music playback options · Change music listing options[CR]Setup song submission · Set karaoke options
lt: [B][COLOR=red]MUZIKOS PARAMETRŲ NUSTATYMAI[/COLOR][/B][CR]Tvarkyti audio biblioteką· Nustatyti audio atkūrimo opcijas · Nustatyti audio sarašą[CR]Nustatyti audio pridėjimą · [COLOR=red]ReplayGain[/COLOR] [COLOR=blue]funkcija, kuri garantuos skirtingo garsumo[CR]muzikos kūrinių grojimą vienodu lygiu[/COLOR]

# #31403
source: [B]CONFIGURE PICTURE SETTINGS[/B][CR][CR]Set picture listing options · Configure slideshows
lt: [B][COLOR=red]FOTO /PAVEIKSLĖLIŲ PARAMETRŲ NUSTATYMAI[/COLOR][/B][CR]Tvarkyti nuotraukų biblioteką · Nustatyti pristatymą · Nustatyti prezentaciją[CR][COLOR=red]EXIF[/COLOR] [COLOR=blue]tai nuotraukos faile saugoma papildoma informacija kurioje nurodyti visi[CR]fotografavimo parametrai: data, laikas, išlaikymas, diafragma ir t.t...[/COLOR]

# #31404
source: [B]CONFIGURE WEATHER SETTINGS[/B][CR][CR]Set three cities to collect weather information
lt: [B][COLOR=red]ORŲ PARAMETRŲ NUSTATYMAI[/COLOR][/B][CR][CR]Nustatyti trys Miestus gauti informacijai apie orus

# #31406
source: [B]CONFIGURE SYSTEM SETTINGS[/B][CR][CR]Setup and calibrate displays · Configure audio output · Setup remote controls[CR]Set power saving options · Enable debugging · Setup master lock
lt: [B][COLOR=red]SISTEMOS PARAMETRŲ NUSTATYMAI[/COLOR][/B][CR]Nustatyti ekrano kalibravimą · Nustatyti audio išėjimą · Nustatyti distancinį pultą[CR][COLOR=red]Master Lock[/COLOR] [COLOR=blue]leidžia nustatyti pagrindinį užrakto slaptažodį. Apriboja prieigą prie[CR]pasirinktų skyrių tokių kaip Programos ir Scenarijai, Failų tvarkyklė ir Nustatymai[/COLOR]

# #31407
source: [B]CONFIGURE SKIN SETTINGS[/B][CR][CR]Setup the Confluence skin · Add and remove home menu items[CR]Change skin backgrounds
lt: [B][COLOR=red]VIRŠELIO PARAMETRŲ NUSTATYMAI[/COLOR][/B][CR]Nustatyti pasirinktą viršelį · Pakeisti viršelio foną · [COLOR=red]FanArt[/COLOR] [COLOR=blue]yra meno kūrinys · Kuriami[CR]baneriai, avatarai, animacija ir plakatai.[/COLOR] · [COLOR=red]Baneris[/COLOR] [COLOR=blue]tai keturkampio formos, patrauklus[CR]dėmesį patraukiantis tekstinis ar vaizdinis paveikslėlis dedamas viršuje, apačioje ar šone[/COLOR]

# #31408
source: [B]CONFIGURE ADD-ONS[/B][CR][CR]Manage your installed Add-ons · Browse for and install Add-ons from xbmc.org[CR]Modify Add-on settings
lt: [B][COLOR=red]PRIEDŲ PARAMETRŲ NUSTATYMAI[/COLOR][/B][CR]Nustatyti parametrų valdymą · Nustatyti diegimą iš xbmc.org · Nustatyti priedų pakeitimą[CR][COLOR=red]Prezentacija[/COLOR] — [COLOR=blue]visuomeninės komunikacijos forma, ko nors naujo, įdomaus, vertingo[CR]pristatymas visuomenei arba visuomenės grupei[/COLOR]

# #31421
source: Select your XBMC user Profile[CR]to login and continue
lt: Pasirinkite XBMC vartotojo profilį[CR]įeiti į sistemą ir tęsti.

# #31901
source: 36 Hour Forecast
lt: 36 Valandų prognozė

# #31902
source: Hourly Forecast
lt: Valandinė prognozė

# #31903
source: Weekend Forecast
lt: Savaitgalio prognozė

# #31904
source: 10 Day Forecast
lt: 10 Dienų prognozė

# #31905
source: Forecast
lt: Prognozė

# #31906
source: Maps & Video
lt: Žemėlapiai ir video

# #31908
source: Chance of Precipitation
lt: Kritulių tikimybė

# #31909
source: Fetching forecast info...
lt: Parsiunčiama prognozės informacija...
