Repository: xbmc/xbmc
Catalog: addons/weather.wunderground/resources/language/Vietnamese/strings.po
Languages: vi

# #32101
source: Location setup
vi: Thiết lập Chổ

# #32102
source: Advanced options
vi: Các chức năng nâng cao

# #32111
source: Location 1
vi: Chổ 1

# #32112
source: Location 2
vi: Chổ 2

# #32113
source: Location 3
vi: Chổ 3

# #32114
source: Location 1 display name
vi: Hiển thị tên của Chổ 1

# #32115
source: Location 2 display name
vi: Hiển thị tên của Chổ 2

# #32116
source: Location 3 display name
vi: Hiển thị tên của Chổ 3

# #32117
source: Location 1 id
vi: Mã địa điểm 1

# #32118
source: Location 2 id
vi: Mã địa điểm 2

# #32119
source: Location 3 id
vi: Mã địa điểm 3

# #32120
source: Enable logging
vi: Lưu lại báo cáo

# #32121
source: Weekend
vi: Cuối tuần

# #32122
source: Saturday/Sunday
vi: Thứ bảy/Chủ Nhật

# #32123
source: Friday/Saturday
vi: Thứ sáu/Thứ bảy

# #32124
source: Thursday/Friday
vi: Thứ năm/Thứ sáu

# #32125
source: Map zoom level
vi: Bản đồ mức độ phóng

# #32126
source: Animated map
vi: Bản đồ di chuyển

# #32501
source: New Moon
vi: Tuần trăng mới

# #32502
source: Waxing Crescent
vi: Trăng lưỡi liềm

# #32503
source: First Quarter
vi: Quý đầu tiên

# #32504
source: Waxing Gibbous
vi: Trăng khuyết

# #32505
source: Full Moon
vi: Trăng tròn

# #32506
source: Waning Gibbous
vi: Trăng khuyết

# #32507
source: Last Quarter
vi: Quý cuối cùng

# #32508
source: Waning Crescent
vi: Trăng lưỡi liềm

# #32510
source: Warning
vi: Cảnh báo

# #32511
source: Watch
vi: Xem

# #32512
source: Advisory
vi: Lời khuyên

# #32513
source: Statement
vi: Báo cáo

# #32514
source: Outlook
vi: Toàn cảnh

# #32515
source: Forecast
vi: Dự báo

# #32516
source: Synopsis
vi: Tóm tắt
