Repository: xbmc/xbmc
Catalog: addons/visualization.milkdrop/resources/language/*/strings.po
Languages: dutch, spanish

# Addon Summary
source: MilkDrop takes you flying through the soundwaves you're hearing
spanish: Milkdrop te lleva volando a través de las ondas que estás escuchando

# Addon Description
source: MilkDrop was originally a music visualizer "plug-in" to the Winamp music player. As you listen to your music, MilkDrop takes you flying through the actual soundwaves you're hearing, and uses beat detection to trigger myriad psychedelic effects, creating a rich visual journey through sound.
spanish: MilkDrop era originalmente un plug-in visualizador de música para Winamp. Mientras escuchas música, MilkDrop te lleva volando a través de las ondas que estás escuchando, y utiliza la detección del ritmo para activar una gran cantidad de efectos psicodélicos, creando una rica experiencia visual a través del sonido.

# #30000
source: Automatic Blend Time
dutch: Automatische overgangstijd
spanish: Tiempo de mezcla automático

# #30001
source: Time Between Presets
dutch: Tijd tussen presets
spanish: Tiempo entre presets

# #30002
source: Additional Random Time
dutch: Bijkomende willekeurige tijd
spanish: Tiempo aleatorio adicional

# #30003
source: Enable Anisotropic Filtering
dutch: Anisotropisch filter inschakelen
spanish: Activar el filtro Anisotrópico

# #30004
source: Enable Hard Cuts
dutch: Ruwe afkappingen inschakelen
spanish: Habilitar cortes

# #30005
source: Loudness Threshold For Hard Cuts
dutch: Geluidssterktedrempel voor een ruwe afkapping
spanish: Umbral de volumen para cortes

# #30006
source: Average Time Between Hard Cuts
dutch: Gemiddelde tijd tussen ruwe afkappingen
spanish: Tiempo médio entre cortes

# #30007
source: Maximum Refresh Rate
dutch: Maximale verversingsfrequentie
spanish: Frecuencia de actualización máxima

# #30008
source: Enable Stereo 3D
dutch: Stereo 3D inschakelen
spanish: Habilitar Stereo 3D

# #30009
source: Preset Pack
dutch: Preset pakket
spanish: Conjunto de presets

# #30010
source: User Preset Folder
dutch: Gebruiker Preset Folder
spanish: Carpeta de presets del usuario

# #30011
source: Preset Shuffle Mode
spanish: Modo aleatorio de presets

# #30020
source: WA51 Presets
spanish: Presets WA51

# #30021
source: Winamp Presets
spanish: Presets Winamp

# #30022
source: User Defined Preset Folder
dutch: Gebruiker Gedefineerde Preset Folder
spanish: Carpeta de presets definida por el usuario

# #30050
source: %2.0f secs
dutch: %2.Van sec.
spanish: %2.0f seg

# #30051
source: %2.0f %%
dutch: %2.Van %%

# #30052
source: %2.0f fps
dutch: %2.Van fps
