Repository: xbmc/xbmc
Catalog: addons/weather.wunderground/resources/language/Norwegian/strings.po
Languages: no

# #32101
source: Location setup
no: Steder

# #32102
source: Advanced options
no: Avanserte alternativer

# #32111
source: Location 1
no: Sted 1

# #32112
source: Location 2
no: Sted 2

# #32113
source: Location 3
no: Sted 3

# #32114
source: Location 1 display name
no: Visningsnavn for sted 1

# #32115
source: Location 2 display name
no: Visningsnavn for sted 2

# #32116
source: Location 3 display name
no: Visningsnavn for sted 3

# #32117
source: Location 1 id
no: ID for sted 1

# #32118
source: Location 2 id
no: ID for sted 2

# #32119
source: Location 3 id
no: ID for sted 3

# #32120
source: Enable logging
no: Aktiver logging

# #32121
source: Weekend
no: Helg

# #32122
source: Saturday/Sunday
no: Lørdag/søndag

# #32123
source: Friday/Saturday
no: Fredag/lørdag

# #32124
source: Thursday/Friday
no: Torsdag/fredag

# #32125
source: Map zoom level
no: Zoomnivå for kart

# #32126
source: Animated map
no: Animert kart

# #32501
source: New Moon
no: Nymåne

# #32503
source: First Quarter
no: Halvmåne ny

# #32504
source: Waxing Gibbous
no: Tiltagende mot fullmåne

# #32505
source: Full Moon
no: Fullmåne

# #32506
source: Waning Gibbous
no: Minkende fra fullmåne

# #32507
source: Last Quarter
no: Halvmåne ne

# #32508
source: Waning Crescent
no: Minkende fra fullmåne

# #32510
source: Warning
no: Advarsel

# #32511
source: Watch
no: Se

# #32512
source: Advisory
no: Anbefaling

# #32513
source: Statement
no: Uttalelse

# #32514
source: Outlook
no: Prognose

# #32515
source: Forecast
no: Værvarsel

# #32516
source: Synopsis
no: Sammendrag
