Repository: xbmc/xbmc
Catalog: language/Greek/strings.po
Languages: el

# #37024
source: Select this if the audio out connection only supports multichannel audio as Dolby Digital 5.1, this allows multichannel audio such as AAC5.1 or FLAC5.1 to be listened to in 5.1 surround sound. Note - Not recommended on Pi as this requires a lot of CPU.
el: Επιλογή αυτής της ρύθμισης αν η σύνδεση της εξόδου ήχου υποστηρίζει μόνο πολυκάναλο ήχο όπως το Dolby Digital 5.1. Με αυτόν τον τρόπο μπορεί να αποδοθεί πολυκάναλος ήχος όπως AAC5.1 ή FLAC5.1 σε μορφή 5.1 surround sound. Σημείωση - δεν προτείνεται για Raspberry Pi, καθώς απαιτεί πολλή επεξεργαστική ισχύ.
