Repository: xbmc/xbmc
Catalog: language/Greek/strings.po
Languages: el

# #548
source: Downmix multichannel audio to stereo
el: Downmix πολυκάναλου ήχου σε στερεοφωνικό

# #550
source: Sort by: %s
el: Ταξ.: %s

# #551
source: Name
el: Όνομα

# #552
source: Date
el: Ημερομηνία

# #553
source: Size
el: Μέγεθος

# #554
source: Track
el: Κομμάτι

# #555
source: Time
el: Διάρκεια

# #556
source: Title
el: Τίτλος

# #557
source: Artist
el: Καλλιτέχνης

# #558
source: Album
el: Άλμπουμ

# #559
source: Playlist
el: Λίστα αναπαραγωγής

# #561
source: File
el: Αρχείο

# #562
source: Year
el: Έτος

# #563
source: Rating
el: Αξιολόγηση

# #564
source: Type
el: Τύπος

# #565
source: Usage
el: Χρήση

# #566
source: Album artist
el: Καλλιτέχνης Άλμπουμ

# #567
source: Play count
el: Αναπαράχθηκε

# #568
source: Last played
el: Τελευταία αναπαραγωγή

# #569
source: Comment
el: Σχόλια

# #570
source: Date added
el: Ημ/νία προσθήκης

# #571
source: Default
el: Προεπιλεγμένη

# #572
source: Studio
el: Στούντιο

# #573
source: Path
el: Διαδρομή

# #574
source: Country
el: Χώρα

# #575
source: In progress
el: Σε εξέλιξη

# #576
source: Times played
el: Αριθμός αναπαραγωγών

# #577
source: Date Taken
el: Ημ/νία Λήψης

# #580
source: Sort direction
el: Σειρά ταξινόμησης

# #581
source: Sort method
el: Μέθοδος ταξινόμησης

# #582
source: View mode
el: Τύπος Προβολής

# #583
source: Remember views for different folders
el: Απομνημόνευση προβολών διαφορετικών φακέλων

# #584
source: Ascending
el: Αύξουσα

# #585
source: Descending
el: Φθίνουσα

# #586
source: Edit playlist
el: Επεξεργασία λίστας αναπ/γής

# #587
source: Filter
el: Φίλτρο

# #588
source: Cancel party mode
el: Ακύρωση λειτουργίας party

# #589
source: Party mode
el: Λειτουργία party

# #590
source: Random
el: Τυχαίο

# #591
source: Off
el: Όχι

# #592
source: One
el: Ένα

# #593
source: All
el: Όλα

# #594
source: Off
el: Όχι

# #595
source: Repeat: Off
el: Επανάληψη: Όχι

# #596
source: Repeat: One
el: Επανάληψη: Το ίδιο

# #597
source: Repeat: All
el: Επανάληψη: Όλα

# #600
source: Rip audio CD
el: Αντιγραφή CD ήχου

# #601
source: Medium
el: Μεσαία

# #602
source: Standard
el: Κανονική

# #603
source: Extreme
el: Ακραία

# #604
source: Constant bitrate
el: Σταθερό bitrate

# #605
source: Ripping...
el: Αντιγραφή...

# #607
source: To:
el: Προς:

# #608
source: Could not rip CD or track
el: Αδυναμία αντιγραφής CD ή τραγουδιού

# #609
source: CDDARipPath is not set.
el: Δεν ορίσθηκε διαδρομή αντιγραφής CDDA.

# #610
source: Rip audio track
el: Αντιγραφή τραγουδιού

# #611
source: Enter number
el: Εισαγωγή αριθμού

# #612
source: Bits/sample
el: Bits/δείγμα

# #613
source: Sample rate
el: Ρυθμός δειγματοληψίας

# #614
source: Virtual folder
el: Εικονικός φάκελος

# #620
source: Audio CDs
el: CD ήχου

# #621
source: Encoder
el: Κωδικοποιητής

# #622
source: Quality
el: Ποιότητα

# #624
source: Include track number
el: Συμπερίληψη αριθμού τραγουδιού

# #625
source: All songs of
el: Όλα τα τραγούδια

# #626
source: In progress TV shows
el: Σειρές σε εξέλιξη

# #629
source: View mode
el: Τύπος Προβολής

# #630
source: Normal
el: Φυσιολογικό

# #631
source: Zoom
el: Μεγέθυνση

# #632
source: Stretch 4:3
el: Επέκταση 4:3

# #633
source: Wide Zoom
el: Ευρεία μεγέθυνση

# #634
source: Stretch 16:9
el: Επέκταση 16:9

# #635
source: Original Size
el: Κανονικό μέγεθος

# #636
source: Custom
el: Προσαρμογή

# #637
source: ReplayGain
el: Ενίσχυση Ήχου (ReplayGain)

# #638
source: ReplayGain volume adjustments
el: Προσαρμογή έντασης ενίσχυσης ήχου (ReplayGain)

# #639
source: Use track levels
el: Σε επίπεδο τραγουδιού

# #640
source: Use album levels
el: Σε επίπεδο άλμπουμ

# #641
source: PreAmp Level - ReplayGained files
el: Ένταση Προενισχυτή - Στα ήδη ενισχυμένα αρχεία

# #642
source: PreAmp Level - Non ReplayGained files
el: Ένταση Προενισχυτή - Στα μη ενισχυμένα αρχεία

# #643
source: Avoid clipping on ReplayGained files
el: Αποφυγή μείωσης της έντασης ενίσχυσης

# #644
source: Crop black bars
el: Αποκοπή μαύρων μπαρών

# #645
source: Need to unpack a big file. Continue?
el: Μεγάλο αρχείο προς αποσυμπίεση. Συνέχεια;

# #646
source: Remove from library
el: Αφαίρεση από τη συλλογή

# #647
source: Export video library
el: Εξαγωγή συλλογής βίντεο

# #648
source: Import video library
el: Εισαγωγή συλλογής βίντεο

# #649
source: Importing
el: Εισαγωγή

# #650
source: Exporting
el: Εξαγωγή

# #651
source: Browse for library
el: Αναζήτηση συλλογής

# #652
source: Years
el: Έτος

# #653
source: Update library
el: Ενημέρωση συλλογής

# #654
source: Show debug info
el: Επίδειξη σφαλμάτων

# #655
source: Browse for executable
el: Αναζήτηση εκτελέσιμου

# #656
source: Browse for playlist
el: Αναζήτηση λίστας αναπ/γής

# #657
source: Browse for folder
el: Αναζήτηση φακέλου

# #658
source: Song information
el: Πληροφορίες τραγουδιού

# #659
source: Non-linear stretch
el: Μη γραμμική παραμόρφωση

# #660
source: Volume amplification
el: Ενίσχυση έντασης

# #661
source: Choose export folder
el: Επιλογή φακέλου εξαγωγής

# #662
source: This file is no longer available.
el: Αυτό το αρχείο δεν είναι πλέον διαθέσιμο.

# #663
source: Would you like to remove it from the library?
el: Να αφαιρεθεί από τη συλλογή;

# #664
source: Browse for Script
el: Αναζήτηση Script

# #665
source: Compression level
el: Επίπεδο συμπίεσης

# #666
source: Verbose logging...
el: Αναλυτική καταγραφή...

# #667
source: Enable Dolby Digital transcoding
el: Ενεργοποίηση Διακωδικοποίησης Dolby Digital

# #700
source: Cleaning up library
el: Εκκαθάριση συλλογής

# #701
source: Removing old songs from the library
el: Απομάκρυνση παλαιών τραγουδιών από τη συλλογή

# #702
source: This path has been scanned before
el: Η διαδρομή έχει σαρωθεί παλαιότερα

# #705
source: Network
el: Δίκτυο

# #706
source: Server
el: Διακομιστής

# #708
source: Use an HTTP proxy server to access the internet
el: Χρήση διακομιστή μεσολάβησης HTTP για πρόσβαση στο Διαδίκτυο

# #711
source: Internet Protocol (IP)
el: Πρωτόκολλο Internet (IP)

# #712
source: Invalid port specified. Value must be between 1 and 65535.
el: Ορίστηκε λάθος θύρα. Η τιμή πρέπει να είναι μεταξύ 1 και 65535.

# #713
source: HTTP proxy
el: Διακομιστής μεσολάβησης HTTP

# #715
source: Assignment
el: Ανάθεση

# #716
source: Automatic (DHCP)
el: Αυτόματη (DHCP)

# #717
source: Manual (Static)
el: Χειροκίνητη (Στατική)

# #719
source: IP address
el: Διεύθυνση IP

# #720
source: Netmask
el: Μάσκα δικτύου

# #721
source: Default gateway
el: Προεπιλεγμένη πύλη

# #722
source: DNS server
el: Διακομιστής DNS

# #723
source: Save & restart
el: Αποθήκευση & επανεκκίνηση

# #724
source: Invalid address specified. Value must be AAA.BBB.CCC.DDD
el: Ορίστηκε λάθος διεύθυνση. Πρέπει να έχει τη μορφή AAA.BBB.CCC.DDD

# #725
source: with numbers between 0 and 255.
el: με τιμές μεταξύ 0 και 255.

# #726
source: Changes not saved. Continue without saving?
el: Οι αλλαγές δεν αποθηκεύτηκαν. Συνέχεια χωρίς αποθήκευση;

# #727
source: Web server
el: Διακομιστής Ιστού

# #728
source: FTP server
el: Διακομιστής FTP

# #730
source: Port
el: Θύρα

# #732
source: Save & apply
el: Αποθήκευση & εφαρμογή

# #733
source: Password
el: Κωδικός πρόσβασης

# #734
source: No pass
el: Χωρίς κωδικό

# #735
source: Character set
el: Κωδικοποίηση χαρακτήρων

# #736
source: Style
el: Στυλ

# #737
source: Colour
el: Χρώμα

# #738
source: Normal
el: Κανονικά

# #739
source: Bold
el: Έντονα

# #740
source: Italics
el: Πλάγια

# #741
source: Bold italics
el: Πλάγια έντονα

# #742
source: White
el: Λευκό

# #743
source: Yellow
el: Κίτρινο

# #744
source: Files
el: Αρχεία

# #745
source: No scanned information for this view
el: Καμία πληροφορία για αυτήν την προβολή

# #746
source: Please turn off library mode
el: Απενεργοποιήστε τη λειτουργία συλλογής

# #747
source: Error loading image
el: Σφάλμα κατά τη φόρτωση της εικόνας

# #748
source: Edit path
el: Επεξεργασία διαδρομής

# #749
source: Mirror image
el: Kατοπτρική εικόνα

# #750
source: Are you sure?
el: Είστε σίγουρος;

# #751
source: Removing source
el: Αφαίρεση πηγής

# #754
source: Add program link
el: Προσθήκη συνδέσμου εφαρμογής

# #755
source: Edit program path
el: Επεξεργασία διαδρομής εφαρμογής

# #756
source: Edit program name
el: Επεξεργασία ονόματος εφαρμογής

# #757
source: Edit path depth
el: Επεξεργασία βάθους διαδρομής

# #759
source: View: Big list
el: Προβολή: Μεγάλη λίστα

# #760
source: Yellow
el: Κίτρινο

# #761
source: White
el: Λευκό

# #762
source: Blue
el: Μπλε

# #763
source: Bright green
el: Έντονο πράσινο

# #764
source: Yellow green
el: Κιτρινοπράσινο

# #765
source: Cyan
el: Κυανό

# #766
source: Light grey
el: Ανοικτό γκρι

# #767
source: Grey
el: Γκρι

# #770
source: Error %i: share not available
el: Σφάλμα %i: ο κοινόχρηστος πόρος δεν είναι διαθέσιμος

# #772
source: Audio output
el: Έξοδος ήχου

# #773
source: Seeking
el: Αναζήτηση

# #774
source: Slideshow folder
el: Φάκελος παρουσίασης διαφανειών

# #775
source: Network interface
el: Διασύνδεση δικτύου

# #776
source: Wireless network name (ESSID)
el: Όνομα ασύρματου δικτύου (ESSID)

# #777
source: Wireless password
el: Κωδικός ασύρματου δικτύου

# #778
source: Wireless security
el: Ασφάλεια ασύρματου δικτύου

# #779
source: Save and apply network interface settings
el: Αποθήκευση και εφαρμογή των ρυθμίσεων διασύνδεσης

# #780
source: No encryption
el: Χωρίς κρυπτογράφηση

# #784
source: Applying network interface settings. Please wait.
el: Εφαρμογή των ρυθμίσεων διασύνδεσης δικτύου. Παρακαλώ περιμένετε.

# #785
source: Network interface restarted successfully.
el: Επιτυχής επανεκκίνηση της διασύνδεσης δικτύου.

# #786
source: Network interface did not start successfully.
el: Δεν ήταν επιτυχής η εκκίνηση της διασύνδεσης δικτύου.

# #787
source: Interface disabled
el: Απενεργοποίηση Διασύνδεσης

# #788
source: Network interface disabled successfully.
el: Η διασύνδεση δικτύου απενεργοποιήθηκε επιτυχώς.

# #789
source: Wireless network name (ESSID)
el: Όνομα ασύρματου δικτύου (ESSID)

# #790
source: Remote control
el: Τηλεχειριστήριο

# #791
source: Allow programs on this system to control Kodi
el: Έγκριση σε προγράμματα του συστήματος να ελέγχουν το Kodi

# #792
source: Port
el: Θύρα

# #793
source: Port range
el: Εύρος θυρών

# #794
source: Allow programs on other systems to control Kodi
el: Έγκριση σε προγράμματα άλλων συστημάτων να ελέγχουν το Kodi

# #795
source: Initial repeat delay (ms)
el: Αρχική καθυστέρηση (ms)

# #796
source: Continuous repeat delay (ms)
el: Συνεχής καθυστέρηση (ms)

# #797
source: Maximum number of clients
el: Μέγιστος αριθμός πελατών

# #798
source: Internet access
el: Πρόσβαση στο Διαδίκτυο

# #799
source: Library Update
el: Ενημέρωση Συλλογής

# #800
source: Music library needs to rescan tags from files.
el: Η μουσική συλλογή πρέπει να ξανασαρώσει για ετικέτες από τα αρχεία.

# #801
source: Would you like to scan now?
el: Να γίνει σάρωση τώρα;

# #850
source: Invalid port number entered
el: Εισαγωγή μη έγκυρης τιμής θύρας

# #851
source: Valid port range is 1-65535
el: Το έγκυρο εύρος θυρών είναι 1-65535

# #852
source: Valid port range is 1024-65535
el: Το έγκυρο εύρος θυρών είναι 1024-65535

# #997
source: Add Pictures...
el: Προσθήκη Εικόνων...

# #998
source: Add Music...
el: Προσθήκη Μουσικής...

# #999
source: Add Videos...
el: Προσθήκη Βίντεο...

# #1000
source: Preview
el: Προεπισκόπηση

# #1001
source: Unable to connect
el: Αδυναμία σύνδεσης

# #1002
source: Kodi was unable to connect to the network location.
el: Το Kodi δεν μπόρεσε να συνδεθεί στην τοποθεσία δικτύου.

# #1003
source: This could be due to the network not being connected.
el: Αυτό μπορεί να συνέβη διότι το δίκτυο δεν είναι συνδεδεμένο.

# #1004
source: Would you like to add it anyway?
el: Θέλετε παρ' όλα αυτά να το προσθέσετε;

# #1006
source: IP address
el: Διεύθυνση IP

# #1007
source: Add network location
el: Προσθήκη τοποθεσίας δικτύου

# #1008
source: Protocol
el: Πρωτόκολλο

# #1009
source: Server address
el: Διεύθυνση διακομιστή

# #1010
source: Server name
el: Όνομα διακομιστή

# #1011
source: Remote path
el: Απομακρυσμένη διαδρομή

# #1012
source: Shared folder
el: Κοινόχρηστος φάκελος

# #1013
source: Port
el: Θύρα

# #1014
source: Username
el: Όνομα χρήστη

# #1015
source: Browse for network server
el: Αναζήτηση δικτυακού διακομιστή

# #1016
source: Enter the network address of the server
el: Εισαγωγή της δικτυακής διεύθυνσης του διακομιστή

# #1017
source: Enter the path on the server
el: Εισαγωγή της διαδρομής του διακομιστή

# #1018
source: Enter the port number
el: Εισαγωγή του αριθμού θύρας

# #1019
source: Enter the username
el: Εισαγωγή του ονόματος χρήστη

# #1020
source: Add %s source
el: Προσθήκη πηγής %s

# #1021
source: Enter the paths or browse for the media locations.
el: Εισαγωγή διαδρομών ή αναζήτηση τοποθεσιών πολυμέσων.

# #1022
source: Enter a name for this media Source.
el: Εισαγωγή ονόματος για την πηγή πολυμέσων.

# #1023
source: Browse for new share
el: Αναζήτηση νέου κοινόχρηστου πόρου

# #1024
source: Browse
el: Αναζήτηση

# #1025
source: Could not retrieve directory information.
el: Δεν ήταν δυνατόν να ανακτηθούν οι πληροφορίες καταλόγου.

# #1026
source: Add source
el: Προσθήκη πηγής

# #1027
source: Edit source
el: Επεξεργασία πηγής

# #1028
source: Edit %s source
el: Επεξεργασία πηγής %s

# #1029
source: Enter the new label
el: Εισαγωγή νέας ετικέτας

# #1030
source: Browse for image
el: Αναζήτηση εικόνας

# #1031
source: Browse for image folder
el: Αναζήτηση φακέλου εικόνων

# #1032
source: Add network location...
el: Προσθήκη τοποθεσίας δικτύου...

# #1033
source: Browse for file
el: Αναζήτηση αρχείου

# #1034
source: Submenu
el: Υπομενού

# #1035
source: Enable submenu buttons
el: Ενεργοποίηση πλήκτρων υπομενού

# #1036
source: Favourites
el: Αγαπημένα

# #1037
source: Video Add-ons
el: Πρόσθετα Βίντεο

# #1038
source: Music Add-ons
el: Πρόσθετα Μουσικής

# #1039
source: Picture Add-ons
el: Πρόσθετα Εικόνας

# #1040
source: Loading directory
el: Φόρτωση φακέλου

# #1041
source: Retrieved %i items
el: Ανακτήθηκαν %i αντικείμενα

# #1042
source: Retrieved %i of %i items
el: Ανακτήθηκαν %i από τα %i αντικείμενα

# #1043
source: Program Add-ons
el: Πρόσθετες Εφαρμογές

# #1044
source: Set plug-in thumb
el: Ορισμός μικρογραφίας plug-in

# #1045
source: Add-on settings
el: Ρυθμίσεις πρόσθετου

# #1046
source: Access points
el: Σημεία πρόσβασης

# #1047
source: Other...
el: Άλλα...

# #1048
source: Username
el: Όνομα χρήστη

# #1049
source: Script settings
el: Ρυθμίσεις script

# #1050
source: Singles
el: Μεμονωμένα

# #1051
source: Enter web address
el: Εισαγωγή διεύθυνσης

# #1180
source: Proxy type
el: Τύπος διακομιστή μεσολάβησης (proxy)

# #1185
source: SOCKS5 with remote dns resolving
el: SOCKS5 με απομακρυσμένη επίλυση dns

# #1200
source: SMB client
el: Πελάτης SMB

# #1202
source: Workgroup
el: Ομάδα Εργασίας

# #1203
source: Default username
el: Προεπιλεγμένο όνομα χρήστη

# #1204
source: Default password
el: Προεπιλεγμένος κωδικός πρόσβασης

# #1207
source: WINS server
el: Διακομιστής WINS

# #1208
source: Mount SMB shares
el: Προσάρτηση κοινόχρηστων SMB

# #1210
source: Remove
el: Αφαίρεση

# #1211
source: Music
el: Μουσική

# #1212
source: Video
el: Βίντεο

# #1213
source: Pictures
el: Εικόνες

# #1214
source: Files
el: Αρχεία

# #1215
source: Music & video
el: Μουσική & βίντεο

# #1216
source: Music & pictures
el: Μουσική & εικόνες

# #1217
source: Music & files
el: Μουσική & αρχεία

# #1218
source: Video & pictures
el: Βίντεο & εικόνες

# #1219
source: Video & files
el: Βίντεο & αρχεία

# #1220
source: Pictures & files
el: Εικόνες & αρχεία

# #1221
source: Music & video & pictures
el: Μουσική & βίντεο & εικόνες

# #1222
source: Music & video & pictures & files
el: Μουσική & βίντεο & εικόνες & αρχεία

# #1223
source: Disabled
el: Ανενεργό/ή

# #1226
source: Files & music & video
el: Αρχεία & μουσική & βίντεο

# #1227
source: Files & pictures & music
el: Αρχεία & εικόνες & μουσική

# #1228
source: Files & pictures & video
el: Αρχεία & εικόνες & βίντεο

# #1229
source: Music & programs
el: Μουσική & εφαρμογές

# #1230
source: Video & programs
el: Βίντεο & εφαρμογές

# #1231
source: Pictures & programs
el: Εικόνες & εφαρμογές

# #1232
source: Music & video & pictures & programs
el: Μουσική & βίντεο & εικόνες & εφαρμογές

# #1233
source: Programs & video & music
el: Εφαρμογές & βίντεο & μουσική

# #1234
source: Programs & pictures & music
el: Εφαρμογές & εικόνες & μουσική

# #1235
source: Programs & pictures & video
el: Εφαρμογές & εικόνες & βίντεο

# #1260
source: Announce these services to other systems via Zeroconf
el: Αναγγελία αυτών των υπηρεσιών σε άλλα συστήματα μέσω του Zeroconf

# #1269
source: Allow volume control
el: Να επιτρέπεται έλεγχος της έντασης ήχου

# #1270
source: Allow Kodi to receive AirPlay content
el: Έγκριση στο Kodi να λαμβάνει περιεχόμενο AirPlay

# #1271
source: Device name
el: Όνομα συσκευής

# #1272
source: Use password protection
el: Χρήση προστασίας με κωδικό

# #1275
source: Filter %s
el: Φίλτρο %s

# #1300
source: Custom audio device
el: Ειδική συσκευή ήχου

# #1301
source: Custom passthrough device
el: Ειδική συσκευή διέλευσης

# #1396
source: Drifting
el: Μετακινούμενο

# #1397
source: and
el: και

# #1398
source: Freezing
el: Παγωνιά

# #1399
source: Late
el: Το βράδυ

# #1400
source: Isolated
el: Τοπικά

# #1401
source: Thundershowers
el: Μπόρες (με κεραυνούς)

# #1402
source: Thunder
el: Κεραυνοί

# #1403
source: Sun
el: Ήλιος

# #1404
source: Heavy
el: Έντονη

# #1405
source: in
el: μέσα

# #1406
source: the
el: στο

# #1407
source: Vicinity
el: Εγγύτητα

# #1408
source: Ice
el: Πάγος

# #1409
source: Crystals
el: Κρύσταλλοι

# #1410
source: Calm
el: Άπνοια

# #1411
source: with
el: με

# #1412
source: windy
el: θυελλώδης

# #1413
source: Patches
el: Σποραδικές

# #1414
source: Thunderstorm
el: Καταιγίδα

# #1415
source: Drizzle
el: Ασθενής βροχή

# #1416
source: Foggy
el: Ομιχλώδης

# #1417
source: Grains
el: Κόκκοι

# #1418
source: Thunderstorms
el: Καταιγίδες

# #1419
source: Shallow
el: Ρηχό

# #1420
source: Moderate
el: Ήπια

# #1421
source: Very High
el: Πολύ υψηλή

# #1422
source: Windy
el: Θυελλώδης

# #1423
source: Mist
el: Υγρά αχλή

# #1424
source: Overcast
el: Νεφελώδης

# #1425
source: Pellets
el: Χιονόνερο

# #1426
source: Hail
el: Χαλάζι

# #1427
source: Smoke
el: Καπνός

# #1428
source: Volcanic
el: Ηφαιστειακή

# #1429
source: Ash
el: Στάχτη

# #1430
source: Widespread
el: Εκτεταμένο

# #1431
source: Dust
el: Σκόνη

# #1432
source: Sand
el: Άμμος

# #1433
source: Spray
el: Ψιχάλα

# #1434
source: Whirls
el: Δίνες

# #1435
source: Sandstorm
el: Αμμοθύελλα

# #1436
source: Blowing
el: Άνεμος

# #1437
source: Pellet
el: Χιονόνερο

# #1438
source: Small
el: Μικρό

# #1439
source: and
el: και

# #1440
source: Sleet
el: Χιονόνερο

# #1441
source: with
el: με

# #1442
source: Chance
el: Πιθανότητα

# #1443
source: of
el: από

# #1444
source: Funnel
el: Χωνί

# #1445
source: Cloud
el: Σύννεφο

# #1446
source: Unknown
el: Άγνωστο

# #1447
source: Squals
el: Μπουρίνι

# #1448
source: Precipitation
el: Υετός

# #1449
source: Partial
el: Μερικώς

# #1450
source: Put display to sleep when idle
el: Απενεργοποίηση οθόνης κατά την αναμονή

# #2050
source: Runtime
el: Διάρκεια

# #2080
source: Empty list
el: Άδεια λίστα

# #2081
source: Went back to parent list because the active list has been emptied
el: Επιστροφή στην αρχική λίστα γιατί η ενεργή λίστα είναι άδεια

# #2100
source: Script failed! : %s
el: Αποτυχία script! : %s

# #2101
source: Newer version needed - See log
el: Απαιτείται νεώτερη έκδοση - Δείτε το αρχείο καταγραφής

# #10000
source: Home
el: Αρχική

# #10001
source: Programs
el: Εφαρμογές

# #10002
source: Pictures
el: Εικόνες

# #10003
source: File manager
el: Διαχείριση αρχείων

# #10004
source: Settings
el: Ρυθμίσεις

# #10005
source: Music
el: Μουσική

# #10006
source: Videos
el: Βίντεο

# #10007
source: System information
el: Πληροφορίες συστήματος

# #10008
source: Settings - General
el: Ρυθμίσεις - Γενικά

# #10009
source: Settings - Screen
el: Ρυθμίσεις - Οθόνη

# #10010
source: Settings - Appearance - GUI Calibration
el: Ρυθμίσεις - Εξατομίκευση - Βαθμονόμηση γραφικού περιβάλλοντος (GUI)

# #10011
source: Settings - Videos - Screen Calibration
el: Ρυθμίσεις - Βίντεο - Βαθμονόμηση Οθόνης

# #10012
source: Settings - Pictures
el: Ρυθμίσεις - Εικόνες

# #10013
source: Settings - Programs
el: Ρυθμίσεις - Εφαρμογές

# #10014
source: Settings - Weather
el: Ρυθμίσεις - Καιρός

# #10015
source: Settings - Music
el: Ρυθμίσεις - Μουσική

# #10016
source: Settings - System
el: Ρυθμίσεις - Σύστημα

# #10017
source: Settings - Videos
el: Ρυθμίσεις - Βίντεο

# #10018
source: Settings - Network
el: Ρυθμίσεις - Δίκτυο

# #10019
source: Settings - Appearance
el: Ρυθμίσεις - Εξατομίκευση

# #10020
source: Scripts
el: Script

# #10021
source: Web Browser
el: Περιηγητής Ιστού

# #10025
source: Videos
el: Βίντεο

# #10028
source: Videos/Playlist
el: Βίντεο/Λίστα Αναπ/γής

# #10029
source: Login screen
el: Οθόνη σύνδεσης

# #10034
source: Settings - Profiles
el: Ρυθμίσεις - Προφίλ

# #10035
source: Reset
el: Επαναφορά

# #10036
source: Basic
el: Βασικό

# #10037
source: Standard
el: Τυπική

# #10038
source: Advanced
el: Για Προχωρημένους

# #10039
source: Expert
el: Για Ειδικούς

# #10040
source: Add-on browser
el: Περιηγητής πρόσθετων

# #10041
source: Reset above settings to default
el: Επαναφορά των παραπάνω ρυθμίσεων στις προεπιλογές

# #10042
source: Are you sure you want to reset the settings in this category?
el: Είστε σίγουροι ότι επιθυμείτε να επαναφέρετε όλες τις ρυθμίσεις σε αυτήν την κατηγορία;

# #10043
source: Help
el: Βοήθεια

# #10044
source: No help available
el: Δεν υπάρχει διαθέσιμη βοήθεια

# #10045
source: Resets all the visible settings to their default values.
el: Θα επαναφέρει όλες τις ορατές ρυθμίσεις στις προεπιλεγμένες τιμές τους.

# #10046
source: No categories available
el: Δεν υπάρχουν διαθέσιμες κατηγορίες

# #10047
source: Try changing the setting level to see additional categories and settings.
el: Δοκιμάστε να αλλάξετε το επίπεδο ρυθμίσεων για να δείτε επιπλέον κατηγορίες και ρυθμίσεις.

# #10100
source: Yes/No dialogue
el: Παράθυρο Ναι/Οχι

# #10101
source: Progress dialogue
el: Παράθυρο εξέλιξης

# #10126
source: File browser
el: Περιήγηση αρχείων

# #10128
source: Network setup
el: Εγκατάσταση Δικτύου

# #10129
source: Media source
el: Πηγή πολυμέσων

# #10130
source: Profile settings
el: Ρυθμίσεις Προφίλ

# #10131
source: Lock settings
el: Κλείδωμα ρυθμίσεων

# #10132
source: Content settings
el: Ρυθμίσεις περιεχομένου

# #10134
source: Favourites
el: Αγαπημένα

# #10135
source: Songs/Info
el: Τραγούδια/Πληροφορίες

# #10136
source: Smart playlist editor
el: Επεξεργασία έξυπνης λίστας αναπ/γής

# #10137
source: Smart playlist rule editor
el: Επεξεργασία κανόνων έξυπνης λίστας αναπ/γής

# #10139
source: Pictures/Info
el: Εικόνες/Πληροφορίες

# #10140
source: Add-on settings
el: Ρυθμίσεις Πρόσθετου

# #10146
source: Add-ons/Info
el: Πρόσθετα/Πληροφορίες

# #10210
source: Looking for subtitles...
el: Αναζήτηση για υπότιτλους...

# #10211
source: Looking for or caching subtitles...
el: Προσωρινή αποθήκευση υποτίτλων...

# #10212
source: terminating
el: τερματισμός

# #10213
source: buffering
el: αποθήκευση

# #10214
source: Opening stream
el: Άνοιγμα ροής

# #10500
source: Music/Playlist
el: Μουσική/Λίστα Αναπ/γής

# #10501
source: Music/Files
el: Μουσική/Αρχεία

# #10502
source: Music/Library
el: Μουσική/Συλλογή

# #10503
source: Playlist editor
el: Επεξεργασία λίστας αναπ/γής

# #10504
source: Top 100 songs
el: 100 κορυφαία τραγούδια

# #10505
source: Top 100 albums
el: 100 κορυφαία άλμπουμ

# #10506
source: Programs
el: Εφαρμογές

# #10507
source: Configuration
el: Διαμόρφωση

# #10508
source: Weather forecast
el: Πρόγνωση καιρού

# #10509
source: Network gaming
el: Δικτυακό παιχνίδι

# #10510
source: Extensions
el: Επεκτάσεις

# #10511
source: System info
el: Πληροφορίες συστήματος
