Repository: xbmc/xbmc
Catalog: language/Greek/strings.po
Languages: el

# #0
source: Programs
el: Εφαρμογές

# #1
source: Pictures
el: Εικόνες

# #2
source: Music
el: Μουσική

# #3
source: Videos
el: Βίντεο

# #4
source: TV-Guide
el: Οδηγός τηλεόρασης

# #5
source: Settings
el: Ρυθμίσεις

# #7
source: File manager
el: Διαχείριση αρχείων

# #8
source: Weather
el: Καιρός

# #11
source: Monday
el: Δευτέρα

# #12
source: Tuesday
el: Τρίτη

# #13
source: Wednesday
el: Τετάρτη

# #14
source: Thursday
el: Πέμπτη

# #15
source: Friday
el: Παρασκευή

# #16
source: Saturday
el: Σάββατο

# #17
source: Sunday
el: Κυριακή

# #21
source: January
el: Ιανουαρίου

# #22
source: February
el: Φεβρουαρίου

# #23
source: March
el: Μαρτίου

# #24
source: April
el: Απριλίου

# #25
source: May
el: Μαΐου

# #26
source: June
el: Ιουνίου

# #27
source: July
el: Ιουλίου

# #28
source: August
el: Αυγούστου

# #29
source: September
el: Σεπτεμβρίου

# #30
source: October
el: Οκτωβρίου

# #31
source: November
el: Νοεμβρίου

# #32
source: December
el: Δεκεμβρίου

# #41
source: Mon
el: Δευ

# #42
source: Tue
el: Τρι

# #43
source: Wed
el: Τετ

# #44
source: Thu
el: Πεμ

# #45
source: Fri
el: Παρ

# #46
source: Sat
el: Σαβ

# #47
source: Sun
el: Κυρ

# #51
source: Jan
el: Ιαν

# #52
source: Feb
el: Φεβ

# #53
source: Mar
el: Μαρ

# #54
source: Apr
el: Απρ

# #55
source: May
el: Μάι

# #56
source: Jun
el: Ιουν

# #57
source: Jul
el: Ιουλ

# #58
source: Aug
el: Αυγ

# #59
source: Sep
el: Σεπ

# #60
source: Oct
el: Οκτ

# #61
source: Nov
el: Νοε

# #62
source: Dec
el: Δεκ

# #71
source: N
el: Β

# #72
source: NNE
el: ΒΒΑ

# #73
source: NE
el: ΒΑ

# #74
source: ENE
el: ΑΒΑ

# #75
source: E
el: Α

# #76
source: ESE
el: ΑΝΑ

# #77
source: SE
el: ΝΑ

# #78
source: SSE
el: ΝΝΑ

# #79
source: S
el: Ν

# #80
source: SSW
el: ΝΝΔ

# #81
source: SW
el: ΝΔ

# #82
source: WSW
el: ΔΝΔ

# #83
source: W
el: Δ

# #84
source: WNW
el: ΔΒΔ

# #85
source: NW
el: ΒΔ

# #86
source: NNW
el: ΒΒΔ

# #87
source: VAR
el: ΔΙΑΦ

# #88
source: South
el: Νότια

# #89
source: North
el: Βόρεια

# #90
source: West
el: Δυτικά

# #91
source: East
el: Ανατολικά

# #92
source: Variable
el: Μεταβλητός

# #98
source: View: Auto
el: Προβολή: Αυτόματη

# #99
source: View: Auto big
el: Προβολή: Εικόνες

# #100
source: View: Icons
el: Προβολή: Εικονίδια

# #101
source: View: List
el: Προβολή: Λίστα

# #102
source: Scan
el: Σάρωση

# #103
source: Sort by: Name
el: Ταξ.: Όνομα

# #104
source: Sort by: Date
el: Ταξ.: Ημ/νία

# #105
source: Sort by: Size
el: Ταξ.: Μέγεθος

# #106
source: No
el: Όχι

# #107
source: Yes
el: Ναι

# #108
source: Slideshow
el: Παρουσίαση διαφανειών

# #109
source: Create thumbs
el: Δημιουργία εικονιδίων

# #110
source: Create thumbnails
el: Δημιουργία μικρογραφιών

# #111
source: Shortcuts
el: Συντομεύσεις

# #112
source: Paused
el: Παύση

# #113
source: Update failed
el: Η ενημέρωση απέτυχε

# #114
source: Installation failed
el: Η εγκατάσταση απέτυχε

# #115
source: Copy
el: Αντιγραφή

# #116
source: Move
el: Μετακίνηση

# #117
source: Delete
el: Διαγραφή

# #118
source: Rename
el: Μετονομασία

# #119
source: New folder
el: Νέος φάκελος

# #120
source: Confirm file copy
el: Επιβεβαίωση αντιγραφής αρχείου

# #121
source: Confirm file move
el: Επιβεβαίωση μεταφοράς αρχείου

# #122
source: Confirm file delete?
el: Επιβεβαίωση διαγραφής;

# #123
source: Copy these files?
el: Αντιγραφή αυτών των αρχείων;

# #124
source: Move these files?
el: Μετακίνηση αυτών των αρχείων;

# #125
source: Delete these files? - Deleting files cannot be undone!
el: Διαγραφή αυτών των αρχείων; - Τα αρχεία σας θα διαγραφούν οριστικά!

# #126
source: Status
el: Κατάσταση

# #127
source: Objects
el: Αντικείμενα

# #128
source: General
el: Γενικά

# #129
source: Slideshow
el: Παρουσίαση διαφανειών

# #130
source: System info
el: Πληροφορίες συστήματος

# #131
source: Display
el: Απεικόνιση

# #132
source: Albums
el: Άλμπουμ

# #133
source: Artists
el: Καλλιτέχνες

# #134
source: Songs
el: Τραγούδια

# #135
source: Genres
el: Είδος

# #136
source: Playlists
el: Λίστες αναπ/γής

# #137
source: Search
el: Αναζήτηση

# #138
source: System Information
el: Πληροφορίες Συστήματος

# #139
source: Temperatures:
el: Θερμοκρασίες:

# #142
source: Time:
el: Ώρα:

# #143
source: Current:
el: Τρέχουσα:

# #144
source: Build:
el: Έκδοση:

# #145
source: Network:
el: Δίκτυο:

# #146
source: Type:
el: Τύπος:

# #147
source: Static
el: Στατική

# #149
source: MAC address
el: Διεύθυνση MAC

# #150
source: IP address
el: Διεύθυνση IP

# #151
source: Link:
el: Σύνδεσμος:

# #152
source: Half duplex
el: Μονόδρομη

# #153
source: Full duplex
el: Αμφίδρομη

# #154
source: Storage
el: Αποθήκευση

# #155
source: Drive
el: Δίσκος

# #156
source: Free
el: Ελεύθερος

# #157
source: Video
el: Βίντεο

# #158
source: Free memory
el: Ελεύθερη μνήμη

# #159
source: No link
el: Κανένας σύνδεσμος

# #160
source: Free
el: Ελεύθερα

# #161
source: Unavailable
el: Μη διαθέσιμο

# #162
source: Tray open
el: Θύρα δίσκου ανοικτή

# #163
source: Reading
el: Ανάγνωση

# #164
source: No disc
el: Δεν υπάρχει δίσκος

# #165
source: Disc present
el: Υπάρχει δίσκος

# #166
source: Skin
el: Κέλυφος

# #167
source: Cancel file operations
el: Ακύρωση λειτουργιών αρχείων

# #169
source: Resolution
el: Ανάλυση

# #170
source: Adjust display refresh rate to match video
el: Προσαρμογή του ρυθμού ανανέωσης για να ταιριάζει με το βίντεο

# #171
source: Sort title
el: Ταξ.: Τίτλος

# #172
source: Release date
el: Ημερομηνία κυκλοφορίας

# #173
source: Display 4:3 videos as
el: Προβολή των βίντεο με αναλογία 4:3 ως

# #175
source: Moods
el: Τάσεις

# #176
source: Styles
el: Στυλ

# #179
source: Song
el: Τραγούδι

# #180
source: Duration
el: Διάρκεια

# #181
source: Select album
el: Επιλογή άλμπουμ

# #182
source: Tracks
el: Κομμάτια

# #183
source: Review
el: Κριτική

# #184
source: Refresh
el: Ανανέωση

# #185
source: Searching album
el: Αναζήτηση άλμπουμ

# #186
source: OK
el: Εντάξει

# #187
source: No albums found!
el: Δε βρέθηκαν άλμπουμ!

# #188
source: Select all
el: Επιλογή όλων

# #189
source: Scanning media info
el: Σάρωση πληροφοριών

# #190
source: Save
el: Αποθήκευση

# #191
source: Shuffle
el: Τυχαία

# #192
source: Clear
el: Απαλοιφή

# #193
source: Scan
el: Σάρωση

# #194
source: Searching...
el: Αναζήτηση...

# #195
source: No info found!
el: Δε βρέθηκαν πληροφορίες!

# #196
source: Select movie:
el: Επιλογή ταινίας:

# #197
source: Querying %s info
el: Εύρεση πληροφοριών %s

# #198
source: Loading movie details
el: Φόρτωση πληροφοριών ταινίας

# #199
source: Web interface
el: Διασύνδεση ιστού

# #202
source: Tagline
el: Σλόγκαν

# #203
source: Plot outline
el: Περίληψη πλοκής

# #205
source: Votes
el: Ψήφοι

# #206
source: Cast
el: Διανομή ρόλων

# #207
source: Plot
el: Πλοκή

# #208
source: Play
el: Εκτέλεση

# #209
source: Next
el: Επόμενο

# #210
source: Previous
el: Προηγούμενο

# #213
source: Calibrate user interface...
el: Βαθμονόμηση οθόνης...

# #214
source: Video calibration...
el: Βαθμονόμηση βίντεο...

# #215
source: Soften
el: Απάλυνση εικόνας

# #216
source: Zoom amount
el: Ποσοστό μεγέθυνσης

# #217
source: Pixel ratio
el: Λόγος εικονοστοιχείων

# #218
source: DVD drive
el: Μονάδα DVD

# #219
source: Please insert disc
el: Παρακαλώ εισάγετε δίσκο

# #220
source: Remote share
el: Απομακρυσμένος κοινόχρηστος πόρος

# #221
source: Network is not connected
el: Το δίκτυο είναι αποσυνδεμένο

# #222
source: Cancel
el: Άκυρο

# #224
source: Speed
el: Ταχύτητα

# #225
source: Vertical Shift
el: Κατακόρυφη μετατόπιση

# #226
source: Test patterns...
el: Δοκιμή μοτίβων...

# #227
source: Lookup audio CD track names from freedb.org
el: Αναζήτηση ονομάτων μουσικών κομματιών από το freedb.org

# #228
source: Shuffle playlist on load
el: Ανακάτεμα λίστας αναπ/γής κατά τη φόρτωση

# #229
source: HDD spindown time
el: Χρόνος ελάττωσης περιστροφής (Spindown)

# #230
source: Video filters
el: Φίλτρα βίντεο

# #231
source: None
el: Κανένα

# #232
source: Point
el: Σημειακό

# #233
source: Linear
el: Γραμμικό

# #234
source: Anisotropic
el: Ανισοτροπικό

# #237
source: Minification
el: Σμίκρυνση

# #238
source: Magnification
el: Μεγέθυνση

# #239
source: Clear playlist on finish
el: Εκκαθάριση λίστας αναπ/γής στη λήξη

# #240
source: Display Mode
el: Λειτουργία Προβολής

# #241
source: Full Screen #%d
el: Πλήρης οθόνη #%d

# #242
source: Windowed
el: Σε παράθυρο

# #243
source: Refresh Rate
el: Ρυθμός Ανανέωσης

# #244
source: Full screen
el: Πλήρης οθόνη

# #245
source: Sizing: (%i,%i)->(%i,%i) (Zoom x%2.2f) AR:%2.2f:1 (Pixels: %2.2f:1) (VShift: %2.2f)
el: Μέγεθος: (%i,%i)->(%i,%i) (Ζουμ x%2.2f) AR:%2.2f:1 (Εικονοστοιχεία: %2.2f:1) (ΚΜετατόπιση: %2.2f)

# #247
source: Scripts
el: Script

# #248
source: Language
el: Γλώσσα

# #249
source: Music
el: Μουσική

# #250
source: Visualisation
el: Οπτικοποίηση

# #251
source: Select destination directory
el: Επιλογή φακέλου προορισμού

# #252
source: Stereo upmix
el: Στερεοφωνικό upmix

# #253
source: Number of channels
el: Αριθμός καναλιών

# #254
source: DTS capable receiver
el: Δέκτης με υποστήριξη DTS

# #256
source: Fetching CD information
el: Ανάκτηση πληροφοριών CD

# #257
source: Error
el: Σφάλμα

# #258
source: Enable tag reading
el: Ενεργοποίηση ετικετών ID3

# #259
source: Opening
el: Άνοιγμα

# #261
source: Waiting for start...
el: Αναμονή για την έναρξη...

# #262
source: Scripts output
el: Εξαγωγές Script

# #263
source: Allow control of Kodi via HTTP
el: Έγκριση ελέγχου του Kodi μέσω HTTP

# #264
source: Record
el: Εγγραφή

# #265
source: Stop Rec.
el: Διακοπή εγγραφής

# #266
source: Sort by: Track
el: Ταξ.: Τραγούδι

# #267
source: Sort by: Time
el: Ταξ.: Διάρκεια

# #268
source: Sort by: Title
el: Ταξ.: Τίτλος

# #269
source: Sort by: Artist
el: Ταξ.: Καλλιτέχνης

# #270
source: Sort by: Album
el: Ταξ.: Άλμπουμ

# #271
source: Top 100
el: 100 κορυφαία

# #272
source: Top-Left overscan compensation
el: Επάνω αριστερή προσαρμογή του ορατού πλαισίου

# #273
source: Bottom-Right overscan compensation
el: Κάτω δεξιά προσαρμογή του ορατού πλαισίου

# #274
source: Subtitle positioning
el: Θέση υποτίτλων

# #275
source: Pixel ratio adjustment
el: Ρύθμιση λόγου εικονοστοιχείων

# #276
source: Adjust the arrow to change the amount of overscan
el: Μετακινήστε το βέλος για να αλλάξετε το μέγεθος του ορατού πλαισίου

# #277
source: Adjust the bar to change the subtitles position
el: Μετακινήστε τη μπάρα για να αλλάξει η θέση των υποτίτλων

# #278
source: Adjust the rectangle so it is perfectly square
el: Αλλάξτε το σχήμα ώστε να είναι τέλειο τετράγωνο

# #279
source: Unable to load settings
el: Αδυναμία φόρτωσης των ρυθμίσεων

# #280
source: Using default settings
el: Χρήση προεπιλεγμένων ρυθμίσεων

# #281
source: Please check the XML files
el: Παρακαλώ ελέγξτε τα αρχεία XML

# #282
source: Found %i items
el: Βρέθηκαν %i αντικείμενα

# #283
source: Search results
el: Αποτελέσματα αναζήτησης

# #284
source: No results found
el: Δε βρέθηκαν αποτελέσματα

# #285
source: Preferred audio language
el: Προτιμώμενη γλώσσα ήχου

# #286
source: Preferred subtitle language
el: Προτιμώμενη γλώσσα υποτίτλων

# #287
source: Subtitles
el: Υπότιτλοι

# #288
source: Font
el: Γραμματοσειρά

# #289
source: Size
el: Μέγεθος

# #290
source: Dynamic range compression
el: Δυναμικό εύρος συμπίεσης

# #291
source: Video
el: Βίντεο

# #292
source: Audio
el: Ήχος

# #293
source: Browse for subtitles
el: Αναζήτηση για υπότιτλους

# #294
source: Create bookmark
el: Δημιουργία σελ/κτη

# #296
source: Clear bookmarks
el: Εκκαθάριση σελ/κτων

# #297
source: Audio offset
el: Καθυστέρηση ήχου

# #298
source: Bookmarks
el: Σελιδοδείκτες

# #300
source: MP1 capable receiver
el: Δέκτης με υποστήριξη MP1

# #301
source: MP2 capable receiver
el: Δέκτης με υποστήριξη MP2

# #302
source: MP3 capable receiver
el: Δέκτης με υποστήριξη MP3

# #303
source: Delay
el: Καθυστέρηση

# #304
source: Language
el: Γλώσσα

# #305
source: Enabled
el: Ενεργό/ή

# #308
source: Original stream's language
el: Αρχική γλώσσα ροής

# #309
source: User interface language
el: Γλώσσα περιβάλλοντος εργασίας

# #312
source: (0=auto)
el: (0=αυτόματα)

# #313
source: Cleaning database
el: Εκκαθάριση βάσης δεδομένων

# #314
source: Preparing...
el: Προετοιμασία...

# #315
source: Database error
el: Σφάλμα στη βάση δεδομένων

# #316
source: Searching songs...
el: Αναζήτηση τραγουδιών...

# #317
source: Cleaned database successfully
el: Επιτυχής εκκαθάριση της βάσης δεδομένων

# #318
source: Cleaning songs...
el: Εκκαθάριση τραγουδιών...

# #319
source: Error cleaning songs
el: Σφάλμα κατά την εκκαθάριση τραγουδιών

# #320
source: Cleaning artists...
el: Εκκαθάριση καλλιτεχνών...

# #321
source: Error cleaning artists
el: Σφάλμα κατά την εκκαθάριση καλλιτεχνών

# #322
source: Cleaning genres...
el: Εκκαθάριση ειδών...

# #323
source: Error cleaning genres
el: Σφάλμα κατά την εκκαθάριση ειδών

# #324
source: Cleaning paths...
el: Εκκαθάριση διαδρομών...

# #325
source: Error cleaning paths
el: Σφάλμα κατά την εκκαθάριση διαδρομών

# #326
source: Cleaning albums...
el: Εκκαθάριση άλμπουμ...

# #327
source: Error cleaning albums
el: Σφάλμα κατά την εκκαθάριση άλμπουμ

# #328
source: Writing changes...
el: Εγγραφή αλλαγών...

# #329
source: Error writing changes
el: Σφάλμα κατά την εγγραφή αλλαγών

# #330
source: This may take some time...
el: Αυτό ίσως πάρει λίγο χρόνο...

# #331
source: Compressing database...
el: Συμπίεση βάσης δεδομένων...

# #332
source: Error compressing database
el: Σφάλμα κατά την συμπίεση της βάσης δεδομένων

# #333
source: Do you want to clean the library?
el: Να γίνει εκκαθάριση της συλλογής;

# #334
source: Clean library...
el: Εκκαθάριση συλλογής...

# #335
source: Start
el: Έναρξη

# #336
source: Framerate conversion
el: Μετατροπή δειγματοληψίας

# #337
source: Output configuration
el: Διαμόρφωση εξόδου

# #338
source: Fixed
el: Σταθερή

# #339
source: Optimized
el: Βελτιστοποιημένο

# #340
source: Various artists
el: Διάφοροι καλλιτέχνες

# #341
source: Play disc
el: Έναρξη δίσκου

# #342
source: Movies
el: Ταινίες

# #343
source: Adjust framerate
el: Προσαρμογή δειγματοληψίας

# #344
source: Actors
el: Ηθοποιοί

# #345
source: Year
el: Έτος

# #346
source: Normalize levels on downmix
el: Εξισορρόπηση των επιπέδων κατά το downmix

# #347
source: DTS-HD capable receiver
el: Δέκτης με υποστήριξη DTS-HD

# #348
source: Enable passthrough
el: Ενεργοποίηση διέλευσης

# #349
source: TrueHD capable receiver
el: Δέκτης με υποστήριξη TrueHD

# #350
source: Programs
el: Εφαρμογές

# #351
source: Off
el: Ανενεργό/ή

# #352
source: Dim
el: Σκίαση

# #353
source: Black
el: Μαύρη οθόνη

# #354
source: Matrix trails
el: Ίχνη πλέγματος

# #355
source: Screensaver time
el: Χρόνος για προφύλαξη οθόνης

# #356
source: Screensaver mode
el: Λειτουργία προφύλαξης οθόνης

# #357
source: Shutdown function timer
el: Χρονοδιακόπτης τερματισμού

# #358
source: All albums
el: Όλα τα άλμπουμ

# #359
source: Recently added albums
el: Άλμπουμ που προστέθηκαν πρόσφατα

# #360
source: Screensaver
el: Προφύλαξη οθόνης

# #361
source: R. Slideshow
el: Παρουσίαση διαφανειών και των υποφακέλων

# #362
source: Screensaver dim level
el: Ποσοστό εξασθένησης της προφύλαξης οθόνης

# #363
source: Sort by: File
el: Ταξ.: Αρχείο

# #364
source: Dolby Digital (AC3) capable receiver
el: Δέκτης με υποστήριξη Dolby Digital (AC3)

# #365
source: Sort by: Name
el: Ταξ.: Όνομα

# #366
source: Sort by: Year
el: Ταξ.: Έτος

# #367
source: Sort by: Rating
el: Ταξ.: Αξιολόγηση

# #369
source: Title
el: Τίτλος

# #370
source: Thunderstorms
el: Καταιγίδες

# #371
source: Partly
el: Διάσπαρτα

# #372
source: Mostly
el: Κυρίως

# #373
source: Sunny
el: Ηλιοφάνεια

# #374
source: Cloudy
el: Νέφη

# #375
source: Snow
el: Χιόνι

# #376
source: Rain
el: Βροχή

# #377
source: Light
el: Ασθενής

# #378
source: AM
el: π.μ.

# #379
source: PM
el: μ.μ.

# #380
source: Showers
el: Μπόρες

# #381
source: Few
el: Λίγες

# #382
source: Scattered
el: Σποραδικά

# #383
source: Wind
el: Άνεμος

# #384
source: Strong
el: Δυνατός

# #385
source: Fair
el: Ήπιος

# #386
source: Clear
el: Αίθριος

# #387
source: Clouds
el: Νεφοσκεπής

# #388
source: Early
el: Τις πρώτες πρωινές ώρες

# #389
source: Shower
el: Μπόρα

# #390
source: Flurries
el: Ελαφρές χιονοπτώσεις

# #391
source: Low
el: Ελαχ.

# #392
source: Medium
el: Μεσ.

# #393
source: High
el: Μεγ.

# #394
source: Fog
el: Ομίχλη

# #395
source: Haze
el: Ξηρά αχλή

# #396
source: Select location
el: Επιλογή τοποθεσίας

# #397
source: Refresh time
el: Χρόνος ανανέωσης

# #398
source: Temperature units
el: Μονάδα θερμοκρασίας

# #399
source: Speed units
el: Μονάδα ταχύτητας

# #400
source: Weather
el: Ο Καιρός

# #401
source: Temp
el: Θερμοκρασία

# #402
source: Feels like
el: Αίσθηση ως

# #403
source: UV index
el: Δείκτης UV

# #404
source: Wind
el: Άνεμος

# #405
source: Dew point
el: Σημείο δρόσου

# #406
source: Humidity
el: Υγρασία

# #409
source: Defaults
el: Προεπιλογές

# #410
source: Accessing weather service
el: Πρόσβαση στην υπηρεσία καιρού

# #411
source: Getting weather for:
el: Ανάκτηση καιρού για:

# #412
source: Unable to get weather data
el: Αδυναμία λήψης δεδομένων καιρού

# #413
source: Manual
el: Χειροκίνητα

# #414
source: No review for this album
el: Καμιά κριτική για το άλμπουμ

# #415
source: Downloading thumbnail...
el: Λήψη μικρογραφίας...

# #416
source: Not available
el: Μη διαθέσιμος πόρος

# #417
source: View: Big icons
el: Προβολή: Μεγ. Εικονίδια

# #418
source: Low
el: Ελαχ.

# #419
source: High
el: Μεγ.

# #420
source: Best Match
el: Καλύτερη Αντιστοιχία

# #421
source: Keep audio device alive
el: Διατήρηση της συσκευής ήχου ενεργής

# #422
source: Delete album info
el: Διαγραφή πληροφοριών άλμπουμ

# #423
source: Delete CD information
el: Διαγραφή πληροφοριών CD

# #424
source: Select
el: Επιλογή

# #425
source: No album information found
el: Δε βρέθηκαν πληροφορίες για το άλμπουμ

# #426
source: No CD information found
el: Δε βρέθηκαν πληροφορίες για το CD

# #427
source: Disc
el: Δίσκος

# #428
source: Insert correct CD/DVD
el: Εισάγετε το σωστό CD/DVD

# #429
source: Please insert the following disc:
el: Εισάγετε τον ακόλουθο δίσκο:

# #430
source: Sort by: DVD#
el: Ταξ.: DVD#

# #431
source: No cache
el: Καθόλου λανθάνουσα μνήμη

# #432
source: Remove movie from library
el: Διαγραφή ταινίας από τη συλλογή

# #433
source: Really remove '%s'?
el: Να διαγραφεί '%s';

# #434
source: From %s at %i %s
el: Από %s με ένταση %i %s

# #435
source: No optical disc drive detected
el: Δεν εντοπίστηκε μονάδα οπτικού δίσκου

# #436
source: You need an optical disc drive to play this video
el: Απαιτείται μονάδα οπτικού δίσκου για να αναπαραχθεί αυτό το βίντεο

# #437
source: Removable disk
el: Αφαιρούμενος δίσκος

# #438
source: Opening file
el: Άνοιγμα αρχείου

# #439
source: Cache
el: Λανθάνουσα μνήμη

# #440
source: Hard disk
el: Σκληρός δίσκος

# #442
source: Local network
el: Τοπικό δίκτυο

# #443
source: Internet
el: Διαδίκτυο

# #444
source: Video
el: Βίντεο

# #445
source: Audio
el: Ήχος

# #447
source: Autorun media
el: Αυτόματη εκτέλεση πολυμέσων

# #448
source: Dolby Digital Plus (E-AC3) capable receiver
el: Δέκτης με υποστήριξη Dolby Digital Plus (E-AC3)

# #449
source: Enabled
el: Ενεργό/ή

# #450
source: Columns
el: Στήλες

# #451
source: Row 1 address
el: Διεύθυνση 1ης γραμμής

# #452
source: Row 2 address
el: Διεύθυνση 2ης γραμμής

# #453
source: Row 3 address
el: Διεύθυνση 3ης γραμμής

# #454
source: Row 4 address
el: Διεύθυνση 4ης γραμμής

# #455
source: Rows
el: Γραμμές

# #456
source: Mode
el: Μέθοδος

# #457
source: Switch view
el: Αλλαγή προβολής

# #458
source: Limit sampling rate (kHz)
el: Όριο ρυθμού δειγματοληψίας (kHz)

# #459
source: Subs
el: Υπότιτλοι

# #460
source: Audio stream
el: Ηχητική ροή

# #461
source: [active]
el: [ενεργό]

# #462
source: Subtitle
el: Υπότιτλος

# #463
source: Backlight
el: Οπίσθιος φωτισμός

# #464
source: Brightness
el: Φωτεινότητα

# #465
source: Contrast
el: Αντίθεση

# #466
source: Gamma
el: Συντελεστής γάμμα

# #467
source: Type
el: Τύπος

# #468
source: Move the bar to change the OSD position
el: Μετακινήστε τη μπάρα για αλλαγή της θέσης των απεικονίσεων οθόνης (OSD)

# #469
source: OSD position
el: Θέση απεικονίσεων οθόνης (OSD)

# #470
source: Credits
el: Συντελεστές

# #474
source: Off
el: Ανενεργό/ή

# #475
source: Music only
el: Μουσική μόνο

# #476
source: Music & video
el: Μουσική & βίντεο

# #477
source: Unable to load playlist
el: Αδυναμία φόρτωσης της λίστας αναπ/γής

# #478
source: OSD
el: Aπεικονίσεις οθόνης (OSD)

# #479
source: Skin & language
el: Κέλυφος & γλώσσα

# #480
source: Appearance
el: Εξατομίκευση

# #481
source: Audio options
el: Ιδιότητες ήχου

# #482
source: About Kodi
el: Περί Kodi

# #485
source: Delete album
el: Διαγραφή άλμπουμ

# #486
source: Repeat
el: Επανάληψη

# #487
source: Repeat one
el: Επανάληψη του ίδιου

# #488
source: Repeat folder
el: Επανάληψη φακέλου

# #489
source: Play the next song automatically
el: Αυτόματη αναπαραγωγή επόμενου κομματιού

# #491
source: - Use big icons
el: - Χρήση Μεγ. εικονιδίων

# #492
source: Resize VobSubs
el: Μεγέθυνση υποτίτλων

# #493
source: Advanced options (Experts Only!)
el: Ρυθμίσεις για προχωρημένους!

# #494
source: Overall audio headroom
el: Εύρος στάθμης γενικού ήχου

# #495
source: Upsample videos to GUI resolution
el: Αύξηση δειγματοληψίας ανάλυσης σε αυτή του γραφικού περιβάλλοντος (GUI)

# #496
source: Calibration
el: Βαθμονόμηση

# #497
source: Show file extensions
el: Εμφάνιση επεκτάσεων αρχείων

# #498
source: Sort by: Type
el: Ταξ.: Τύπος

# #499
source: Unable to connect to online lookup service
el: Αδυναμία σύνδεσης στην υπηρεσία έρευνας

# #500
source: Downloading album information failed
el: Απέτυχε η λήψη των πληροφοριών άλμπουμ

# #501
source: Looking for album names...
el: Αναζήτηση για ονόματα άλμπουμ...

# #502
source: Open
el: Άνοιγμα

# #503
source: Busy
el: Απασχολημένο

# #504
source: Empty
el: Κενός

# #505
source: Loading media info from files...
el: Φόρτωση πληροφοριών πολυμέσων...

# #507
source: Sort by: Usage
el: Ταξ.: Χρήση

# #510
source: Enable visualisations
el: Ενεργοποίηση οπτικοποιήσεων

# #511
source: Enable video mode switching
el: Ενεργοποίηση εναλλαγής λειτουργίας βίντεο

# #512
source: Startup window
el: Παράθυρο εκκίνησης

# #513
source: Home window
el: Αρχική οθόνη

# #514
source: Manual settings
el: Χειροκίνητες ρυθμίσεις

# #515
source: Genre
el: Είδος

# #517
source: Recently played albums
el: Πρόσφατα αναπαραχθέντα άλμπουμ

# #518
source: Launch
el: Εκκίνηση

# #519
source: Launch in...
el: Εκκίνηση σε...

# #521
source: Compilations
el: Συνθέσεις

# #522
source: Remove source
el: Αφαίρεση πηγής

# #523
source: Switch media
el: Εναλλαγή πολυμέσων

# #524
source: Select playlist
el: Επιλογή λίστας αναπ/γής

# #525
source: New playlist...
el: Νέα λίστα αναπ/γής...

# #526
source: Add to playlist
el: Προσθήκη στη λίστα αναπ/γής

# #527
source: Manually add to library
el: Χειροκίνητη προσθήκη στη συλλογή

# #528
source: Enter title
el: Εισάγετε τίτλο

# #529
source: Error: Duplicate title
el: Σφάλμα: Διπλότυπος τίτλος

# #530
source: Select genre
el: Επιλογή είδους

# #531
source: New genre
el: Νέο είδος

# #532
source: Manual addition
el: Χειροκίνητη προσθήκη

# #533
source: Enter genre
el: Εισαγωγή είδους

# #534
source: View: %s
el: Προβολή: %s

# #535
source: List
el: Λίστα

# #536
source: Icons
el: Εικονίδια

# #537
source: Big list
el: Μεγάλη λίστα

# #538
source: Big icons
el: Μεγ. Εικονίδια

# #539
source: Wide
el: Ευρεία

# #540
source: Big wide
el: Πολύ ευρεία

# #541
source: Album icons
el: Εικον. άλμπουμ

# #542
source: DVD icons
el: Εικον. DVD

# #544
source: Media info
el: Πληροφορίες Πολυμέσων

# #545
source: Audio output device
el: Συσκευή εξόδου ήχου

# #546
source: Passthrough output device
el: Συσκευή εξόδου διέλευσης

# #547
source: No biography for this artist
el: Δεν υπάρχει βιογραφία γι' αυτόν τον καλλιτέχνη
