Repository: xbmc/xbmc
Catalog: language/Greek/strings.po
Languages: el

# #36217
source: Scan for missing channel icons.
el: Σάρωση για εικονίδια καναλιών που λείπουν.

# #36218
source: Category for electronic programming guide settings.
el: Κατηγορία με ρυθμίσεις οδηγού τηλεοπτικού προγράμματος (EPG)

# #36219
source: Default electronic programming guide window to show.
el: Προεπιλεγμένο παράθυρο οδηγού τηλεοπτικού προγράμματος (EPG).

# #36220
source: Number of days of EPG data to import from backends.
el: Πλήθος ημερών δεδομένων EPG για τις οποίες θα γίνει εισαγωγή από τα backend.

# #36221
source: Time between EPG data imports from backends.
el: Χρονικό διάστημα ανάμεσα στις εισαγωγές δεδομένων EPG από τα backend.

# #36222
source: Do not import EPG data while playing TV to minimise CPU usage.
el: Να μη γίνεται εισαγωγή δεδομένων EPG κατά την αναπαραγωγή τηλεόρασης για να περιοριστεί η χρήση του επεξεργαστή.

# #36223
source: By default, EPG data is stored in a local database to speed up importing when Kodi is restarted.
el: Ως προεπιλογή, τα δεδομένα EPG αποθηκεύονται σε μια τοπική βάση δεδομένων προκειμένου να γίνεται ταχύτερη εισαγωγή τους κατά την έναρξη του Kodi.

# #36224
source: Hide "no information available" labels when no EPG data can be retrieved for a channel.
el: Απόκρυψη των ετικετών "Μη διαθέσιμες πληροφορίες" όταν δεν είναι δυνατό να ανακτηθούν δεδομένα EPG για ένα κανάλι.

# #36225
source: Delete the EPG database in Kodi and reimport the data afterwards from the backend.
el: Διαγραφή της βάσης δεδομένων EPG στο Kodi και εισαγωγή τους εκ νέου από το backend.

# #36226
source: Category for PVR playback and channel switching settings.
el: Κατηγορία με ρυθμίσεις αναπαραγωγής PVR και αλλαγής καναλιών

# #36227
source: Display stream of selected channel in a small box instead of fullscreen.
el: Προβολή ροής του επιλεγμένου καναλιού σε μικρό παράθυρο αντί για πλήρη οθόνη.

# #36228
source: Continue with the last viewed channel on startup.
el: Συνέχιση στο τελευταίο κανάλι κατά την εκκίνηση.

# #36229
source: Display signal quality information in the codec information window (if supported by the Add-on and backend).
el: Εμφάνιση πληροφοριών ποιότητας σήματος στο παράθυρο πληροφοριών κωδικοποίησης (αν υποστηρίζεται από το Πρόσθετο και το backend).

# #36230
source: How long Kodi will wait to change the channel if the channel isn't being received. Useful for over-the-air channels that occasionally lose signal strength.
el: Πόσο θα αναμένει το Kodi προτού αλλάξει το κανάλι όταν δεν υπάρχει σήμα. Χρήσιμο για κανάλια που τείνει να πέφτει το σήμα τους.

# #36231
source: Pressing a number button in full screen mode will automatically switch to the channel number that was entered after 1 second.
el: Πιέζοντας ένα αριθμητικό πλήκτρο σε πλήρη οθόνη θα γίνει αυτόματα μετάβαση στον αριθμό του καναλιού που πιέστηκε, μετά από 1 δευτερόλεπτο.

# #36232
source: When pressing channel up or down, the actual channel switch is delayed, allowing the user to flip to a channel number without waiting for each channel switch.
el: Κατά την πίεση ΠΑΝΩ ή ΚΑΤΩ καθυστερεί η αλλαγή του καναλιού, επιτρέποντας στο χρήστη να μεταβεί σε ένα κανάλι με πίεση του αριθμού, χωρίς να περιμένει την αλλαγή.

# #36233
source: Category for default recording duration settings.
el: Κατηγορία με ρυθμίσεις προεπιλεγμένης διάρκειας εγγραφής.

# #36234
source: Duration of instant recordings when pressing the record button.
el: Διάρκεια της άμεσης εγγραφής κατά την πίεση του πλήκτρου εγγραφής.

# #36235
source: Priority of the recording. Higher number means higher priority. Not supported by all Add-ons and backends.
el: Προτεραιότητα της εγγραφής. Μεγαλύτερος αριθμός δείχνει μεγαλύτερη προτεραιότητα. Δεν υποστηρίζεται από όλα τα Πρόσθετα και τα backend.

# #36236
source: Delete recording after this time. Not supported by all Add-ons and backends.
el: Διαγραφή της εγγραφής μετά από αυτό το χρόνο. Δεν υποστηρίζεται από όλα τα Πρόσθετα και τα backend.

# #36237
source: Start recordings before the actual time. Not supported by all Add-ons and backends.
el: Έναρξη εγγραφών πριν από την ακριβή ώρα. Δεν υποστηρίζεται από όλα τα Πρόσθετα και τα backend.

# #36238
source: End recordings after the actual time. Not supported by all Add-ons and backends.
el: Διακοπή εγγραφών μετά από την ακριβή ώρα. Δεν υποστηρίζεται από όλα τα Πρόσθετα και τα backend.

# #36239
source: Display a notification when timers are added, finished or removed by the backend.
el: Εμφάνιση ειδοποίησης κατά την προσθήκη, ολοκλήρωση ή αφαίρεση χρονοδιακοπτών από το backend.

# #36240
source: Category for PVR power management settings, such as when to wake the PVR backend server.
el: Κατηγορία με ρυθμίσεις διαχείρισης ενέργειας PVR, όπως το πότε να αφυπνίζεται το backend του PVR.

# #36241
source: Execute the "wakeup command" below when Kodi exits or is going into hibernation mode. The timestamp of the next scheduled recording is passed as parameter.
el: Εκτέλεση της κάτωθι "εντολής αφύπνισης" κατά την έξοδο από το Kodi ή όταν μπαίνει σε λειτουργία αδρανοποίησης. Η χρονική σήμανση της επόμενης προγραμματισμένης εγγραφής περνιέται σαν παράμετρος.

# #36242
source: The command will not be executed when a recording will be started within this timeout.
el: Η εντολή δε θα εκτελείται αν επακολουθεί εγγραφή εντός αυτού του χρονικού διαστήματος.

# #36243
source: The command to execute.
el: Η εντολή που θα εκτελεστεί.

# #36244
source: Time to subtract from the start time of the next scheduled recording.
el: Χρόνος που θα αφαιρείται από την ώρα έναρξης της επόμενης προγραμματισμένης εγγραφής.

# #36245
source: Execute the wakeup command every day at the given time.
el: Εκτέλεση της εντολής αφύπνισης κάθε μέρα στη συγκεκριμένη ώρα.

# #36246
source: When to execute the daily wakeup command.
el: Πότε να εκτελείται η καθημερινή εντολή αφύπνισης.

# #36247
source: Category for parental control settings if the PVR backend server supports parental controls.
el: Κατηγορία με ρυθμίσεις γονικού ελέγχου, αν υποστηρίζονται από το backend του PVR.

# #36248
source: Asks for a pin code to access parental locked channels. Channels can be marked as locked in the channels editor on the general tab. Parental locked channels can not be played or recorded without entering a pin code, and the EPG information is hidden for those channels.
el: Ζητείται ένας κωδικός PIN προκειμένου να δίνεται πρόσβαση σε κανάλια με γονικό κλείδωμα. Τα κανάλια μπορούν να σημειώνονται ως κλειδωμένα στην επεξεργασία καναλιών στην καρτέλα 'Γενικά'. Αυτά τα κλειδωμένα κανάλια δεν μπορούν να αναπαραχθούν/εγγραφούν χωρίς την εισαγωγή του κωδικού PIN, και οι πληροφορίες EPG δεν εμφανίζονται για αυτά.

# #36249
source: Enter a new pin code to unlock parental locked channels.
el: Εισαγωγή νέου κωδικού PIN για ξεκλείδωμα καναλιών γονικού ελέγχου.

# #36250
source: Ask for the pin code again when trying to access a parental locked channel and the code hasn't been asked for this duration.
el: Να ξαναζητείται ο κωδικός PIN όταν γίνεται προσπάθεια πρόσβασης σε κλειδωμένο κανάλι και δεν έχει ζητηθεί για αυτό το χρονικό διάστημα.

# #36251
source: Category for any specific settings for your PVR backend, if the PVR backend supports changing those settings in Kodi.
el: Κατηγορία με συγκεκριμένες ρυθμίσεις για το backend του PVR, αν υποστηρίζεται από αυτό η αλλαγή τους μέσω του Kodi.

# #36252
source: This option will bring you to any specific settings for your PVR backend, if the PVR backend supports changing those settings in Kodi.
el: Αυτή η επιλογή περιέχει συγκεκριμένες ρυθμίσεις για το backend του PVR, αν υποστηρίζεται από αυτό η αλλαγή τους μέσω του Kodi.

# #36253
source: Section that contains settings related to music files and how they are handled.
el: Τμήμα με ρυθμίσεις σχετικά με μουσικά αρχεία και το χειρισμό τους.

# #36254
source: Enable the music library.
el: Ενεργοποίηση της μουσικής συλλογής.

# #36255
source: Determine if artists that appear only on compilations are shown in the library artist view.
el: Προσδιορισμός του αν οι καλλιτέχνες που είναι μόνο σε μίξεις θα εμφανίζονται και στη συλλογή καλλιτεχνών.

# #36256
source: Automatically fetch album and artist information via scrapers during scan.
el: Αυτόματη λήψη πληροφοριών άλμπουμ και καλλιτέχνη μέσω scraper κατά τη σάρωση.

# #36257
source: Select the default album information source.
el: Επιλογή της προεπιλεγμένης πηγής πληροφοριών άλμπουμ.

# #36258
source: Select the default artist information source. See the Add-ons Manager for options.
el: Επιλογή της προεπιλεγμένης πηγής πληροφοριών καλλιτεχνών. Δείτε τη Διαχείριση Πρόσθετων για επιλογές.

# #36259
source: Check for new and removed media files on Kodi startup.
el: Έλεγχος για αρχεία πολυμέσων που προστέθηκαν και αφαιρέθηκαν κατά την εκκίνηση του Kodi.

# #36260
source: No info available yet.
el: Μη διαθέσιμες πληροφορίες.

# #36262
source: Export the Music Library database to XML files. This will optionally overwrite your current XML files.
el: Εξαγωγή της βάσης δεδομένων της Μουσικής Συλλογής σε αρχεία XML. Αυτό θα αντικαταστήσει κατ' επιλογή τα παρόντα αρχεία XML.

# #36263
source: Import a XML file into the Music Library database.
el: Εισαγωγή ενός αρχείου XML στη βάση δεδομένων της Μουσικής Συλλογής.

# #36264
source: Category containing settings for how music playback is handled.
el: Κατηγορία με ρυθμίσεις σχετικά με το χειρισμό της αναπαραγωγής μουσικής.

# #36265
source: Kodi automatically plays the next item in the current folder. For example, in Files View: After a track has been played, Kodi would automatically play the next track in the same folder.
el: Το Kodi αναπαραγάγει αυτόματα το επόμενο αντικείμενο στον τρέχοντα φάκελο. Για παράδειγμα, στην Προβολή Αρχείων: Μετά την αναπαραγωγή ενός τραγουδιού, το Kodi θα αναπαραγάγει αυτόματα το επόμενο κομμάτι στον ίδιο φάκελο.

# #36266
source: When songs are selected they are queued instead of playback starting immediately.
el: Όταν επιλέγονται τραγούδια, μπαίνουν σε αναμονή αντί να αναπαράγονται άμεσα.

# #36267
source: Kodi will read the ReplayGain information encoded in your audio files by a program such as MP3Gain and normalise the sound levels accordingly.
el: Το Kodi θα διαβάσει τις πληροφορίες Ενίσχυσης Ήχου (ReplayGain) που είναι κωδικοποιημένες στα μουσικά αρχεία από προγράμματα όπως το MP3Gain, και θα εξομαλύνουν αναλόγως την ένταση του ήχου.

# #36268
source: Default is 89dB per standard. Change with caution.
el: Προεπιλογή είναι τα 89dB ανά πρότυπο. Απαιτείται προσοχή κατά την αλλαγή.

# #36269
source: Default is 89dB per standard. Change with caution.
el: Προεπιλογή είναι τα 89dB ανά πρότυπο. Απαιτείται προσοχή κατά την αλλαγή.

# #36270
source: Reduce the volume of the file if clipping will occur.
el: Μείωση της έντασης του ήχου αν είναι να οδηγήσει σε φαινόμενα αποκοπής (clipping).

# #36271
source: Smoothly fade from one audio track to the next. You can set the amount of overlap from 1-15 seconds.
el: Ομαλή εξασθένιση κατά τη μετάβαση από το ένα τραγούδι στο επόμενο. Μπορείτε να ορίσετε το χρόνο μετάβασης μεταξύ 1-15 δευτερόλεπτα.

# #36272
source: Allow crossfading to occur when both tracks are from the same album.
el: Να επιτρέπεται βαθμιαία εξασθένιση όταν και τα δύο κομμάτια είναι από το ίδιο άλμπουμ.

# #36273
source: Select the visualisation that will be displayed while listening to music.
el: Επιλογή της οπτικοποίησης που θα προβάλλεται κατά την ακρόαση μουσικής.

# #36274
source: Read the tag information from song files. For large directories this can slow down read time, especially over a network.
el: Ανάγνωση των πληροφοριών των ετικετών από τα αρχεία μουσικής. Αυτό μπορεί να επιβραδύνει το χρόνο ανάγνωσης σε μεγάλους φακέλους, ειδικά όταν είναι σε δίκτυο.

# #36275
source: Control the way that the names of songs are displayed in the user interface. In order to function properly, tag reading needs to be enabled.
el: Έλεγχος του τρόπου με τον οποίο εμφανίζονται οι τίτλοι τραγουδιών στο περιβάλλον εργασίας. Για να λειτουργήσει σωστά πρέπει να είναι ενεργή η ανάγνωση ετικετών.

# #36276
source: Used for formatting the second column in file lists.
el: Χρησιμοποιείται για τη μορφοποίηση της δεύτερης στήλης στις λίστες αρχείων.

# #36277
source: Control the way that the names of songs are displayed in the now playing list.
el: Έλεγχος του τρόπου με τον οποίο εμφανίζονται οι τίτλοι τραγουδιών στη λίστα 'Τώρα Εκτελείται'.

# #36278
source: Used for formatting the second column in the now playing list.
el: Χρησιμοποιείται για τη μορφοποίηση της δεύτερης στήλης στη λίστα 'Τώρα Εκτελείται'.

# #36279
source: Control the way that the names of songs are displayed in library lists.
el: Έλεγχος του τρόπου με τον οποίο εμφανίζονται οι τίτλοι τραγουδιών στις λίστες συλλογών.

# #36280
source: Used for formatting the second column in library lists.
el: Χρησιμοποιείται για τη μορφοποίηση της δεύτερης στήλης στις λίστες συλλογής.

# #36281
source: Kodi will search for thumbs on remote shares and optical media. This can often slow down the listing of network folders.
el: Το Kodi θα αναζητήσει μικρογραφίες σε απομακρυσμένα κοινόχρηστα και οπτικά μέσα. Αυτό ενδέχεται να επιβραδύνει την καταχώριση δικτυακών φακέλων.

# #36282
source: Category containing settings for how CDs are handled.
el: Κατηγορία με ρυθμίσεις σχετικά με το χειρισμό CD.

# #36283
source: Autorun CDs when inserted in drive.
el: Αυτόματη εκτέλεση CD κατά την εισαγωγή του.

# #36284
source: Read the information belonging to an audio CD from an internet database.
el: Ανάγνωση των πληροφοριών που ανήκουν σε ένα CD ήχου από διαδικτυακή βάση δεδομένων.

# #36285
source: Select the location on your hard drive where ripped tracks will be saved to.
el: Επιλογή της τοποθεσίας στο σκληρό σας δίσκο όπου θα αποθηκεύονται τα αντιγραμμένα από CD κομμάτια.

# #36286
source: Control how saved music is named from the tags. Tags: [B]%N[/B]: TrackNumber, [B]%S[/B]: DiscNumber, [B]%A[/B]: Artist, [B]%T[/B]: Title, [B]%B[/B]: Album, [B]%G[/B]: Genre, [B]%Y[/B]: Year, [B]%F[/B]: FileName, [B]%D[/B]: Duration, [B]%J[/B]: Date, [B]%R[/B]: Rating, [B]%I[/B]: FileSize.
el: Έλεγχος της ονομασίας αποθηκευμένων τραγουδιών από τις ετικέτες. Ετικέτες: [B]%N[/B]: ΑριθμόςΚομματιού, [B]%S[/B]: ΑριθμόςΔίσκου, [B]%A[/B]: Καλλιτέχνης, [B]%T[/B]: Τίτλος, [B]%B[/B]: Άλμπουμ, [B]%G[/B]: Είδος, [B]%Y[/B]: Έτος, [B]%F[/B]: ΌνομαΑρχείου, [B]%D[/B]: Διάρκεια, [B]%J[/B]: Ημερομηνία, [B]%R[/B]: Αξιολόγηση, [B]%I[/B]: ΜέγεθοςΑρχείου.

# #36287
source: Select which audio encoder to use when ripping.
el: Επιλογή του ηχητικού κωδικοποιητή που θα χρησιμοποιηθεί για την αντιγραφή κομματιών από CD.

# #36288
source: Select which quality you want to rip your files.
el: Επιλογή της ποιότητας αντιγραφής της μουσικής.

# #36289
source: Select which bitrate to use for the specified audio encoder for audio compression.
el: Επιλογή του bitrate που θα χρησιμοποιείται για τη συγκεκριμένη κωδικοποίηση ήχου κατά τη συμπίεση μουσικής.

# #36290
source: For FLAC define compression level, default 5.
el: Ορισμός επιπέδου συμπίεσης για FLAC, προεπιλογή είναι το 5.

# #36291
source: Auto eject disc after rip is complete.
el: Αυτόματη εξαγωγή δίσκου όταν ολοκληρωθεί η αντιγραφή.

# #36292
source: Category containing the settings for how karaoke is handled.
el: Κατηγορία με ρυθμίσεις σχετικά με το χειρισμό καραόκε.

# #36293
source: When playing any music file, Kodi will look for a matching .cdg file and display its graphics.
el: Κατά την αναπαραγωγή οποιουδήποτε αρχείου μουσικής, το Kodi θα αναζητήσει το αντίστοιχο αρχείο .cdg προκειμένου να προβάλλει τα γραφικά του.

# #36294
source: Show song selection dialog once the last song in the queue has been played.
el: Προβολή παραθύρου επιλογής τραγουδιού όταν αναπαραχθεί και το τελευταίο τραγούδι στην αναμονή.

# #36295
source: Select the font type used during karaoke.
el: Επιλογή του τύπου της γραμματοσειράς που θα χρησιμοποιείται στο καραόκε.

# #36296
source: Select the size of the font used during karaoke.
el: Επιλογή του μεγέθους της γραμματοσειράς που θα χρησιμοποιείται στο καραόκε.

# #36297
source: Select the font colour used during karaoke.
el: Επιλογή του χρώματος της γραμματοσειράς που θα χρησιμοποιείται στο καραόκε.

# #36298
source: Select the character set used during karaoke.
el: Επιλογή της κωδικοποίησης χαρακτήρων που θα χρησιμοποιείται στο καραόκε.

# #36299
source: Export the karaoke numbered songs to HTML or CSV files.
el: Εξαγωγή των αριθμημένων τραγουδιών καραόκε σε αρχεία HTML ή CSV.

# #36300
source: Import the karaoke numbered songs from HTML or CSV files.
el: Εισαγωγή των αριθμημένων τραγουδιών καραόκε από αρχεία HTML ή CSV.

# #36301
source: No info available yet.
el: Μη διαθέσιμες πληροφορίες.

# #36302
source: No info available yet.
el: Μη διαθέσιμες πληροφορίες.

# #36303
source: No info available yet.
el: Μη διαθέσιμες πληροφορίες.

# #36304
source: Section that contains settings related to pictures and how they are handled.
el: Τμήμα με ρυθμίσεις σχετικά με εικόνες και το χειρισμό τους.

# #36305
source: Category containing settings for how picture file lists are handled.
el: Κατηγορία με ρυθμίσεις σχετικά με το χειρισμό λιστών αρχείων εικόνων.

# #36306
source: If EXIF information exists (date, time, camera used, etc.), it will be displayed.
el: Αν υπάρχουν πληροφορίες EXIF (ημερομηνία, ώρα, φωτ. μηχανή που χρησιμοποιήθηκε, κτλ.), θα εμφανίζονται.

# #36307
source: Automatically generate picture thumbnails when entering picture folder.
el: Αυτόματη δημιουργία μικρογραφιών εικόνων κατά την είσοδο στο φάκελο εικόνων.

# #36308
source: Pictures will automatically rotate according to information in the EXIF tag, if found.
el: Οι εικόνες θα εναλλάσσονται αυτόματα σύμφωνα με τις πληροφορίες της ετικέτας EXIF, αν βρεθεί.

# #36309
source: Show videos in picture file lists.
el: Εμφάνιση βίντεο στις λίστες αρχείων εικόνων.

# #36310
source: No info available yet.
el: Μη διαθέσιμες πληροφορίες.

# #36311
source: Category containing settings for how picture slideshows are handled.
el: Κατηγορία με ρυθμίσεις σχετικά με το χειρισμό παρουσιάσεων διαφανειών.

# #36312
source: Select the amount of time that each image is displayed in a slideshow.
el: Επιλογή του χρόνου εμφάνισης της κάθε εικόνας στην παρουσίαση διαφανειών.

# #36313
source: Images in a slideshow will pan and zoom while displayed.
el: Οι εικόνες σε μια παρουσίαση διαφανειών θα υπόκεινται προσαρμογή των αναλογιών σήματος (pan & zoom) κατά την προβολή τους.

# #36314
source: View slideshow images in a random order.
el: Εμφάνιση εικόνων με τυχαία σειρά στην παρουσίαση διαφανειών.

# #36315
source: Section that contains weather related settings.
el: Τμήμα με ρυθμίσεις σχετικά με τον καιρό.

# #36316
source: Category containing settings for how weather addons are handled.
el: Κατηγορία με ρυθμίσεις σχετικά με το χειρισμό πρόσθετων καιρού.

# #36317
source: Select up to three locations for which the weather can be displayed.
el: Επιλογή τριών τοποθεσιών για τις οποίες θα εμφανίζεται ο καιρός.

# #36318
source: Specify the default weather information source. See the Add-ons Manager for options.
el: Καθορίστε την προεπιλεγμένη πηγή πληροφοριών για τον Καιρό. Δείτε τη Διαχείριση Πρόσθετων για επιλογές.

# #36319
source: Section containing settings for how network services are handled.
el: Τμήμα με ρυθμίσεις σχετικά με το χειρισμό υπηρεσιών δικτύου.

# #36320
source: Category containing settings used for all services.
el: Κατηγορία με ρυθμίσεις για όλες τις υπηρεσίες.

# #36321
source: Display name of the Kodi installation when using various network services.
el: Όνομα της εγκατάστασης του Kodi όταν χρησιμοποιούνται διάφορες δικτυακές υπηρεσίες.

# #36322
source: Category containing settings for how the UPnP service is handled.
el: Κατηγορία με ρυθμίσεις σχετικά με το χειρισμό της υπηρεσίας UPnP.

# #36323
source: Enable the UPnP server. This allows you to stream media to a UPnP client.
el: Ενεργοποίηση του διακομιστή UPnP. Σας επιτρέπει να μεταφορτώσετε πολυμέσα σε έναν πελάτη UPnP.

# #36324
source: When a manual or automatical library update occurs, notify UPnP clients.
el: Όταν γίνεται αυτόματη ή χειροκίνητη ενημέρωση της συλλογής, να ειδοποιούνται οι πελάτες UPnP.

# #36325
source: Enable the UPnP client. This allows you to stream media from any UPnP server with a control point and control playback from that server.
el: Ενεργοποίηση του πελάτη UPnP. Σας επιτρέπει να μεταφορτώσετε πολυμέσα από κάθε πελάτη UPnP με σημείο ελέγχου, και σας δίνει τον έλεγχο αναπαραγωγής από εκείνο το διακομιστή.

# #36326
source: Enable the UPnP control point. This allows you to stream media to any UPnP client and control playback from Kodi.
el: Ενεργοποίηση του πελάτη UPnP. Σας επιτρέπει να μεταφορτώσετε πολυμέσα σε κάθε πελάτη UPnP, και σας δίνει τον έλεγχο αναπαραγωγής από το Kodi.

# #36327
source: Category containing settings for how the webserver service is handled.
el: Κατηγορία με ρυθμίσεις σχετικά με το χειρισμό της υπηρεσίας διακομιστή ιστού.

# #36328
source: Enable remote users to control Kodi through the built-in webserver.
el: Να επιτρέπεται σε απομακρυσμένους χρήστες να ελέγχουν το Kodi διαμέσου του ενσωματωμένου διακομιστή ιστού.

# #36329
source: Define the webserver port.
el: Ορισμός της θύρας του διακομιστή ιστού.

# #36330
source: Define the webserver username.
el: Ορισμός του ονόματος χρήστη του διακομιστή ιστού.

# #36331
source: Define the webserver password.
el: Ορισμός του κωδικού του διακομιστή ιστού.

# #36332
source: Select between web interfaces installed via the Add-on Manager.
el: Επιλογή μεταξύ των διασυνδέσεων ιστού που εγκαταστάθηκαν μέσω της Διαχείρισης Πρόσθετων.

# #36333
source: Category containing settings for how the remote control service is handled.
el: Κατηγορία με ρυθμίσεις σχετικά με το χειρισμό της υπηρεσίας τηλεχειρισμού.

# #36334
source: Allow programs on this computer to control Kodi via the Web Interface or the JSON-RPC interface protocol.
el: Να επιτρέπεται προγράμματα αυτού του υπολογιστή να ελέγχουν το Kodi διαμέσου της Διασύνδεσης Ιστού ή του πρωτοκόλλου διεπαφής JSON-RPC.

# #36335
source: Define the remote control port.
el: Ορισμός θύρας για το τηλεχειριστήριο.

# #36336
source: Define the remote control port range.
el: Ορισμός ενός εύρους θυρών για το τηλεχειριστήριο.

# #36337
source: Define the maximum number of clients that can connect.
el: Ορισμός του μέγιστου πλήθους πελατών που μπορούν να συνδεθούν.

# #36338
source: Allow programs on the network to control Kodi.
el: Να επιτρέπεται προγράμματα του δικτύου να ελέγχουν το Kodi.

# #36339
source: Initial repeat delay (ms).
el: Αρχική καθυστέρηση (ms).

# #36340
source: Continuous repeat delay (ms).
el: Συνεχής καθυστέρηση (ms).

# #36341
source: Category containing settings for how the zeroconf network discovery service is handled, required for AirPlay.
el: Κατηγορία με ρυθμίσεις σχετικά με το χειρισμό του εντοπισμού δικτύου zeroconf, που απαιτείται για το AirPlay.

# #36342
source: Allows applications on the network to discover Kodi's running services.
el: Επιτρέπει σε εφαρμογές εντός του δικτύου να εντοπίζουν τρέχουσες υπηρεσίες του Kodi.

# #36343
source: Allows Kodi to receive content from other AirPlay devices or applications.
el: Επιτρέπει στο Kodi να λαμβάνει περιεχόμενο από άλλες συσκευές ή εφαρμογές AirPlay.

# #36344
source: Enable AirPlay password protection.
el: Ενεργοποίηση προστασίας με κωδικό για το AirPlay.

# #36345
source: Sets the AirPlay password.
el: Ορισμός του κωδικού για το AirPlay.

# #36346
source: Category containing settings for how the SMB Client (samba) service is handled.
el: Κατηγορία με ρυθμίσεις σχετικά με το χειρισμό της υπηρεσίας Πελάτη SMB (samba).

# #36347
source: If a WINS server is running on the network, enter its IP address here. Otherwise, leave blank.
el: Αν υπάρχει διακομιστής WINS στο δίκτυο, εισαγάγετε τη διεύθυνση IP του. Διαφορετικά, αφήστε το κενό.
