Repository: xbmc/xbmc
Catalog: language/Greek/strings.po
Languages: el

# #36348
source: If a WINS server is running on the network, enter its workgroup name here. Otherwise, leave blank.
el: Αν υπάρχει διακομιστής WINS στο δίκτυο, εισαγάγετε την Ομάδα Εργασίας του. Διαφορετικά, αφήστε το κενό.

# #36349
source: Section that contains the System related settings for the device Kodi is installed on.
el: Τμήμα με ρυθμίσεις σχετικά με το Σύστημα της συσκευής στην οποία είναι εγκατεστημένο το Kodi.

# #36350
source: Automatically send 'Wake-On-Lan' to server(s) right before trying to access shared files or services.
el: Αυτόματη αποστολή πακέτων "Wake-On-Lan" στους διακομιστές λίγο πριν τη μετάβαση σε κοινόχρηστα αρχεία ή υπηρεσίες.

# #36351
source: Display Kodi in a window, or fullscreen on the selected screen.
el: Προβολή του Kodi σε παράθυρο ή σε πλήρη οθόνη, στην επιλεγμένη οθόνη.

# #36352
source: Changes the resolution that the user interface is displayed in.
el: Αλλαγή της ανάλυσης του περιβάλλοντος εργασίας.

# #36353
source: Changes the refresh rate that the user interface is displayed in.
el: Αλλαγή του ρυθμού ανανέωσης του περιβάλλοντος εργασίας.

# #36354
source: Display Kodi in a fullscreen window. The main benefit is for multi-screen configurations, so that Kodi can be used without minimising other applications. This uses more resources so playback may be less smooth.
el: Προβολή του Kodi σε μεγιστοποιημένο παράθυρο. Το μεγαλύτερο όφελος είναι για συστήματα με πολλαπλές οθόνες, ούτως ώστε το Kodi να μπορεί να χρησιμοποιηθεί χωρίς να απαιτείται αυτόματη ελαχιστοποίηση άλλων εφαρμογών. Αξιοποιεί περισσότερους πόρους συνεπώς η αναπαραγωγή ενδέχεται να είναι λιγότερο ομαλή.

# #36355
source: In a multi-screen configuration, the screens where Kodi is not displayed are blacked out.
el: Σε ένα σύστημα πολλαπλών οθονών, οι οθόνες όπου δεν προβάλλεται το Kodi θα είναι αμαυρωμένες.

# #36356
source: Eliminate vertical tearing.
el: Εξάλειψη φαινομένων σπασίματος της εικόνας (vertical tearing).

# #36357
source: Calibrate the user interface by adjusting the overscan. Use this tool if the image being displayed is too large or small for your display.
el: Βαθμονόμηση του περιβάλλοντος εργασίας με ρύθμιση του ορατού πλαισίου. Χρησιμοποιήστε αυτό το εργαλείο εάν η εικόνα είναι πολύ μεγάλη ή μικρή για την οθόνη.

# #36358
source: Test patterns for display hardware calibration.
el: Δοκιμαστικά μοτίβα για βαθμονόμηση της οθόνης.

# #36359
source: Use limited colour range (16-235) instead of full colour range (0-255). Limited range should be used if your display is a regular HDMI TV and doesn't have a PC or other mode to display full range colour, however if your display is a PC monitor then leave this disabled to get proper blacks.
el: Χρήση περιορισμένου χρωματικού εύρους (16-235) αντί πλήρους (0-255). Προτείνεται αν η οθόνη σας είναι μια απλή τηλεόραση με HDMI η οποία δεν υποστηρίζει σύνδεση με υπολογιστή ή κάτι παρόμοιο, ούτως ώστε να προβάλλει όλα τα χρώματα. Αν πρόκειται για οθόνη υπολογιστή, αφήστε το απενεργοποιημένο για καλύτερη απόδοση του μαύρου.

# #36360
source: Category containing settings for how audio output is handled.
el: Κατηγορία με ρυθμίσεις σχετικά με το χειρισμό της εξόδου ήχου.

# #36361
source: Select how the properties of the audio output are set: [Fixed] - output properties are set to the specified sampling rate & speaker configuration at all times; [Best Match] - output properties are set to always be as close a match to the source properties as possible; [Optimized] - output properties are set at the start of playback and will not change if the properties of the source changes.
el: Επιλογή της μεθόδου ορισμού των ιδιοτήτων της εξόδου ήχου: [Σταθερή] - οι ιδιότητες της εξόδου ορίζονται πάντα στον καθορισμένο ρυθμό δειγματοληψίας & τη διαμόρφωση των ηχείων. [Καλύτερη Αντιστοιχία] - οι ιδιότητες της εξόδου ορίζονται πάντα να είναι κατά το δυνατόν πιο κοντά στις ιδιότητες της πηγής. [Βελτιστοποιημένο] - οι ιδιότητες της εξόδου ορίζονται κατά την έναρξη της αναπαραγωγής, και δεν αλλάζουν ακόμα και αν αλλάξουν οι ιδιότητες της πηγής.

# #36362
source: Select the number of channels supported by the audio connection, or the number of speakers if connected by analog connections. This setting does not apply to passthrough audio. Note - SPDIF supports 2.0 channels only but can still output multichannel audio using a format supported by passthrough.
el: Επιλογή του αριθμού των καναλιών που υποστηρίζονται από τη σύνδεση του ήχου, ή του πλήθους των ηχείων αν είναι αναλογική σύνδεση. Αυτή η ρύθμιση δεν εφαρμόζεται στη διέλευση ήχου. Σημείωση - το SPDIF υποστηρίζει μόνο ήχο 2.0 καναλιών, αλλά μπορεί, παρ'όλα αυτά, να αποδίδει πολυκάναλο χρησιμοποιώντας μορφοποίηση που υποστηρίζεται από τη διέλευση.

# #36363
source: Boost AC3 streams that have been downmixed to 2 channels.
el: Ενίσχυση των ροών AC3 που έχουν υποστεί downmix σε 2 κανάλια.

# #36364
source: Select to enable upmixing of 2 channel audio to the number of audio channels specified by the channel configuration.
el: Επιλογή για να γίνεται upmix του 2-κάναλου ήχου στο πλήθος των καναλιών ήχου που ορίζεται από τη διαμόρφωση των καναλιών.

# #36365
source: Select this option if your receiver is capable of decoding AC3 streams.
el: Επιλογή αυτής της ρύθμισης αν ο δέκτης σας υποστηρίζει αποκωδικοποίηση ροών AC3.

# #36366
source: Select this option if your receiver is capable of decoding DTS streams.
el: Επιλογή αυτής της ρύθμισης αν ο δέκτης σας υποστηρίζει αποκωδικοποίηση ροών DTS.

# #36367
source: Select the maximum number of audio channels/speakers available for audio decoded. If optical/coax digital outputs are used this must be set to 2.0
el: Επιλογή του μέγιστου αριθμού ηχητικών καναλιών/ηχείων διαθέσιμων για την αποκωδικοποίηση ήχου. Εάν χρησιμοποιούνται οπτικές/coax έξοδοι αυτό θα πρέπει να οριστεί ως 2.0

# #36368
source: Select to enable the passthrough audio options for playback of encoded audio such as Dolby Digital.
el: Επιλογή για ενεργοποίηση των επιλογών ήχου της διέλευσης για αναπαραγωγή κωδικοποιημένου ήχου όπως το Dolby Digital.

# #36369
source: Select this option if your receiver is capable of decoding TrueHD streams.
el: Επιλογή αυτής της ρύθμισης αν ο δέκτης σας υποστηρίζει αποκωδικοποίηση ροών TrueHD.

# #36370
source: Select this option if your receiver is capable of decoding DTS-HD streams.
el: Επιλογή αυτής της ρύθμισης αν ο δέκτης σας υποστηρίζει αποκωδικοποίηση ροών DTS-HD.

# #36371
source: Select the device to be used for playback of audio that has been decoded such as mp3.
el: Επιλέξτε τη συσκευή που θα χρησιμοποιηθεί για αναπαραγωγή ήχου που έχει αποκωδικοποιηθεί όπως mp3.

# #36372
source: Select the device to be used for playback of encoded formats, these are any of the formats below in the 'capable receiver' options.
el: Επιλογή της συσκευής για αναπαραγωγή κωδικοποιημένων μορφών, όπως όλα εκείνες παρακάτω στις επιλογές 'δέκτης με υποστήριξη'.

# #36373
source: Configure how interface sounds are handled, such as menu navigation and important notifications.
el: Διαμόρφωση του τρόπου χειρισμού των ήχων του περιβάλλοντος εργασίας, όπως των ήχων πλοήγησης και σημαντικών ειδοποιήσεων.

# #36374
source: Category containing settings for how input devices are handled.
el: Κατηγορία με ρυθμίσεις σχετικά με το χειρισμό συσκευών εισόδου.

# #36375
source: Configure any attached peripheral devices.
el: Διαμόρφωση όλων των συνδεδεμένων περιφερειακών συσκευών.

# #36376
source: When activated, your keyboard arrows will move the selection on the virtual keyboard. When deactivated, they will move the cursor from your text.
el: Αν ενεργοποιηθεί, τα πλήκτρα κατεύθυνσης θα μετακινούν το δείκτη επάνω στο εικονικό πληκτρολόγιο. Αν απενεργοποιηθεί, θα μετακινούν τον κέρσορα του κειμένου.

# #36377
source: Use a mouse or touch screen device to control Kodi. Note: disabling will cause you to lose control over Kodi when no keyboard or remote is present.
el: Χρήση ποντικιού ή συσκευής οθόνης αφής για έλεγχο του Kodi. Σημείωση: αν το απενεργοποιήσετε ενώ δεν υπάρχει πληκτρολόγιο ή χειριστήριο, θα χάσετε τον έλεγχο του Kodi.

# #36378
source: Use a joystick to control Kodi.
el: Χρήση ενός χειριστηρίου για έλεγχο του Kodi.

# #36379
source: Category containing settings for internet access.
el: Κατηγορία με ρυθμίσεις σχετικά με το διαδίκτυο.

# #36380
source: If your internet connection uses a proxy, configure it here.
el: Αν η διαδικτυακή σας σύνδεση χρησιμοποιεί διακομιστή μεσολάβησης, διαμορφώστε τον εδώ.

# #36381
source: Configure which proxy type is used.
el: Διαμόρφωση του τύπου διακομιστή μεσολάβησης που χρησιμοποιείται.

# #36382
source: Configure the proxy server address.
el: Διαμόρφωση της διεύθυνσης του διακομιστή μεσολάβησης.

# #36383
source: Configure the proxy server port.
el: Διαμόρφωση της θύρας του διακομιστή μεσολάβησης.

# #36384
source: Configure the proxy server username.
el: Διαμόρφωση του ονόματος χρήστη του διακομιστή μεσολάβησης.

# #36385
source: Configure the proxy server password.
el: Διαμόρφωση του κωδικού του διακομιστή μεσολάβησης.

# #36386
source: If you have limited bandwidth available, Kodi will try to keep within these limits.
el: Αν έχετε περιορισμένη ταχύτητα διαδικτύου, το Kodi θα προσπαθήσει να διατηρηθεί εντός αυτών των ορίων.

# #36387
source: Category containing settings for power saving.
el: Κατηγορία με ρυθμίσεις σχετικά με την εξοικονόμηση ενέργειας.

# #36388
source: Turn off display when idle. Useful for TVs that turn off when there is no display signal detected.
el: Σβήσιμο της οθόνης κατά την αδράνεια. Χρήσιμο για τηλεοράσεις που σβήνουν όταν δεν εντοπιστεί σήμα.

# #36389
source: Define how long Kodi should idle before shutting down.
el: Προσδιορισμός του χρόνου αδράνειας του Kodi προτού γίνει τερματισμός.

# #36390
source: Define what action Kodi should do when it has been idle for a long period of time.
el: Προσδιορισμός των ενεργειών του Kodi όταν έχει παραμείνει αδρανές για μεγάλο χρονικό διάστημα.

# #36391
source: Category containing settings for debugging functions.
el: Κατηγορία με ρυθμίσεις σχετικά με τον εντοπισμό σφαλμάτων.

# #36392
source: Turn debug logging on or off. Useful for troubleshooting.
el: (Απ)Ενεργοποίηση του αρχείου καταγραφής εντοπισμού σφαλμάτων. Χρήσιμο για αντιμετώπιση προβλημάτων.

# #36393
source: Folder used to save screenshots taken within Kodi.
el: Ο φάκελος όπου θα αποθηκεύονται στιγμιότυπα οθόνης εντός του Kodi.

# #36394
source: Specify additional libraries to be included in the debug log.
el: Καθορίστε τις συλλογές που θα περιληφθούν στην καταγραφή εντοπισμού σφαλμάτων.

# #36395
source: Category containing settings for the master lock function.
el: Κατηγορία με ρυθμίσεις σχετικά με το κεντρικό κλείδωμα.

# #36396
source: Define the PIN code used for the master lock.
el: Ορισμός του κωδικού PIN που θα χρησιμοποιείται για το κεντρικό κλείδωμα.

# #36397
source: If enabled, the master lock code is required to unlock Kodi on startup.
el: Αν ενεργοποιηθεί, θα απαιτείται ο κωδικός κεντρικού κλειδώματος κατά την εκκίνηση του Kodi.

# #36398
source: Define the maximum number of retries before Kodi is closed down.
el: Ορισμός του μέγιστου πλήθους προσπαθειών πριν το Kodi κλείσει.

# #36399
source: Category containing settings for the cache function.
el: Κατηγορία με ρυθμίσεις σχετικά με τη λανθάνουσα μνήμη.

# #36400
source: Enable cache for playback of Video, Audio or DVDs from hard disk.
el: Ενεργοποίηση της λανθάνουσας μνήμης για αναπαραγωγή Βίντεο, Μουσικής ή DVD από σκληρό δίσκο.

# #36401
source: Enable cache for playback of Video from DVD-ROM.
el: Ενεργοποίηση της λανθάνουσας μνήμης για αναπαραγωγή Βίντεο από DVD-ROM.

# #36402
source: Enable cache for Video playback from Local Network.
el: Ενεργοποίηση της λανθάνουσας μνήμης για αναπαραγωγή Βίντεο από το Τοπικό Δίκτυο.

# #36403
source: Enable cache for Video playback from Internet.
el: Ενεργοποίηση της λανθάνουσας μνήμης για αναπαραγωγή Βίντεο από το Διαδίκτυο.

# #36404
source: Enable cache for playback of Audio from DVD-ROM.
el: Ενεργοποίηση της λανθάνουσας μνήμης για αναπαραγωγή Μουσικής από DVD-ROM.

# #36405
source: Enable cache for Audio playback from Local Network.
el: Ενεργοποίηση της λανθάνουσας μνήμης για αναπαραγωγή Μουσικής από το Τοπικό Δίκτυο.

# #36406
source: Enable cache for Audio playback from Internet.
el: Ενεργοποίηση της λανθάνουσας μνήμης για αναπαραγωγή Μουσικής από το Διαδίκτυο.

# #36407
source: Enable cache for playback of DVD from DVD-ROM.
el: Ενεργοποίηση της λανθάνουσας μνήμης για αναπαραγωγή DVD από DVD-ROM.

# #36408
source: Enable cache for DVD playback from Local Network.
el: Ενεργοποίηση της λανθάνουσας μνήμης για αναπαραγωγή DVD από το Τοπικό Δίκτυο.

# #36409
source: Enable cache of unknown types from Internet.
el: Ενεργοποίηση της λανθάνουσας μνήμης για αναπαραγωγή άγνωστων τύπων από το Διαδίκτυο.

# #36410
source: No info available yet.
el: Μη διαθέσιμες πληροφορίες.

# #36411
source: No info available yet.
el: Μη διαθέσιμες πληροφορίες.

# #36412
source: No info available yet.
el: Μη διαθέσιμες πληροφορίες.

# #36413
source: No info available yet.
el: Μη διαθέσιμες πληροφορίες.

# #36414
source: No info available yet.
el: Μη διαθέσιμες πληροφορίες.

# #36415
source: No info available yet.
el: Μη διαθέσιμες πληροφορίες.

# #36416
source: Specify the type of remote used.
el: Καθορίστε τον τύπο χειριστηρίου που χρησιμοποιείτε.

# #36417
source: Always run an Kodi helper so that the remote can be used to start Kodi.
el: Να τρέχει πάντα ένα πρόγραμμα για να μπορεί να χρησιμοποιηθεί το τηλεχειριστήριο για την εκκίνηση του Kodi.

# #36418
source: Specify the delay between button sequences on a universal remote.
el: Καθορίστε την καθυστέρηση μεταξύ ακολουθιών πλήκτρων σε τηλεχειριστήρια universal.

# #36419
source: Define locations used for retrieving weather information.
el: Ορισμός τοποθεσιών για λήψη πληροφοριών καιρού.

# #36421
source: Bypassing VDPAU mixer saves resources on low power systems but slightly reduces picture quality.
el: Παρακάμπτοντας το μείκτη VDPAU μειώνεται η χρήση πόρων, αλλά με ταυτόχρονη μείωση της ποιότητας εικόνας.

# #36422
source: Enable hardware video decode using AMLogic decoder.
el: AMLogic αποκωδικοποίηση υλικού των αρχείων βίντεο.

# #36423
source: Enables frame-multi-threaded software decoding (less reliable than the default single threaded mode).
el: Ενεργοποίηση πολυνηματικής αποκωδικοποίησης καρέ (λιγότερο αξιόπιστη από την προεπιλεγμένη λειτουργία).

# #36424
source: Select what will happen when an EPG item is selected: [Show context menu] will trigger the contextual menu from where you can choose further actions; [Switch to channel] will instantly tune to the related channel; [Show information] will display a detailed information with plot and further options; [Record] will create a recording timer for the selected item.
el: Ορισμός της ενέργειας όταν έχει επιλεγεί ένα αντικείμενο EPG: Η [Εμφάνιση μενού επιλογών] θα ενεργοποιήσει το αντίστοιχο μενού από όπου μπορείτε να επιλέξετε περαιτέρω ενέργειες. Η [Μετάβαση σε κανάλι] θα αλλάξει άμεσα το κανάλι σε αυτό που θέλετε. Η [Προβολή πληροφοριών] θα εμφανίσει αναλυτικές πληροφορίες, συμπεριλαμβανομένης της πλοκής και επιπλέον επιλογών. Η [Εγγραφή] θα ενεργοποιήσει ένα χρονοδιακόπτη εγγραφής για το επιλεγμένο αντικείμενο.

# #36425
source: Show context menu
el: Εμφάνιση μενού επιλογών

# #36426
source: Switch to channel
el: Μετάβαση στο κανάλι

# #36427
source: Show information
el: Εμφάνιση πληροφοριών

# #36428
source: Record
el: Εγγραφή

# #36429
source: Select this if the audio out connection only supports multichannel audio as Dolby Digital 5.1, such as an SPDIF connection. If your system supports LPCM multichannel sound via HDMI, leave this disabled.
el: Επιλογή αυτής της ρύθμισης αν η σύνδεση της εξόδου ήχου υποστηρίζει μόνο πολυκάναλο ήχο, π.χ. Dolby Digital 5.1, όπως σε σύνδεση SPDIF. Αν το σύστημά σας υποστηρίζει πολυκάναλο ήχο LPCM μέσω HDMI, αφήστε το απενεργοποιημένο.

# #36430
source: Configure how video processing will be accelerated. This includes things like decoding and scaling.
el: Διαμόρφωση της μεθόδου επιτάχυνσης κατά την επεξεργασία βίντεο. Περιλαμβάνονται ρυθμίσεις όπως η αποκωδικοποίηση και το scaling.

# #36431
source: Defines whether video decoding should be performed in software (requires more CPU) or with hardware acceleration where possible.
el: Ορισμός του τρόπου αποκωδικοποίησης βίντεο, είτε μέσω λογισμικού (απαιτείται περισσότερη επεξεργαστική ισχύ), ή μέσω επιτάχυνσης υλικού όταν είναι εφικτό.

# #36500
source: Stereoscopic mode (current)
el: Στερεοσκοπική προβολή (τρέχουσα)

# #36501
source: Stereoscopic mode
el: Στερεοσκοπική προβολή

# #36502
source: None
el: Κανένα

# #36503
source: Over/Under
el: Πάνω/Κάτω

# #36504
source: Side by side
el: Το ένα δίπλα στο άλλο

# #36505
source: Anaglyph Red/Cyan
el: Ανάγλυφο Κόκκινο/Κυανό

# #36506
source: Anaglyph Green/Magenta
el: Ανάγλυφο Πράσινο/Ματζέντα

# #36507
source: Interlaced
el: Πεπλεγμένο (Interlaced)

# #36508
source: Hardware Based
el: Βασισμένο στο Υλικό

# #36509
source: Monoscopic - 2D
el: Μονοσκοπικό - 2D

# #36520
source: Playback mode of stereoscopic videos.
el: Λειτουργία αναπαραγωγής στερεοσκοπικών βίντεο.

# #36521
source: Ask me
el: Ρωτήστε με

# #36522
source: Use preferred mode
el: Χρήση προτιμώμενης λειτουργίας

# #36523
source: Maximum sampling rate for spdif or sampling rate for fixed output configuration.
el: Μέγιστος ρυθμός δειγματοληψίας για SPDIF ή ρυθμός δειγματοληψίας για διαμόρφωση σταθερής εξόδου.

# #36524
source: Preferred mode
el: Προτιμώμενη λειτουργία

# #36525
source: Same as movie (autodetect)
el: Όπως η ταινία (αυτόματος εντοπισμός)

# #36526
source: Disable stereoscopic mode when playback is stopped
el: Απενεργοποίηση στερεοσκοπικής προβολής κατά τη διακοπή της αναπαραγωγής

# #36527
source: This video is stereoscopic. Select playback mode
el: Αυτό το βίντεο είναι στερεοσκοπικό. Επιλέξτε λειτουργία αναπαραγωγής

# #36528
source: Select stereoscopic mode
el: Επιλογή στερεοσκοπικής προβολής

# #36529
source: Mono (2D)
el: Μονό (2D)

# #36530
source: Preferred mode
el: Προτιμώμενη λειτουργία

# #36531
source: Select alternate mode...
el: Επιλογή εναλλακτικής λειτουργίας...

# #36532
source: Same as movie
el: Όπως η ταινία

# #36533
source: Select how audio is downmixed, for example from 5.1 to 2.0: [Enabled] maintains the dynamic range of the original audio source when downmixed however volume will be lower [Disabled] maintains volume level of the original audio source however the dynamic range is compressed. Note - Dynamic range is the difference between the quietest and loudest sounds in a audio source.
el: Επιλογή του τρόπου με τον οποίο θα γίνεται ο υποβιβασμός καναλιών του ήχου (downmix), π.χ. από 5.1 σε 2.0: Το [Ενεργό] διατηρεί το δυναμικό εύρος της αρχικής ηχητικής πηγής κατά το downmix, εντούτοις η ένταση θα είναι πιο χαμηλή. Το [Ανενεργό] διατηρεί την ένταση του ήχου της αρχικής ηχητικής πηγής, εντούτοις το δυναμικό εύρος συμπιέζεται. Σημείωση: Το δυναμικό εύρος είναι η διαφορά ανάμεσα στον πιο έντονο και τον πιο αχνό ήχο σε μια ηχητική πηγή.

# #36535
source: Stereoscopic mode of video
el: Στερεοσκοπική προβολή του βίντεο

# #36536
source: Stereoscopic mode inverted
el: Ανεστραμμένη στερεοσκοπική προβολή

# #36537
source: Set playback mode of stereoscopic 3D videos.
el: Ορισμός λειτουργίας αναπαραγωγής στερεοσκοπικών 3D βίντεο.

# #36538
source: Prevents Kodi exiting out of stereoscopic 3D mode when playback is stopped as not all TVs will recognise the switch from 3D back to 2D without the viewing mode being toggled on the TV.
el: Αποτρέπει το Kodi από το να βγαίνει από τη στερεοσκοπική 3D προβολή κατά τη διακοπή της αναπαραγωγής, καθώς δεν αναγνωρίζουν όλες οι τηλεοράσεις την αλλαγή από 3D σε 2D χωρίς την αντίστοιχη ρύθμιση στην ίδια την τηλεόραση.

# #36539
source: Changes the stereoscopic 3D mode of the user interface.
el: Αλλάζει τη στερεοσκοπική 3D προβολή του περιβάλλοντος εργασίας.

# #36540
source: The preferred stereoscopic 3D mode.
el: Προτιμώμενη στερεοσκοπική 3D προβολή.

# #36541
source: Allows volume control from AirPlay clients.
el: Επιτρέπει τον έλεγχο της έντασης του ήχου από πελάτες AirPlay.

# #36542
source: Output to both analogue (headphones) and HDMI
el: Έξοδος ήχου και στην αναλογική (ακουστικά) και σε HDMI

# #36543
source: Enable this to make dialogue louder compared to background sounds when downmixing multichannel audio
el: Ενεργοποιήστε το για αύξηση της έντασης του διαλόγου σε σχέση με τους ήχους υποβάθρου κατά το downmix πολυκάναλου ήχου

# #36544
source: Enable hardware decoding of video files.
el: Αποκωδικοποίηση υλικού των αρχείων βίντεο.

# #36545
source: Subtitle stereoscopic depth
el: Στερεοσκοπικό βάθος υποτίτλων

# #36546
source: Sets the visual depth of subtitles for stereoscopic 3D videos. The higher the value, the closer the subtitles will appear to the viewer.
el: Ορισμός του οπτικού βάθους υποτίτλων σε στερεοσκοπικά 3D βίντεο. Όσο υψηλότερη είναι η τιμή, τόσο πιο κοντά στο θεατή θα φαίνονται οι υπότιτλοι.

# #36547
source: Use higher quality textures for covers and fanart (uses more memory)
el: Χρήση εικόνων υψηλότερης ανάλυσης για εξώφυλλα και fanart (απαιτεί περισσότερη μνήμη)

# #36548
source: Limits resolution of GUI to save memory. Does not affect video playback. Use 1080 for unlimited. Requires restart.
el: Περιορισμός της ανάλυσης του Περιβάλλοντος Εργασίας για χρήση λιγότερης μνήμης. Δεν επηρεάζεται η αναπαραγωγή βίντεο. Η τιμή 1080 αντιστοιχεί σε απεριόριστη χρήση μνήμης. Απαιτεί επανεκκίνηση.

# #36600
source: Category containing the settings for how the music library is handled.
el: Κατηγορία με ρυθμίσεις σχετικά με το χειρισμό της μουσικής συλλογής.

# #36601
source: Category containing settings for how music file lists are handled.
el: Κατηγορία με όλες τις ρυθμίσεις σχετικά με το χειρισμό λιστών αρχείων μουσικής.

# #36602
source: Category containing settings for how the AirPlay service is handled.
el: Κατηγορία με ρυθμίσεις σχετικά με το χειρισμό της υπηρεσίας AirPlay.

# #36603
source: Category containing settings for how video output is handled.
el: Κατηγορία με ρυθμίσεις σχετικά με το χειρισμό της εξόδου βίντεο.

# #37000
source: (Visually Impaired)
el: (Για Άτομα με Προβλήματα Όρασης)

# #37001
source: (Directors Comments)
el: (Σχολιασμός Σκηνοθέτη)

# #37002
source: (Directors Comments 2)
el: (Σχολιασμός Σκηνοθέτη 2)

# #37011
source: (CC)
el: (Υπότιτλοι)

# #37012
source: (Forced)
el: (Ενσωματωμένοι)

# #37013
source: (Directors Comments)
el: (Σχολιασμός Σκηνοθέτη)

# #37014
source: Last used profile
el: Τελευταίο προφίλ

# #37015
source: Browse Into
el: Εξερεύνηση Εντός

# #37016
source: Select this option if your receiver is capable of decoding E-AC3 streams.
el: Επιλογή αυτής της ρύθμισης αν ο δέκτης σας υποστηρίζει αποκωδικοποίηση ροών E-AC3.

# #37017
source: Dual audio output
el: Διπλή έξοδος ήχου

# #37018
source: Boost centre channel when downmixing
el: Ενίσχυση του κεντρικού καναλιού κατά το downmix

# #37019
source: Enables system keys like printscreen, alt-tab and volume keys when in fullscreen.
el: Ενεργοποίηση πλήκτρων συστήματος όπως το printscreen, το alt-tab και των πλήκτρων ήχου κατά την πλήρη οθόνη.

# #37020
source: Enable higher colour depth artwork
el: Ενεργοποίηση εικόνων υψηλότερου χρωματικού βάθους

# #37021
source: Set GUI resolution limit
el: Ορισμός ορίου ανάλυσης του Περιβάλλοντος Εργασίας

# #37022
source: UPnP Player
el: Αναπαραγωγέας UPnP

# #37023
source: Do you wish to stop playback on the remote device?
el: Να διακοπεί η αναπαραγωγή στην απομακρυσμένη συσκευή;
