Repository: xbmc/xbmc
Catalog: language/Greek/strings.po
Languages: el

# #21832
source: Exposure mode
el: Μέθοδος έκθεσης

# #21833
source: Flash used
el: Χρήση φλας

# #21834
source: White-balance
el: Ισορροπία λευκού

# #21835
source: Light source
el: Φωτεινή πηγή

# #21836
source: Metering mode
el: Λειτουργία μέτρησης

# #21837
source: ISO
el: Ευαισθησία ISO

# #21838
source: Digital zoom
el: Ψηφιακή μεγέθυνση

# #21839
source: CCD width
el: Πλάτος CCD

# #21840
source: GPS latitude
el: GPS γεωγρ. πλάτος

# #21841
source: GPS longitude
el: GPS γεωγρ. μήκος

# #21842
source: GPS altitude
el: GPS υψόμετρο

# #21843
source: Orientation
el: Προσανατολισμός

# #21857
source: Sub-location
el: Υπο-τοποθεσία

# #21858
source: Image type
el: Τύπος Εικόνας

# #21859
source: Time created
el: Ώρα Δημιουργίας

# #21860
source: Supplemental categories
el: Συμπληρωματικές πληροφορίες

# #21861
source: Keywords
el: Λέξεις κλειδιά

# #21862
source: Caption
el: Λεζάντα

# #21863
source: Author
el: Δημιουργός

# #21864
source: Headline
el: Επικεφαλίδα

# #21865
source: Special instructions
el: Ειδικές πληροφορίες

# #21866
source: Category
el: Κατηγορία

# #21867
source: Byline
el: Προέλευση

# #21868
source: Byline title
el: Τίτλος

# #21869
source: Credit
el: Ειδική μνεία

# #21870
source: Source
el: Πηγή

# #21871
source: Copyright notice
el: Σημειώσεις πνευματικής ιδιοκτησίας

# #21872
source: Object name
el: Όνομα αντικειμένου

# #21873
source: City
el: Πόλη

# #21874
source: State
el: Πολιτεία

# #21875
source: Country
el: Χώρα

# #21876
source: Original Tx Reference
el: Νομοθετικές πληροφορίες

# #21877
source: Date created
el: Ημερομηνία δημιουργίας

# #21878
source: Urgency
el: Επείγουσα Ανάγκη

# #21879
source: Country code
el: Κωδικός χώρας

# #21880
source: Reference service
el: Υπηρεσία πληροφόρησης

# #21881
source: Allow control of Kodi via UPnP
el: Έγκριση ελέγχου του Kodi μέσω UPnP

# #21882
source: Attempt to skip introduction before DVD menu
el: Απόπειρα αποφυγής οδηγιών πριν το μενού DVD

# #21883
source: Saved music
el: Αποθηκευμένη μουσική

# #21884
source: Query info for all artists
el: Εύρεση πληροφοριών για όλους τους καλλιτέχνες

# #21885
source: Downloading album information
el: Λήψη πληροφοριών για το άλμπουμ

# #21886
source: Downloading artist information
el: Λήψη πληροφοριών για τον καλλιτέχνη

# #21887
source: Biography
el: Βιογραφία

# #21888
source: Discography
el: Δισκογραφία

# #21889
source: Searching artist
el: Αναζήτηση καλλιτέχνη

# #21890
source: Select artist
el: Επιλογή καλλιτέxνη

# #21891
source: Artist information
el: Πληροφορίες καλλιτέχνη

# #21892
source: Instruments
el: Όργανα

# #21893
source: Born
el: Γεννήθηκε

# #21894
source: Formed
el: Δημιουργία

# #21895
source: Themes
el: Θεματολόγιο

# #21896
source: Disbanded
el: Διαλύθηκε

# #21897
source: Died
el: Πέθανε

# #21898
source: Years active
el: Έτη σταδιοδρομίας

# #21899
source: Label
el: Ετικέτα

# #21900
source: Born/Formed
el: Γέννηση/Δημιουργία

# #22000
source: Update library on startup
el: Ενημέρωση συλλογής κατά την εκκίνηση

# #22001
source: Hide progress of library updates
el: Απόκρυψη εξέλιξης ενημερώσεων συλλογής

# #22002
source: DNS suffix
el: Κατάληξη DNS

# #22003
source: %2.3fs
el: %2.3f δευτ.

# #22004
source: Delayed by: %2.3fs
el: Καθυστέρηση κατά: %2.3f δευτ.

# #22005
source: Ahead by: %2.3fs
el: Προβάδισμα κατά: %2.3f δευτ.

# #22006
source: Subtitle offset
el: Μετατόπιση υποτίτλων

# #22007
source: OpenGL vendor:
el: Κατασκευαστής OpenGL:

# #22008
source: OpenGL renderer:
el: Αποτυπωτής OpenGL:

# #22009
source: OpenGL version:
el: Έκδοση OpenGL:

# #22010
source: GPU temperature:
el: Θερμοκρασία GPU:

# #22011
source: CPU temperature:
el: Θερμοκρασία CPU:

# #22012
source: Total memory
el: Συνολική μνήμη

# #22013
source: Profile data
el: Δεδομένα προφίλ

# #22014
source: Use dim if paused during video playback
el: Χρήση 'Σκίασης' κατά την παύση

# #22015
source: All recordings
el: Όλες οι εγγραφές

# #22016
source: By title
el: Aνά τίτλο

# #22017
source: By group
el: Ανά ομάδα

# #22018
source: Live channels
el: Δικτυακά κανάλια

# #22019
source: Recordings by title
el: Εγγραφές ανά τίτλο

# #22020
source: Guide
el: Οδηγός

# #22021
source: Allowed error in aspect ratio to minimise black bars
el: Μέγιστο σφάλμα αναλογίας οθόνης για μείωση μαύρων μπαρών

# #22022
source: Show video files in listings
el: Εμφάνιση αρχείων βίντεο στις λίστες

# #22023
source: DirectX vendor:
el: Κατασκευαστής DirectX:

# #22024
source: Direct3D version:
el: Έκδοση Direct3D:

# #22030
source: Font
el: Γραμματοσειρά

# #22031
source: Size
el: Μέγεθος

# #22032
source: Colours
el: Χρώματα

# #22033
source: Charset
el: Κωδικοποίηση χαρακτήρων

# #22034
source: Export karaoke titles as HTML
el: Εξαγωγή τίτλων καραόκε ως HTML

# #22035
source: Export karaoke titles as CSV
el: Εξαγωγή τίτλων καραόκε ως CSV

# #22036
source: Import karaoke titles...
el: Εισαγωγή τίτλων καραόκε...

# #22037
source: Show song selector automatically
el: Αυτόματη εμφάνιση επιλογέα τραγουδιών

# #22038
source: Export karaoke titles...
el: Εξαγωγή τίτλων καραόκε...

# #22039
source: Enter song number
el: Εισαγωγή αριθμού τραγουδιού

# #22040
source: white/green
el: άσπρο/πράσινο

# #22041
source: white/red
el: άσπρο/κόκκινο

# #22042
source: white/blue
el: άσπρο/μπλε

# #22043
source: black/white
el: μαύρο/άσπρο

# #22079
source: Default select action
el: Προεπιλεγμένη ενέργεια

# #22080
source: Choose
el: Επιλογή

# #22081
source: Show Information
el: Προβολή πληροφοριών

# #22082
source: More...
el: Περισσότερα...

# #22083
source: Play all
el: Αναπαραγωγή όλων

# #23049
source: Teletext not available
el: Μη διαθέσιμο Teletext

# #23050
source: Activate Teletext
el: Ενεργοποίηση Teletext

# #23051
source: Part %i
el: Μέρος %i

# #23052
source: Buffering %i bytes
el: Aποθήκευση %i bytes

# #23053
source: Stopping
el: Διακόπτεται

# #23054
source: Running
el: Εκτελείται

# #23055
source: Scale Teletext to 4:3
el: Προσαρμογή Teletext σε 4:3

# #23100
source: External Player Active
el: Ενεργός εξωτερικός αναπαραγωγέας

# #23101
source: Click OK to terminate the player
el: Πιέστε 'Επιλογή' για να τερματίσετε την αναπαραγωγή

# #23104
source: Click OK when playback has ended
el: Πιέστε 'Επιλογή' όταν η αναπαραγωγή ολοκληρωθεί

# #24000
source: Add-on
el: Πρόσθετο

# #24001
source: Add-ons
el: Πρόσθετα

# #24002
source: Add-on options
el: Ρυθμίσεις πρόσθετου

# #24003
source: Add-on Information
el: Πληροφορίες πρόσθετου

# #24005
source: Media sources
el: Πηγές πολυμέσων

# #24007
source: Movie information
el: Πληροφορίες ταινίας

# #24008
source: Screensaver
el: Προφύλαξη οθόνης

# #24010
source: Visualisation
el: Οπτικοποίηση

# #24011
source: Add-on repository
el: Αποθετήριο πρόσθετων

# #24012
source: Subtitles
el: Υπότιτλοι

# #24013
source: Lyrics
el: Στίχοι

# #24014
source: TV information
el: Πληροφορίες τηλεόρασης

# #24015
source: Music video information
el: Πληροφορίες μουσικού βίντεο

# #24016
source: Album information
el: Πληροφορίες άλμπουμ

# #24017
source: Artist information
el: Πληροφορίες καλλιτέχνη

# #24018
source: Services
el: Υπηρεσίες

# #24019
source: PVR clients
el: Πελάτες PVR

# #24020
source: Configure
el: Διαμόρφωση

# #24021
source: Disable
el: Απενεργοποίηση

# #24022
source: Enable
el: Ενεργοποίηση

# #24023
source: Disabled
el: Ανενεργή

# #24024
source: Add-on disabled
el: Απενεργοποιημένο πρόσθετο

# #24027
source: Weather
el: Καιρός

# #24028
source: Weather.com (standard)
el: Weather.com (βασική)

# #24029
source: Service for weather information
el: Υπηρεσία για καιρικές πληροφορίες

# #24030
source: This Add-on can not be configured
el: Δεν είναι δυνατή η ρύθμιση αυτού του πρόσθετου

# #24031
source: Error loading settings
el: Σφάλμα κατά τη φόρτωση ρυθμίσεων

# #24032
source: All Add-ons
el: Όλα τα πρόσθετα

# #24033
source: Get Add-ons
el: Λήψη πρόσθετων

# #24034
source: Check for updates
el: Έλεγχος για ενημερώσεις

# #24035
source: Force refresh
el: Εξαναγκασμένη ανανέωση

# #24036
source: Change log
el: Καταγραφή αλλαγών

# #24037
source: Uninstall
el: Κατάργηση

# #24038
source: Install
el: Εγκατάσταση

# #24039
source: Disabled Add-ons
el: Απενεργοποιημένα πρόσθετα

# #24040
source: (Clear the current setting)
el: (Απαλοιφή της τρέχουσας ρύθμισης)

# #24041
source: Install from zip file
el: Εγκατάσταση από αρχείο zip

# #24042
source: Downloading %i%%
el: Λήψη %i%%

# #24043
source: Available Updates
el: Διαθέσιμες ενημερώσεις

# #24044
source: Dependencies not met. Please contact Add-on author.
el: Δεν πληρούνται οι εξαρτήσεις. Επικοινωνήστε με το δημιουργό του Πρόσθετου.

# #24045
source: Add-on does not have the correct structure
el: Το πρόσθετο δεν έχει τη σωστή δομή

# #24046
source: %s is used by the following installed Add-on(s)
el: Το %s χρησιμοποιείται από τα ακόλουθα εγκατεστημένα Πρόσθετα

# #24047
source: This Add-on cannot be uninstalled
el: Αυτό το Πρόσθετο δεν μπορεί να απεγκατασταθεί

# #24048
source: Rollback
el: Επαναφορά

# #24049
source: Incompatible
el: Μη-Συμβατό

# #24050
source: Available Add-ons
el: Διαθέσιμα πρόσθετα

# #24051
source: Version:
el: Έκδοση:

# #24052
source: Disclaimer
el: Αποποίηση ευθυνών

# #24053
source: License:
el: Άδεια χρήσης:

# #24054
source: Changelog
el: Αρχείο καταγραφής αλλαγών

# #24059
source: Would you like to enable this Add-on?
el: Να ενεργοποιηθεί αυτό το πρόσθετο;

# #24060
source: Would you like to disable this Add-on?
el: Να απενεργοποιηθεί αυτό το πρόσθετο;

# #24061
source: Add-on update available!
el: Διαθέσιμη ενημέρωση πρόσθετου!

# #24062
source: Enabled Add-ons
el: Ενεργοποιημένα πρόσθετα

# #24063
source: Auto update
el: Αυτόματη ενημέρωση

# #24064
source: Add-on enabled
el: Το πρόσθετο ενεργοποιήθηκε

# #24065
source: Add-on updated
el: Το πρόσθετο ενημερώθηκε

# #24066
source: Cancel Add-on download?
el: Ακύρωση λήψης πρόσθετου;

# #24067
source: Currently downloading Add-ons
el: Γίνεται λήψη πρόσθετων

# #24068
source: Update available
el: Διαθέσιμη ενημέρωση

# #24069
source: Update
el: Ενημέρωση

# #24070
source: Add-on could not be loaded.
el: Αδυναμία φόρτωσης πρόσθετου.

# #24071
source: An unknown error has occurred.
el: Παρουσιάστηκε άγνωστο σφάλμα.

# #24072
source: Settings required
el: Απαιτούνται ρυθμίσεις

# #24073
source: Could not connect
el: Δεν ήταν δυνατή η σύνδεση

# #24074
source: Needs to restart
el: Απαιτείται επανεκκίνηση

# #24075
source: Disable
el: Απενεργοποίηση

# #24076
source: Add-on Required
el: Απαιτείται πρόσθετο

# #24080
source: Try to reconnect?
el: Νέα προσπάθεια επανασύνδεσης;

# #24089
source: Add-on restarts
el: Επανεκκινήσεις πρόσθετου

# #24090
source: Lock Add-on manager
el: Κλείδωμα διαχείρισης Πρόσθετων

# #24091
source: This Add-on cannot be disabled
el: Αυτό το Πρόσθετο δεν μπορεί να απενεργοποιηθεί

# #24094
source: (current)
el: (τρέχoν)

# #24095
source: (blacklisted)
el: (ανεπιθύμητο)

# #24096
source: Add-on is incompatible or has been marked broken in repository.
el: Το Πρόσθετο είναι μη συμβατό ή έχει σημανθεί ως κατεστραμμένο στο αποθετήριο.

# #24097
source: Would you like to disable it on your system?
el: Επιθυμείτε να απενεργοποιηθεί από το σύστημά σας;

# #24098
source: Broken
el: Κατεστραμμένο

# #24099
source: Would you like to switch to this skin?
el: Να εφαρμοστεί αυτό το κέλυφος;

# #24100
source: To use this feature you must download an Add-on:
el: Για να χρησιμοποιήσετε αυτή τη λειτουργία πρέπει να κατεβάσετε ένα πρόσθετο:

# #24101
source: Would you like to download this Add-on?
el: Να γίνει λήψη αυτού του πρόσθετου;

# #24102
source: Unable to load skin
el: Αδυναμία φόρτωσης κελύφους

# #24103
source: Skin is missing some files
el: Λείπουν κάποια αρχεία από το κέλυφος

# #24104
source: Add-on is incompatible due to unmet dependencies.
el: Το Πρόσθετο είναι μη συμβατό επειδή δεν πληρούνται οι εξαρτήσεις.

# #24105
source: Pause when searching for subtitles
el: Παύση κατά την αναζήτηση υποτίτλων

# #24106
source: Specify where downloaded subtitles should be saved, the same location as the video or a custom location.
el: Καθορίστε που θα αποθηκεύονται οι υπότιτλοι, στον ίδιο φάκελο με το βίντεο ή σε κάποια προσαρμοσμένη τοποθεσία.

# #24107
source: Searching for subtitles ...
el: Αναζήτηση υποτίτλων ...

# #24108
source: %d subtitles found
el: Βρέθηκαν %d υπότιτλοι

# #24109
source: No subtitles found
el: Δε βρέθηκαν υπότιτλοι

# #24110
source: Downloading subtitles ...
el: Γίνεται λήψη υποτίτλων ...

# #24111
source: Languages to download subtitles for
el: Γλώσσες για τις οποίες να γίνει λήψη υποτίτλων

# #24112
source: Set languages to use when searching for subtitles. Not all subtitle services will use all languages.
el: Ορισμός γλωσσών για τις οποίες θα γίνεται αναζήτηση υποτίτλων. Δε θα χρησιμοποιηθούν από όλες τις υπηρεσίες υποτίτλων όλες τις γλώσσες.

# #24113
source: Failed to download subtitle
el: Αποτυχία λήψης υποτίτλου

# #24114
source: No subtitle services installed
el: Δεν εγκαταστάθηκαν υπηρεσίες υποτίτλων

# #24115
source: Subtitle storage location
el: Τοποθεσία αποθήκευσης υποτίτλων

# #24116
source: Default TV Service
el: Προεπιλεγμένη Υπηρεσία Τηλεόρασης

# #24117
source: Select service that will be used as default to search for TV Show subtitles.
el: Επιλογή της υπηρεσίας που θα είναι η προεπιλογή για αναζήτηση υποτίτλων Τηλ. Σειρών.

# #24118
source: Default Movie Service
el: Προεπιλεγμένη Υπηρεσία Ταινιών

# #24119
source: Select service that will be used as default to search for Movie subtitles.
el: Επιλογή της υπηρεσίας που θα είναι η προεπιλογή για αναζήτηση υποτίτλων Ταινιών.

# #24120
source: Manual search string
el: Κείμενο χειροκίνητης αναζήτησης

# #24121
source: Enter search string
el: Εισαγωγή κειμένου αναζήτησης

# #24122
source: Update all
el: Ενημέρωση όλων

# #24123
source: Pause the current video while searching for subtitles and resume once the subtitle is available.
el: Παύση του τρέχοντος βίντεο κατά την αναζήτηση υποτίτλων, και συνέχιση μόλις κατέβουν οι υπότιτλοι.

# #24124
source: Next to the video
el: Δίπλα στο βίντεο

# #24125
source: Custom location
el: Προσαρμοσμένη τοποθεσία

# #25000
source: Notifications
el: Ειδοποιήσεις

# #25001
source: Hide foreign
el: Απόκρυψη ξενόγλωσσων

# #25002
source: Select from all titles ...
el: Επιλογή από όλους τους τίτλους ...

# #25003
source: Show Blu-ray menus
el: Εμφάνιση μενού Blu-ray

# #25004
source: Play main title: %d
el: Αναπαραγωγή κυρίως τίτλου: %d

# #25005
source: Title: %d
el: Τίτλος: %d

# #25006
source: Select playback item
el: Επιλογή αντικειμένου για αναπαραγωγή

# #25007
source: Chapters: %u - duration: %s
el: Κεφάλαια: %u - διάρκεια: %s

# #25008
source: Playback of Blu-ray failed
el: Αποτυχία αναπαραγωγής Blu-ray

# #25009
source: The menu of this Blu-ray is not supported
el: Το μενού αυτού του Δίσκου Blu-ray δεν υποστηρίζεται

# #29800
source: Library Mode
el: Λειτουργία Συλλογής

# #29801
source: QWERTY keyboard
el: Διάταξη πληκτρολογίου QWERTY

# #29802
source: Passthrough Audio in use
el: Σε λειτουργία η διέλευση ήχου

# #33001
source: Trailer quality
el: Ποιότητα διαφημιστικού

# #33002
source: Stream
el: Ροή πολυμέσων

# #33003
source: Download
el: Λήψη

# #33004
source: Download & play
el: Λήψη & εκτέλεση

# #33005
source: Download & save
el: Λήψη & αποθήκευση

# #33006
source: Today
el: Σήμερα

# #33007
source: Tomorrow
el: Αύριο

# #33008
source: Saving
el: Αποθήκευση

# #33009
source: Copying
el: Αντιγραφή

# #33010
source: Set download directory
el: Ορισμός φακέλου λήψης

# #33011
source: Search duration
el: Διάρκεια αναζήτησης

# #33012
source: Short
el: Σύντομος

# #33013
source: Long
el: Εκτεταμένος

# #33014
source: Use DVD player instead of regular player
el: Χρήση αναπαραγωγέα DVD αντί του κανονικού

# #33015
source: Ask for download before playing video
el: Επιβεβαίωση λήψης πριν την αναπαραγωγή του βίντεο

# #33016
source: Clips
el: Κλιπ

# #33017
source: Restart plug-in to enable
el: Επανεκκινήστε το plugin για ενεργοποίηση

# #33018
source: Tonight
el: Απόψε

# #33019
source: Tomorrow Night
el: Αύριο βράδυ

# #33020
source: Condition
el: Συνθήκες

# #33021
source: Precipitation
el: Υετός

# #33022
source: Precip
el: Βροχή

# #33023
source: Humid
el: Υγρασία

# #33024
source: Feels
el: Αίσθηση

# #33025
source: Observed
el: Παρατηρούμενη

# #33026
source: Departure from normal
el: Παρέκκλιση από το κανονικό

# #33027
source: Sunrise
el: Ανατολή ηλίου

# #33028
source: Sunset
el: Δύση ηλίου

# #33029
source: Details
el: Λεπτομέρειες

# #33030
source: Outlook
el: Πρόγνωση

# #33031
source: Coverflow
el: Ροή εξωφύλλων

# #33032
source: Translate text
el: Μετάφραση κειμένου

# #33033
source: Map list %s category
el: Κατηγορία λίστας χαρτών %s

# #33034
source: 36 Hour
el: 36ωρο

# #33035
source: Maps
el: Χάρτες

# #33036
source: Hourly
el: Ωριαία

# #33037
source: Weekend
el: Σαββατοκύριακο

# #33038
source: %s day
el: %sη ημέρα

# #33049
source: Alert
el: Προειδοποίηση

# #33050
source: Alerts
el: Προειδοποιήσεις

# #33051
source: Choose Your
el: Επιλογή

# #33052
source: Check
el: Έλεγχος

# #33053
source: Configure the
el: Διαμορφώστε τις

# #33054
source: Seasons
el: Κύκλοι

# #33055
source: Use your
el: Εκτέλεση

# #33056
source: Watch your
el: Παρακολούθηση

# #33057
source: Listen to
el: Ακρόαση

# #33058
source: View your
el: Προβολή

# #33059
source: Configure the
el: Διαμορφώστε τα

# #33060
source: Power
el: Λειτουργία

# #33061
source: Menu
el: Μενού

# #33062
source: Play the
el: Αναπαραγωγή

# #33063
source: Options
el: Επιλογές

# #33065
source: Editor
el: Επεξεργαστής

# #33066
source: About your
el: Περιήγηση

# #33067
source: Star rating
el: Αξιολόγηση

# #33068
source: Background
el: Υπόβαθρο

# #33069
source: Backgrounds
el: Υπόβαθρα

# #33070
source: Custom background
el: Προσαρμοσμένο υπόβαθρο

# #33071
source: Custom backgrounds
el: Προσαρμοσμένα υπόβαθρα

# #33072
source: View Readme
el: Σημειώσεις έκδοσης

# #33073
source: View Changelog
el: Αλλαγές έκδοσης

# #33074
source: This version of %s requires an
el: Για να εκτελεστεί η έκδοση %s απαιτείται

# #33075
source: Kodi revision of %s or greater to run.
el: η %s έκδοση του Kodi ή νεώτερη.

# #33076
source: Please update Kodi.
el: Παρακαλώ αναβαθμίστε το Kodi.

# #33077
source: No data found!
el: Δε βρέθηκαν δεδομένα!

# #33078
source: Next page
el: Επόμενη σελίδα

# #33079
source: Love
el: Αγαπητό

# #33080
source: Hate
el: Απεχθές

# #33081
source: This file is stacked, select the part you want to play from.
el: Αυτό το αρχείο είναι στοιβαγμένο, επιλέξτε από που να γίνει αναπαραγωγή.

# #33082
source: Path to script
el: Διαδρομή για το script

# #33083
source: Enable custom script button
el: Ενεργοποίηση πλήκτρου προσαρμοσμένου script

# #33084
source: Auto login
el: Αυτόματη σύνδεση

# #33100
source: Failed to start
el: Αποτυχία εκκίνησης

# #33101
source: Webserver
el: Διακομιστής ιστού

# #33102
source: Event Server
el: Διακομιστής Συμβάντων

# #33103
source: Remote communication server
el: Απομακρυσμένος Διακομιστής Επικοινωνίας

# #33200
source: Detected New Connection
el: Εντοπίστηκε Νέα Σύνδεση

# #34006
source: MPEG-4 Audio (FFmpeg M4A AAC)
el: Ήχος MPEG-4 Audio (FFmpeg M4A AAC)

# #34007
source: Windows Media Audio 2 (FFmpeg wmav2)
el: Ήχος Windows Media Audio 2 (FFmpeg wmav2)

# #34100
source: Number of channels
el: Αριθμός καναλιών

# #34111
source: Select the behaviour when no sound is required for either playback or GUI sounds. [Always] - continuous inaudible signal is output, this keeps the receiving audio device alive for any new sounds, however this might also block sound from other applications. [1- 10 Minutes] - same as Always except that after the selected period of time audio enters a suspended state [Off] - audio output enters a suspended state. Note - sounds can be missed if audio enters suspended state.
el: Επιλογή της συμπεριφοράς όταν δεν απαιτείται ήχος ούτε για αναπαραγωγή, ούτε για το Περιβάλλον Εργασίας. [Συνέχεια] - εκπομπή συνεχόμενου αθόρυβου σήματος που διατηρεί τη συσκευή ήχου ενεργή για νέους ήχους, αλλά ενδέχεται να μπλοκάρει τον ήχο από άλλες εφαρμογές. [1- 10 Λεπτά] - παρόμοιο με το 'Συνέχεια', αλλά μετά από συγκεκριμένο χρονικό διάστημα η έξοδος ήχου μεταβαίνει σε κατάσταση αναστολής [Απενεργοποιημένο] - η έξοδος ήχου μεταβαίνει σε κατάσταση αναστολής. Προσοχή - οι ήχοι μπορεί να χαθούν αν η έξοδος ήχου μεταβεί σε κατάσταση αναστολής.

# #34120
source: Play GUI sounds
el: Ήχοι πλοήγησης

# #34121
source: Only when playback stopped
el: Μόνο στη διακοπή της αναπαραγωγής

# #34122
source: Always
el: Πάντα

# #34123
source: Never
el: Ποτέ

# #34201
source: Can't find a next item to play
el: Αδυναμία εύρεσης επόμενου αντικειμένου

# #34202
source: Can't find a previous item to play
el: Αδυναμία εύρεσης προηγούμενου αντικειμένου

# #34300
source: Failed to start Zeroconf
el: Αποτυχία εκκίνησης του Zeroconf

# #34301
source: Is Apple's Bonjour Service installed? See log for more info.
el: Είναι εγκατεστημένη η υπηρεσία Bonjour της Apple; Δείτε το αρχείο καταγραφής για περισσότερες πληροφορίες.

# #34302
source: AirPlay requires Zeroconf to be enabled.
el: Το AirPlay χρειάζεται το Zeroconf να είναι ενεργό.

# #34303
source: Unable to stop Zeroconf
el: Αδυναμία διακοπής του Zeroconf

# #34304
source: AirPlay and AirTunes depend on Zeroconf running.
el: Το AirPlay και το AirTunes εξαρτώνται από το αν τρέχει το Zeroconf.

# #34400
source: Video Rendering
el: Απόδοση Βίντεο

# #34401
source: Failed to init video filters/scalers, falling back to bilinear scaling
el: Αποτυχία χρήσης φίλτρων/scalers βίντεο, επαναφορά σε bilinear προσαρμογή ανάλυσης

# #34402
source: Failed to initialise audio device
el: Αποτυχία έναρξης της συσκευής ήχου

# #34403
source: Check your audiosettings
el: Ελέγξτε τις ρυθμίσεις ήχου

# #34404
source: Use gestures for navigation:
el: Δακτυλικές κινήσεις (gestures) για πλοήγηση:

# #34405
source: 1 finger swipe left,right,up,down for cursors
el: 1 κίνηση δακτύλου αριστερά,δεξιά,πάνω,κάτω για μετακίνηση

# #34406
source: 2 finger swipe left for backspace
el: 2 κινήσεις δακτύλου αριστερά για διαγραφή

# #34407
source: 1 finger single tap for enter
el: 1 ελαφρύ χτύπημα για επιλογή

# #34408
source: 2 finger single tap or 1 finger long press for contextmenu
el: 1 παρατεταμένο ή 2 ελαφρά χτυπήματα για μενού επιλογών

# #35000
source: Peripherals
el: Περιφερειακά

# #35001
source: Generic HID device
el: Γενική συσκευή HID

# #35002
source: Generic network adaptor
el: Γενικός προσαρμογέας δικτύου

# #35003
source: Generic disk
el: Γενικός δίσκος

# #35004
source: There are no settings available for this peripheral.
el: Δεν υπάρχουν διαθέσιμες ρυθμίσεις για αυτό το περιφερειακό.

# #35005
source: New device configured
el: Η νέα συσκευή διαμορφώθηκε

# #35006
source: Device removed
el: Η συσκευή αφαιρέθηκε

# #35007
source: Keymap to use for this device
el: Keymap για χρήση με αυτή τη συσκευή

# #35008
source: Keymap enabled
el: Ενεργοποίηση Keymap

# #35009
source: Do not use the custom keymap for this device
el: Να μη γίνει χρήση του προσωπικού keymap για αυτή τη συσκευή

# #35100
source: Enable joystick and gamepad support
el: Ενεργοποίηση υποστήριξης χειριστηρίων και gamepad

# #35102
source: Disable joystick when this device is present
el: Απενεργοποίηση χειριστηρίου κατά την παρουσία αυτής της συσκευής

# #35103
source: Enable system keys in fullscreen
el: Πλήκτρα συστήματος στην πλήρη οθόνη

# #35500
source: Location
el: Τοποθεσία

# #35501
source: Class
el: Κλάση

# #35502
source: Name
el: Όνομα

# #35503
source: Vendor
el: Προμηθευτής

# #35504
source: Product ID
el: Αναγνωριστικό προϊόντος (ID)

# #36000
source: Pulse-Eight CEC adaptor
el: Προσαρμογέας Pulse-Eight CEC

# #36002
source: Switch to keyboard side command
el: Μετάβαση στο πληκτρολόγιο εντολών

# #36003
source: Switch to remote side command
el: Αλλαγή σε απομακρυσμένες εντολές

# #36004
source: Press "user" button command
el: Πιέστε το "user" πλήκτρο εντολών
