Repository: xbmc/xbmc
Catalog: language/Greek/strings.po
Languages: el

# #13510
source: Sync playback to display
el: Συγχρονισμός αναπαραγωγής ήχου με οθόνη

# #13511
source: Choose art
el: Επιλογή εικόνων

# #13512
source: Current art
el: Τρέχουσα εικόνα

# #13513
source: Remote art
el: Απομακρυσμένες εικόνες

# #13514
source: Local art
el: Τοπική εικόνα

# #13515
source: No art
el: Καμία εικόνα

# #13516
source: Add art
el: Προσθήκη εικόνων

# #13550
source: Pause during refresh rate change
el: Παύση κατά την αλλαγή του ρυθμού ανανέωσης

# #13551
source: Off
el: Ανενεργό

# #13552
source: %.1f Second
el: %.1f Δευτερόλεπτο

# #13553
source: %.1f Seconds
el: %.1f Δευτερόλεπτα

# #13554
source: %d Minute
el: %d Λεπτό

# #13555
source: %d Minutes
el: %d Λεπτά

# #13600
source: Apple remote
el: Χειριστήριο Apple

# #13602
source: Allow start of Kodi using the remote
el: Έγκριση έναρξης του Kodi μέσω του χειριστηρίου

# #13603
source: Sequence delay time
el: Χρόνος καθυστέρησης ακολουθίας

# #13610
source: Disabled
el: Ανενεργή

# #13611
source: Standard
el: Τυπική

# #13612
source: Universal Remote
el: Τηλεχειριστήριο γενικής χρήσης

# #13613
source: Multi Remote (Harmony)
el: Τηλεχειριστήριο Multi (Harmony)

# #13620
source: Apple Remote Error
el: Σφάλμα Χειριστηρίου Apple

# #13621
source: Apple Remote support could not be enabled.
el: Μπορεί να ενεργοποιηθεί υποστήριξη για Χειριστήριο Apple.

# #14000
source: Stack
el: Στοίβαγμα

# #14001
source: Unstack
el: Σκόρπισμα

# #14003
source: Downloading playlist file...
el: Λήψη αρχείου λίστας αναπ/γής...

# #14004
source: Downloading streams list...
el: Λήψη λίστας ροής πολυμέσων...

# #14005
source: Parsing streams list...
el: Ανάλυση λίστας ροής πολυμέσων...

# #14006
source: Downloading streams list failed
el: Αποτυχία λήψης λίστας ροής πολυμέσων

# #14007
source: Downloading playlist file failed
el: Αποτυχία λήψης αρχείου λίστας αναπ/γής

# #14009
source: Games directory
el: Κατάλογος παιχνιδιών

# #14010
source: Auto switch to thumbs based on
el: Αυτόματη εναλλαγή σε μικρογραφίες βάσει

# #14011
source: Enable auto switching to thumbs view
el: Ενεργοποίηση αυτόματης εναλλαγής στην προβολή μικρογραφιών

# #14012
source: - Use large icons
el: - Χρήση μεγάλων εικονιδίων

# #14013
source: - Switch based on
el: - Εναλλαγή βάσει

# #14014
source: - Percentage
el: - Ποσοστό

# #14015
source: No files and at least one thumb
el: Καθόλου αρχεία και τουλάχιστον μία μικρογραφία

# #14016
source: At least one file and thumb
el: Τουλάχιστον ένα αρχείο και μία μικρογραφία

# #14017
source: Percentage of thumbs
el: Ποσοστό μικρογραφιών

# #14018
source: View options
el: Επιλογές προβολής

# #14019
source: Change area code 1
el: Αλλαγή κωδικού 1ης περιοχής

# #14020
source: Change area code 2
el: Αλλαγή κωδικού 2ης περιοχής

# #14021
source: Change area code 3
el: Αλλαγή κωδικού 3ης περιοχής

# #14022
source: Library
el: Συλλογή

# #14023
source: No TV
el: Χωρίς τηλεόραση

# #14024
source: Enter the nearest large town
el: Η κοντινότερη μεγάλη πόλη

# #14025
source: Video/Audio/DVD cache - Hard disk
el: Συνολική λανθάνουσα μνήμη - Σκληρός δίσκος

# #14026
source: Video cache - DVD-ROM
el: Λανθάνουσα μνήμη βίντεο - DVD-ROM

# #14027
source: Video cache - Local Network
el: Λανθάνουσα μνήμη βίντεο - Τοπικό Δίκτυο

# #14028
source: Video cache - Internet
el: Λανθάνουσα μνήμη βίντεο - Διαδίκτυο

# #14030
source: Audio cache - DVD-ROM
el: Λανθάνουσα μνήμη ήχου - DVD-ROM

# #14031
source: Audio cache - Local Network
el: Λανθάνουσα μνήμη μουσικής - Τοπικό Δίκτυο

# #14032
source: Audio cache - Internet
el: Λανθάνουσα μνήμη μουσικής - Διαδίκτυο

# #14034
source: DVD cache - DVD-ROM
el: Λανθάνουσα μνήμη DVD - DVD-ROM

# #14035
source: Local Network
el: Τοπικό δίκτυο

# #14036
source: Services
el: Υπηρεσίες

# #14037
source: DVD cache - Local Network
el: Λανθάνουσα μνήμη DVD - Τοπικό Δίκτυο

# #14038
source: Network settings changed
el: Οι ρυθμίσεις του δικτύου άλλαξαν

# #14039
source: Kodi requires to restart to change your
el: Το Kodi πρέπει να επανεκκινηθεί για να αλλάξουν

# #14040
source: network setup. Would you like to restart now?
el: οι ρυθμίσεις δικτύου. Να γίνει επανεκκίνηση;

# #14041
source: Internet connection bandwidth limitation
el: Σύνδεση Διαδικτύου με περιορισμένη ταχύτητα

# #14043
source: - Shutdown while playing
el: - Τερματισμός κατά την αναπαραγωγή

# #14044
source: %i min
el: %i λεπτά

# #14045
source: %i sec
el: %i δευτ.

# #14051
source: Time format
el: Μορφή Ώρας

# #14052
source: Date format
el: Μορφή Ημ/νίας

# #14053
source: GUI filters
el: Φίλτρα Περιβάλλοντος Εργασίας (GUI)

# #14055
source: Use background scanning
el: Σάρωση στο παρασκήνιο

# #14056
source: Stop scan
el: Διακοπή σάρωσης

# #14057
source: Not possible while scanning for media info
el: Δεν είναι εφικτό κατά τη σάρωση πληροφοριών πολυμέσων

# #14058
source: Film grain effect
el: Εφέ Film Grain

# #14059
source: Search for thumbnails on remote shares
el: Έρευνα στους κοινόχρηστους πόρους για μικρογραφίες

# #14060
source: Unknown type cache - Internet
el: Άγνωστος τύπος λανθάνουσας μνήμης - Διαδίκτυο

# #14061
source: Auto
el: Αυτόματο/η

# #14062
source: Enter username for
el: Εισάγετε όνομα χρήστη για

# #14063
source: Date & time
el: Ημερομηνία & ώρα

# #14064
source: Set date
el: Ορισμός ημ/νίας

# #14065
source: Set time
el: Ορισμός ώρας

# #14066
source: Enter the time in 24 hour HH:MM format
el: Εισάγετε την ώρα σε 24ωρη μορφή ΩΩ:ΛΛ

# #14067
source: Enter the date in DD/MM/YYYY format
el: Εισάγετε την ημ/νία σε μορφή ΗΗ/MM/ΕΤΟΣ

# #14068
source: Enter the IP address
el: Εισάγετε την διεύθυνση ΙP

# #14069
source: Apply these settings now?
el: Εφαρμογή αυτών των ρυθμίσεων τώρα;

# #14070
source: Apply changes now
el: Εφαρμογή ρυθμίσεων τώρα

# #14071
source: Allow file renaming and deletion
el: Να επιτρέπεται η μετονομασία και η διαγραφή αρχείων

# #14074
source: Set timezone
el: Ορισμός ζώνης ώρας

# #14075
source: Use daylight saving time
el: Ενεργοποίηση θερινής ώρας

# #14076
source: Add to favourites
el: Προσθήκη στα αγαπημένα

# #14077
source: Remove from favourites
el: Αφαίρεση από τα αγαπημένα

# #14078
source: Colours
el: Χρώματα

# #14079
source: Timezone country
el: Ζώνη ώρας χώρας

# #14080
source: Timezone
el: Ζώνη ώρας

# #14081
source: File lists
el: Λίστες αρχείων

# #14082
source: Show EXIF picture information
el: Εμφάνιση πληροφοριών εικόνας (EXIF)

# #14083
source: Use a fullscreen window rather than true fullscreen
el: Χρήση μεγιστοποιημένου παραθύρου αντί πλήρους οθόνης

# #14084
source: Queue songs on selection
el: Επιλεγμένα τραγούδια στη λίστα αναμονής

# #14086
source: Playback
el: Αναπαραγωγή

# #14087
source: DVDs
el: DVD

# #14088
source: Play DVDs automatically
el: Αυτόματη αναπαραγωγή DVD

# #14089
source: Font to use for text subtitles
el: Γραμματοσειρά υποτίτλων

# #14090
source: International
el: Διεθνοποίηση

# #14091
source: Character set
el: Κωδικοποίηση χαρακτήρων

# #14092
source: Debugging
el: Καταγραφή σφαλμάτων

# #14093
source: Security
el: Ασφάλεια

# #14094
source: Input devices
el: Συσκευές εισόδου

# #14095
source: Power saving
el: Εξοικονόμηση ενέργειας

# #14096
source: Rip
el: Αντιγραφή

# #14097
source: Audio CD Insert Action
el: Ενέργεια κατά την είσοδο CD ήχου

# #14098
source: Play
el: Αναπαραγωγή

# #14099
source: Eject disc when CD ripping is complete
el: Εξαγωγή του δίσκου μετά την αντιγραφή του CD

# #14100
source: Stop ripping CD
el: Διακοπή αντιγραφής CD

# #14101
source: Acceleration
el: Επιτάχυνση

# #15012
source: Unavailable source
el: Μη διαθέσιμη πηγή

# #15013
source: What would you like to do with media items from %s
el: Τι επιθυμείτε να κάνετε με πολυμέσα από το %s ;

# #15014
source: Keep
el: Διατήρηση

# #15015
source: Remove
el: Αφαίρεση

# #15016
source: Games
el: Παιχνίδια

# #15019
source: Add
el: Προσθήκη

# #15052
source: Password
el: Κωδικός πρόσβασης

# #15100
source: Library
el: Συλλογή

# #15101
source: Database
el: Βάση δεδομένων

# #15102
source: * All albums
el: * Όλα τα άλμπουμ

# #15103
source: * All artists
el: * Όλοι οι καλλιτέχνες

# #15104
source: * All songs
el: * Όλα τα τραγούδια

# #15105
source: * All genres
el: * Όλα τα είδη

# #15107
source: Buffering...
el: Aποθήκευση...

# #15108
source: Navigation sounds
el: Ήχοι πλοήγησης

# #15109
source: Skin default
el: Προεπιλογή κελύφους

# #15111
source: Theme
el: Θέμα

# #15112
source: Default theme
el: Προεπιλεγμένο Θέμα

# #15207
source: Connected
el: Συνδεμένο

# #15208
source: Not connected
el: Αποσυνδεμένο

# #15213
source: Play using...
el: Άνοιγμα με...

# #15214
source: Use smoothed A/V synchronisation
el: Χρήση ομαλού συγχρονισμού A/V

# #15215
source: Hide file names in thumbs view
el: Απόκρυψη ονομάτων αρχείων στις Μικρογραφίες

# #15216
source: Play in party mode
el: Εκτέλεση σε λειτουργία party

# #15300
source: Path not found or invalid
el: Η διαδρομή δε βρέθηκε

# #15301
source: Could not connect to network server
el: Απέτυχε η σύνδεση με το διακομιστή δικτύου

# #15302
source: No servers found
el: Δεν βρέθηκαν διακομιστές

# #15303
source: Workgroup not found
el: Δεν βρέθηκε η ομάδα εργασίας

# #15310
source: Opening multi-path source
el: Άνοιγμα πηγής πολλαπλών διαδρομών

# #15311
source: Path:
el: Διαδρομή:

# #16000
source: General
el: Γενικά

# #16002
source: Internet lookup
el: Έρευνα στο Διαδίκτυο

# #16003
source: Player
el: Αναπαραγωγή

# #16004
source: Play media from disc
el: Αναπαραγωγή πολυμέσων από το δίσκο

# #16008
source: Enter new title
el: Εισαγωγή νέου τίτλου

# #16009
source: Enter the movie name
el: Εισαγωγή ονόματος ταινίας

# #16010
source: Enter the profile name
el: Εισαγωγή ονόματος προφίλ

# #16011
source: Enter the album name
el: Εισαγωγή ονόματος άλμπουμ

# #16012
source: Enter the playlist name
el: Εισαγωγή ονόματος λίστας αναπ/γής

# #16013
source: Enter new filename
el: Εισαγωγή νέου ονόματος αρχείου

# #16014
source: Enter folder name
el: Εισαγωγή ονόματος φακέλου

# #16015
source: Enter directory
el: Εισαγωγή φακέλου

# #16016
source: Available options: %A, %T, %N, %B, %D, %G, %Y, %F, %S
el: Διαθέσιμες επιλογές: %A, %T, %N, %B, %D, %G, %Y, %F, %S

# #16017
source: Enter search string
el: Εισαγωγή κειμένου αναζήτησης

# #16018
source: None
el: Καμία

# #16019
source: Auto select
el: Αυτόματη επιλογή

# #16020
source: De-interlace
el: Απόπλεξη

# #16022
source: Bob (inverted)
el: Bob (αντιστροφή)

# #16024
source: Cancelling...
el: Ακύρωση...

# #16025
source: Enter the artist name
el: Εισαγωγή ονόματος καλλιτέχνη

# #16026
source: Playback failed
el: Αποτυχία αναπαραγωγής

# #16027
source: One or more items failed to play.
el: Αποτυχία αναπαραγωγής ενός ή περισσότερων αντικειμένων.

# #16028
source: Enter value
el: Εισαγωγή τιμής

# #16029
source: Check the log file for details.
el: Για λεπτομέρειες ελέγξτε το αρχείο καταγραφής.

# #16030
source: Party mode aborted.
el: Η λειτουργία party ακυρώθηκε.

# #16031
source: No matching songs in the library.
el: Δεν υπάρχουν παρόμοια τραγούδια στη συλλογή.

# #16032
source: Could not initialise database.
el: Αδυναμία έναρξης βάσης δεδομένων.

# #16033
source: Could not open database.
el: Αποτυχία ανοίγματος βάσης δεδομένων.

# #16034
source: Could not get songs from database.
el: Αποτυχία λήψης τραγουδιών από τη βάση δεδομένων.

# #16035
source: Party mode playlist
el: Λίστα αναπ/γής σε λειτουργία party

# #16036
source: De-interlace (Half)
el: Απόπλεξη (κατά το ήμισυ)

# #16037
source: Deinterlace video
el: Απόπλεξη βίντεο (Deinterlace)

# #16038
source: Deinterlace method
el: Μέθοδος απόπλεξης

# #16039
source: Off
el: Ανενεργή

# #16040
source: Auto
el: Αυτόματη

# #16041
source: On
el: Ενεργή

# #16100
source: All Videos
el: Όλα τα βίντεο

# #16101
source: Unwatched
el: Μη προβληθέντα

# #16102
source: Watched
el: Προβληθέντα

# #16103
source: Mark as watched
el: Σήμανση ως προβληθέν

# #16104
source: Mark as unwatched
el: Σήμανση ως μη προβληθέν

# #16105
source: Edit title
el: Επεξεργασία τίτλου

# #16106
source: Manage...
el: Διαχείριση...

# #16107
source: Edit sort title
el: Επεξεργασία ταξινόμησης τίτλου

# #16200
source: Operation was aborted
el: Η διαδικασία ακυρώθηκε

# #16201
source: Copy failed
el: Αποτυχία αντιγραφής

# #16202
source: Failed to copy at least one file
el: Αποτυχία αντιγραφής τουλάχιστον ενός αρχείου

# #16203
source: Move failed
el: Αποτυχία μετακίνησης

# #16204
source: Failed to move at least one file
el: Αποτυχία μετακίνησης τουλάχιστον ενός αρχείου

# #16205
source: Delete failed
el: Αποτυχία διαγραφής

# #16206
source: Failed to delete at least one file
el: Αποτυχία διαγραφής τουλάχιστον ενός αρχείου

# #16300
source: Video scaling method
el: Μέθοδος προσαρμογής ανάλυσης βίντεο

# #16301
source: Nearest neighbour
el: Εγγύτερη προσέγγιση

# #16307
source: Bicubic (software)
el: Bicubic (λογισμικό)

# #16308
source: Lanczos (software)
el: Lanczos (λογισμικό)

# #16309
source: Sinc (software)
el: Sinc (λογισμικό)

# #16310
source: Temporal
el: Χρονική

# #16311
source: Temporal/Spatial
el: Χρονική/Χωρική

# #16312
source: (VDPAU)Noise Reduction
el: (VDPAU) Μείωση θορύβου

# #16313
source: (VDPAU)Sharpness
el: (VDPAU) Οξύτητα

# #16314
source: Inverse Telecine
el: Αντίστροφη Telecine

# #16315
source: Lanczos3 optimised
el: Lanczos3 βελτιστοποιημένο

# #16316
source: Auto
el: Αυτόματη

# #16317
source: Temporal (Half)
el: Χρονική (κατά το ήμισυ)

# #16318
source: Temporal/Spatial (Half)
el: Χρονική/Χωρική (κατά το ήμισυ)

# #16323
source: Spline36 optimised
el: Spline36 βελτιστοποιημένο

# #16324
source: Software Blend
el: Blend λογισμικού

# #16400
source: Post-processing
el: Μετα-επεξεργασία

# #17500
source: Display sleep timeout
el: Εμφάνιση του χρονικού ορίου αναστολής

# #17998
source: %i hours
el: %i ώρες

# #17999
source: %i days
el: %i μέρες

# #19000
source: Switch to channel
el: Μετάβαση στο κανάλι

# #19001
source: Separate the search words by using AND, OR and/or NOT.
el: Χωρίστε τους όρους αναζήτησης χρησιμοποιώντας AND, OR ή/και NOT.

# #19002
source: or use phrases to find an exact match, like "The wizard of Oz".
el: ή χρησιμοποιήστε φράσεις για ακριβείς αντιστοιχίες, όπως "The wizard of Oz".

# #19003
source: Find similar programs
el: Εύρεση παρόμοιων προγραμμάτων

# #19004
source: Importing EPG from clients
el: Λήψη EPG από τους πελάτες

# #19005
source: PVR stream information
el: Πληροφορίες ροής PVR

# #19006
source: Receiving device
el: Συσκευή λήψης

# #19007
source: Device status
el: Κατάσταση συσκευής

# #19008
source: Signal quality
el: Ποιότητα σήματος

# #19012
source: PVR Backend
el: Backend του PVR

# #19013
source: Free to air
el: Ελεύθερα κανάλια

# #19014
source: Fixed
el: Σταθερή

# #19015
source: Encryption
el: Κρυπτογράφηση

# #19016
source: PVR Backend %i - %s
el: Backend του PVR %i - %s

# #19017
source: TV recordings
el: Τηλεοπτικές εγγραφές

# #19018
source: Folder with channel icons
el: Φάκελος εικονιδίων καναλιών

# #19019
source: Channels
el: Κανάλια

# #19020
source: TV
el: Τηλεόραση

# #19021
source: Radio
el: Ραδιόφωνο

# #19022
source: Hidden
el: Κρυφά

# #19023
source: TV channels
el: Τηλεοπτικά κανάλια

# #19024
source: Radio channels
el: Ραδιοφωνικοί σταθμοί

# #19025
source: Upcoming recordings
el: Επερχόμενες εγγραφές

# #19026
source: Add timer...
el: Προσθήκη χρονοδιακόπτη...

# #19027
source: No search results
el: Κανένα αποτέλεσμα αναζήτησης

# #19028
source: No EPG entries
el: Καμία καταχώριση EPG

# #19029
source: Channel
el: Κανάλι

# #19030
source: Now
el: Τώρα

# #19031
source: Next
el: Μετά

# #19032
source: Timeline
el: Χρονοδιάγραμμα

# #19033
source: Information
el: Πληροφορίες

# #19034
source: Already started recording on this channel
el: Ήδη ξεκίνησε η εγγραφή σε αυτό το κανάλι

# #19035
source: %s could not be played. Check the log for details.
el: Το %s δεν ήταν δυνατό να αναπαραχθεί. Ελέγξτε το αρχείο καταγραφής για λεπτομέρειες.

# #19036
source: This recording cannot be played. Check the log for details.
el: Αδύνατη η αναπαραγωγή αυτής της εγγραφής.[CR]Ελέγξτε το αρχείο καταγραφής για λεπτομέρειες.

# #19037
source: Show signal quality
el: Εμφάνιση ποιότητας σήματος

# #19038
source: Not supported by the PVR backend.
el: Δεν υποστηρίζεται από το backend του PVR.

# #19039
source: Are you sure you want to hide this channel?
el: Σίγουρα επιθυμείτε να κρύψετε αυτό το κανάλι;

# #19040
source: Timer
el: Χρονοδιακόπτης

# #19041
source: Are you sure you want to rename this recording?
el: Είστε σίγουροι ότι θέλετε να μετονομάσετε αυτήν την εγγραφή;

# #19042
source: Are you sure you want to rename this timer?
el: Είστε σίγουροι ότι θέλετε να μετονομάσετε αυτό το χρονοδιακόπτη;

# #19043
source: Recording
el: Εγγραφή

# #19044
source: Please check your configuration or check the log for details.
el: Ελέγξτε τις ρυθμίσεις σας ή το αρχείο καταγραφής για λεπτομέρειες.

# #19045
source: No PVR clients have been started yet. Wait for the PVR clients to start up or check the log for details.
el: Δεν ξεκίνησε κανένας πελάτης PVR ακόμη. Περιμένετε να ξεκινήσουν ή ελέγξτε το αρχείο καταγραφής για λεπτομέρειες.

# #19046
source: New channel
el: Νέο κανάλι

# #19047
source: Programme info
el: Πληροφορίες προγράμματος

# #19048
source: Group management
el: Διαχείριση γκρουπ

# #19049
source: Show channel
el: Εμφάνιση καναλιού

# #19050
source: Show visible channels
el: Εμφάνιση φανερών καναλιών

# #19051
source: Show hidden channels
el: Εμφάνιση κρυφών καναλιών

# #19052
source: Move channel to:
el: Μετακίνηση καναλιού σε:

# #19053
source: Recording information
el: Πληροφορίες εγγραφής

# #19054
source: Hide channel
el: Απόκρυψη καναλιού

# #19055
source: No information available
el: Μη διαθέσιμες πληροφορίες

# #19056
source: New timer
el: Νέος χρονοδιακόπτης

# #19057
source: Edit timer
el: Ρύθμιση χρονοδιακόπτη

# #19058
source: Timer enabled
el: Ενεργοποιήθηκε ο χρονοδιακόπτης

# #19059
source: Stop recording
el: Διακοπή εγγραφής

# #19060
source: Delete timer
el: Διαγραφή χρονοδιακόπτη

# #19061
source: Add timer
el: Προσθήκη χρονοδιακόπτη

# #19062
source: Sort by: Channel
el: Ταξ.: Κανάλι

# #19063
source: Go to begin
el: Μετάβαση στην αρχή

# #19064
source: Go to end
el: Μετάβαση στο τέλος

# #19065
source: Default EPG window
el: Προεπιλεγμένο παράθυρο EPG

# #19066
source: Channel icons
el: Εικονίδια καναλιών

# #19067
source: This event is already being recorded.
el: Γίνεται ήδη εγγραφή αυτού του γεγονότος

# #19068
source: This recording could not be deleted. Check the log for details.
el: Αυτή η εγγραφή δεν ήταν δυνατό να διαγραφεί. Ελέγξτε το αρχείο καταγραφής για λεπτομέρειες.

# #19070
source: Go to now
el: Μετάβαση τώρα

# #19071
source: EPG update interval
el: Χρονικό διάστημα ενημέρωσης EPG

# #19072
source: Do not store the EPG in the database
el: Να μην αποθηκεύεται το EPG στη βάση δεδομένων

# #19073
source: Delay channel switch
el: Καθυστέρηση αλλαγής καναλιού

# #19074
source: Active:
el: Ενεργό:

# #19075
source: Name:
el: Όνομα:

# #19076
source: Folder:
el: Φάκελος:

# #19077
source: Radio:
el: Ραδιόφωνο:

# #19078
source: Channel:
el: Κανάλι:

# #19079
source: Day:
el: Ημέρα:

# #19080
source: Begin:
el: Έναρξη:

# #19081
source: End:
el: Λήξη:

# #19082
source: Priority:
el: Προτεραιότητα:

# #19083
source: Lifetime (days):
el: Χρόνος ζωής (ημέρες):

# #19084
source: First day:
el: Πρώτη ημέρα:

# #19085
source: Unknown channel %u
el: Άγνωστο κανάλι %u

# #19086
source: Mo-__-__-__-__-__-__
el: Δε-__-__-__-__-__-__

# #19087
source: __-Tu-__-__-__-__-__
el: __-Τρ-__-__-__-__-__

# #19088
source: __-__-We-__-__-__-__
el: __-__-Τε-__-__-__-__

# #19089
source: __-__-__-Th-__-__-__
el: __-__-__-Πε-__-__-__

# #19090
source: __-__-__-__-Fr-__-__
el: __-__-__-__-Πα-__-__

# #19091
source: __-__-__-__-__-Sa-__
el: __-__-__-__-__-Σα-__

# #19092
source: __-__-__-__-__-__-Su
el: __-__-__-__-__-__-Κυ

# #19093
source: Mo-Tu-We-Th-Fr-__-__
el: Δε-Τρ-Τε-Πε-Πα-__-__

# #19094
source: Mo-Tu-We-Th-Fr-Sa-__
el: Δε-Τρ-Τε-Πε-Πα-Σα-__

# #19095
source: Mo-Tu-We-Th-Fr-Sa-Su
el: Δε-Τρ-Τε-Πε-Πα-Σα-Κυ

# #19096
source: __-__-__-__-__-Sa-Su
el: __-__-__-__-__-Σα-Κυ

# #19097
source: Enter the name for the recording
el: Εισάγετε τίτλο για την εγγραφή

# #19098
source: Warning
el: Προσοχή

# #19099
source: Service
el: Υπηρεσία

# #19100
source: Mux
el: Μίξη

# #19101
source: Provider
el: Πάροχος

# #19102
source: Please switch to another channel.
el: Πηγαίνετε σε άλλο κανάλι.

# #19104
source: Enter the name of the folder for the recording
el: Εισάγετε το όνομα του φακέλου για την εγγραφή

# #19106
source: Next timer on
el: Επόμενος χρονοδιακόπτης την/το

# #19107
source: at
el: στις

# #19109
source: Couldn't save timer. Check the log for details.
el: Δεν ήταν δυνατόν να αποθηκευθεί ο χρονοδιακόπτης. Ελέγξτε το αρχείο καταγραφής για λεπτομέρειες.

# #19110
source: An unexpected error occurred. Try again later or check the log for details.
el: Προέκυψε ένα αναπάντεχο σφάλμα. Δοκιμάστε ξανά αργότερα ή ελέγξτε το αρχείο καταγραφής για λεπτομέρειες.

# #19111
source: PVR backend error. Check the log for details.
el: Σφάλμα του backend του PVR. Ελέγξτε το αρχείο καταγραφής για λεπτομέρειες.

# #19114
source: Version
el: Έκδοση

# #19115
source: Address
el: Διεύθυνση

# #19116
source: Disksize
el: Μέγεθος Δίσκου

# #19117
source: Search for channels
el: Αναζήτηση καναλιών

# #19118
source: Cannot use PVR functions while searching.
el: Δε γίνεται να χρησιμοποιηθούν οι λειτουργίες PVR κατά την αναζήτηση.

# #19119
source: On which server do you want to search?
el: Σε ποιο διακομιστή να γίνει αναζήτηση;

# #19120
source: Client number
el: Αριθμός Πελάτη

# #19121
source: Avoid repeats
el: Αποφυγή επαναλήψεων

# #19122
source: This timer is still recording. Are you sure you want to delete this timer?
el: Ο χρονοδιακόπτης ακόμη είναι σε εγγραφή. Είστε σίγουροι ότι θέλετε να τον διαγράψετε;

# #19123
source: Free to air channels only
el: Ελεύθερα κανάλια μόνο

# #19124
source: Ignore present timers
el: Να αγνοηθούν οι τρέχοντες χρονοδιακόπτες

# #19125
source: Ignore present recordings
el: Να αγνοηθούν οι τρέχουσες εγγραφές

# #19126
source: Start time
el: Από ώρα

# #19127
source: End time
el: Έως ώρα

# #19128
source: Start date
el: Από ημέρα

# #19129
source: End date
el: Έως ημέρα

# #19130
source: Minimum duration
el: Ελάχιστη διάρκεια

# #19131
source: Maximum duration
el: Μέγιστη διάρκεια

# #19132
source: Include unknown genres
el: Να συμπεριληφθούν άγνωστα είδη

# #19133
source: Search string
el: Όρος αναζήτησης

# #19134
source: Include description
el: Να συμπεριληφθεί η περιγραφή

# #19135
source: Case sensitive
el: Με διάκριση πεζών-κεφαλαίων

# #19136
source: Channel unavailable
el: Μη διαθέσιμο κανάλι

# #19137
source: No groups defined
el: Κανένα ορισμένο γκρουπ

# #19138
source: Please create a group first
el: Δημιουργήστε πρώτα ένα γκρουπ

# #19139
source: Name of the new group
el: Όνομα του νέου γκρουπ

# #19141
source: Group
el: Γκρουπ

# #19142
source: Search guide
el: Οδηγός αναζήτησης

# #19143
source: Group management
el: Διαχείριση γκρουπ

# #19144
source: No groups defined
el: Κανένα ορισμένο γκρουπ

# #19145
source: Grouped
el: Σε γκρουπ

# #19146
source: Groups
el: Γκρουπ

# #19147
source: The PVR backend does not support this action. Check the log for details.
el: Το backend του PVR δεν υποστηρίζει αυτήν την ενέργεια. Ελέγξτε το αρχείο καταγραφής για λεπτομέρειες.

# #19148
source: Channel
el: Κανάλι

# #19149
source: Mo
el: Δε

# #19150
source: Tu
el: Τρ

# #19151
source: We
el: Τε

# #19152
source: Th
el: Πε

# #19153
source: Fr
el: Πα

# #19154
source: Sa
el: Σα

# #19155
source: Su
el: Κυ

# #19156
source: from
el: από

# #19157
source: Next recording
el: Επόμενη εγγραφή

# #19158
source: Currently recording
el: Τρέχουσα εγγραφή

# #19159
source: from
el: από

# #19160
source: to
el: έως

# #19162
source: Recording active
el: Εγγραφή ενεργή

# #19163
source: Recordings
el: Εγγραφές
