Repository: xbmc/xbmc
Catalog: language/Greek/strings.po
Languages: el

# #10516
source: Music - Library
el: Μουσική - Συλλογή

# #10517
source: Now Playing - Music
el: Τώρα Εκτελείται - Μουσική

# #10522
source: Now Playing - Videos
el: Τώρα Εκτελείται - Βίντεο

# #10523
source: Album info
el: Πληροφορίες άλμπουμ

# #10524
source: Movie info
el: Πληροφορίες ταινίας

# #12000
source: Select dialogue
el: Παράθυρο επιλογής

# #12001
source: Music/Info
el: Μουσική/Πληροφορίες

# #12002
source: Dialogue OK
el: Παράθυρο ΟΚ

# #12003
source: Videos/Info
el: Βίντεο/Πληροφορίες

# #12004
source: Scripts/Info
el: Script/Πληροφορίες

# #12005
source: Fullscreen video
el: Βίντεο πλήρους οθόνης

# #12006
source: Audio visualisation
el: Μουσική οπτικοποίηση

# #12008
source: File stacking dialogue
el: Παράθυρο στοιβάγματος αρχείων

# #12009
source: Rebuild index...
el: Ανακατασκευή περιεχομένων...

# #12010
source: Return to music window
el: Επιστροφή στη μουσική

# #12011
source: Return to videos window
el: Επιστροφή στα βίντεο

# #12021
source: Start from beginning
el: Εκκίνηση από την αρχή

# #12022
source: Resume from %s
el: Συνέχιση από %s

# #12321
source: Ok
el: Επιλογή

# #12325
source: Locked! Enter code...
el: Κλειδώθηκε! Εισαγωγή κωδικού...

# #12326
source: Enter password
el: Εισαγωγή κωδικού πρόσβασης

# #12327
source: Enter master code
el: Εισαγωγή κεντρικού κωδικού

# #12328
source: Enter unlock code
el: Εισάγετε κωδικό ξεκλειδώματος

# #12329
source: or press C to cancel
el: ή πιέστε C για ακύρωση

# #12330
source: Enter gamepad button combo and
el: Εισάγετε συνδυασμό πλήκτρων (combo) και

# #12331
source: press OK, or Back to cancel
el: πιέστε 'Επιλογή', ή 'Επιστροφή' για ακύρωση

# #12332
source: Set lock
el: Ορισμός κλειδώματος

# #12333
source: Unlock
el: Ξεκλείδωμα

# #12334
source: Reset lock
el: Επανατοποθέτηση κλειδώματος

# #12335
source: Remove lock
el: Αφαίρεση κλειδώματος

# #12337
source: Numeric password
el: Αριθμητικός κωδικός πρόσβασης

# #12338
source: Gamepad button combo
el: Συνδυασμός πλήκτρων (combo) του μοχλού

# #12339
source: Full-text password
el: Κωδικός πρόσβασης πλήρους κειμένου

# #12340
source: Enter new password
el: Εισαγωγή νέου κωδικού πρόσβασης

# #12341
source: Re-Enter new password
el: Επανεισαγωγή νέου κωδικού πρόσβασης

# #12342
source: Incorrect password,
el: Λάθος κωδικός πρόσβασης,

# #12343
source: retries left
el: δοκιμές έμειναν

# #12344
source: Passwords entered did not match.
el: Οι κωδικοί δεν ταιριάζουν.

# #12345
source: Access denied
el: Δεν επιτρέπεται η πρόσβαση

# #12346
source: Password retry limit exceeded.
el: Οι προσπάθειες εισαγωγής κωδικού εξαντλήθηκαν.

# #12347
source: The system will now power down.
el: Το σύστημα θα απενεργοποιηθεί τώρα.

# #12348
source: Item locked
el: Το αντικείμενο κλειδώθηκε

# #12349
source: Updating video library art
el: Ενημέρωση εικόνων συλλογής βίντεο

# #12350
source: Processing %s
el: Επεξεργασία %s

# #12351
source: The art cache in your video library needs updating.
el: Οι εικόνες της συλλογής βίντεο χρειάζονται ενημέρωση.

# #12352
source: No downloading is needed.
el: Δεν απαιτείται λήψη αρχείων.

# #12353
source: Reactivate lock
el: Επανενεργοποίηση κλειδώματος

# #12354
source: Would you like to update it now?
el: Να γίνει ενημέρωση τώρα;

# #12356
source: Change lock
el: Αλλαγή κλειδώματος

# #12357
source: Source lock
el: Κλείδωμα πηγής

# #12358
source: Password entry was blank. Try again.
el: Το πεδίο του κωδικού ήταν κενό. Δοκιμάστε ξανά.

# #12360
source: Master lock
el: Κεντρικό κλείδωμα

# #12362
source: Shutdown system if Master Lock retries exceeded
el: Απενεργοποίηση συστήματος όταν εξαντληθούν οι προσπάθειες εισόδου

# #12367
source: Master code is not valid
el: Ο κεντρικός κωδικός δεν είναι έγκυρος

# #12368
source: Please enter a valid master code
el: Παρακαλώ εισάγετε έναν έγκυρο κεντρικό κωδικό

# #12373
source: Settings & file manager
el: Ρυθμίσεις & διαχείριση αρχείων

# #12376
source: Set as default for all videos
el: Ορισμός ως προεπιλογή για όλα τα βίντεο

# #12377
source: This will reset any previously saved values
el: Θα διαγραφούν όλες οι αποθηκευμένες τιμές

# #12378
source: Amount of time to display each image
el: Χρονικό διάστημα προβολής κάθε εικόνας

# #12379
source: Use pan and zoom effects
el: Εφέ προσαρμογής αναλογιών σήματος (pan & zoom)

# #12383
source: 12 hour clock
el: Ρολόι 12 ωρών

# #12384
source: 24 hour clock
el: Ρολόι 24 ωρών

# #12385
source: Day/Month
el: Μέρα/Μήνας

# #12386
source: Month/Day
el: Μήνας/Μέρα

# #12390
source: System uptime
el: Χρόνος λειτουργίας συστήματος

# #12391
source: Minutes
el: Λεπτά

# #12392
source: Hours
el: Ώρες

# #12393
source: Days
el: Μέρες

# #12394
source: Total uptime
el: Συνολικός χρόνος λειτουργίας

# #12395
source: Battery level
el: Επίπεδο φόρτισης

# #12600
source: Weather
el: Καιρός

# #12900
source: Screensaver
el: Προφύλαξη οθόνης

# #12901
source: Fullscreen OSD
el: Απεικονίσεις πλήρους οθόνης (OSD)

# #13000
source: System
el: Σύστημα

# #13001
source: Immediate HD spindown
el: Άμεση ελάττωση περιστροφής (Spindown)

# #13002
source: Video only
el: Βίντεο μόνο

# #13003
source: - Delay
el: - Καθυστέρηση

# #13004
source: - Minimum file duration
el: - Ελάχιστη διάρκεια αρχείου

# #13005
source: Shutdown
el: Τερματισμός

# #13008
source: Shutdown function
el: Λειτουργία τερματισμού

# #13009
source: Quit
el: Έξοδος

# #13010
source: Hibernate
el: Αδρανοποίηση

# #13011
source: Suspend
el: Αναστολή

# #13012
source: Exit
el: Έξοδος

# #13013
source: Reboot
el: Επανεκκίνηση

# #13014
source: Minimise
el: Ελαχιστοποίηση

# #13015
source: Power button action
el: Λειτουργία πλήκτρου τροφοδοσίας

# #13016
source: Power off System
el: Απενεργοποίηση

# #13017
source: Inhibit idle shutdown
el: Αποτροπή τερματισμού λόγω αδράνειας

# #13018
source: Allow idle shutdown
el: Να επιτρέπεται τερματισμός λόγω αδράνειας

# #13020
source: Is another session active, perhaps over ssh?
el: Είναι ενεργή άλλη συνεδρία, ίσως μέσω ssh;

# #13021
source: Mounted removable harddrive
el: Προσαρτήθηκε αφαιρούμενος δίσκος

# #13022
source: Unsafe device removal
el: Μη ασφαλής αφαίρεση συσκευής

# #13023
source: Successfully removed device
el: Η συσκευή αφαιρέθηκε επιτυχώς

# #13024
source: Joystick plugged
el: Συνδέθηκε χειριστήριο

# #13025
source: Joystick unplugged
el: Αποσυνδέθηκε χειριστήριο

# #13026
source: Try to wake remote servers on access
el: Να γίνει προσπάθεια αφύπνισης των απομακρυσμένων διακομιστών με την πρόσβαση

# #13027
source: Wake on Lan (%s)
el: Αφύπνιση μέσω LAN (%s)

# #13028
source: Waiting for network to connect...
el: Αναμονή για σύνδεση του δικτύου...

# #13029
source: Failed to execute Wake on Lan!
el: Αποτυχία Αφύπνισης μέσω LAN!

# #13030
source: Waiting for server to wake up...
el: Αναμονή για αφύπνιση του διακομιστή...

# #13031
source: Extended wait for server to wake up...
el: Εκτεταμένη αναμονή για αφύπνιση του διακομιστή...

# #13032
source: Waiting for services to launch...
el: Αναμονή για εκτέλεση των υπηρεσιών...

# #13033
source: MAC Discovery
el: Εντοπισμός MAC

# #13034
source: Updated for %s
el: Αναβάθμιση για %s

# #13035
source: Found for %s
el: Εντοπισμός για %s

# #13036
source: Failed for %s
el: Αποτυχία για %s

# #13050
source: Running low on battery
el: Έχει αποφορτιστεί η μπαταρία

# #13100
source: Flicker filter
el: Φίλτρο Flicker (τρεμόπαιγμα οθόνης)

# #13101
source: Let driver choose (requires restart)
el: Αφήστε τον οδηγό να επιλέξει (απαιτεί επανεκκίνηση)

# #13105
source: Vertical blank sync
el: Κατακόρυφος χρονισμός

# #13106
source: Disabled
el: Ανενεργός

# #13107
source: Enabled during video playback
el: Ενεργός κατά την αναπαραγωγή βίντεο

# #13108
source: Always enabled
el: Πάντα ενεργός

# #13109
source: Test & apply resolution
el: Δοκιμή & εφαρμογή ανάλυσης

# #13110
source: Save resolution?
el: Αποθήκευση ανάλυσης;

# #13111
source: Would you like to keep this change?
el: Επιθυμείτε να διατηρήσετε αυτήν την αλλαγή;

# #13112
source: High quality upscaling
el: Υψηλής ποιότητας upscaling

# #13113
source: Disabled
el: Ανενεργό

# #13114
source: Enabled for SD content
el: Ενεργό για περιεχόμενο SD

# #13115
source: Always enabled
el: Πάντα ενεργό

# #13116
source: Upscaling method
el: Μέθοδος upscaling

# #13121
source: VDPAU HQ Upscaling level
el: VDPAU HQ επίπεδο Upscaling

# #13122
source: VDPAU Studio level colour conversion
el: VDPAU μετατροπή χρώματος επιπέδου Στούντιο

# #13123
source: Keep skin?
el: Διατήρηση κελύφους;

# #13130
source: Blank other displays
el: Κενό σε άλλες οθόνες

# #13131
source: Disabled
el: Ανενεργή

# #13132
source: Blank displays
el: Κενές οθόνες

# #13140
source: Active connections detected!
el: Έχουν ανιχνευτεί ενεργές συνδέσεις!

# #13141
source: If you proceed, you might not be able to control Kodi
el: Αν συνεχίσετε, μπορεί να χάσετε τον έλεγχο του Kodi.

# #13142
source: any longer. Are you sure you want to stop the Event server?
el: Να διακοπεί η λειτουργία του απομακρυσμένου διακομιστή συμβάντων;

# #13144
source: Change Apple Remote mode?
el: Αλλαγή λειτουργίας του Χειριστηρίου Apple;

# #13145
source: If you are currently using the Apple Remote to control
el: Εάν χρησιμοποιείτε τώρα το Χειριστήριο Apple για να

# #13146
source: Kodi, changing this setting might affect your ability
el: ελέγχετε το Kodi, η αλλαγή αυτής της ρύθμισης θα επηρεάσει

# #13147
source: to continue controlling it. Do you want to proceed?
el: την ικανότητα ελέγχου του. Θέλετε να συνεχίσετε;

# #13159
source: Subnet mask
el: Μάσκα Υποδικτύου

# #13160
source: Gateway
el: Πύλη

# #13161
source: Primary DNS
el: Πρωτεύον DNS

# #13162
source: Initialise failed
el: Αποτυχία έναρξης

# #13170
source: Never
el: Ποτέ

# #13171
source: Immediately
el: Αμέσως

# #13172
source: After %i secs
el: Μετά από %i δευτ.

# #13173
source: HDD install date:
el: Ημερομηνία εγκατάστασης HDD:

# #13174
source: HDD power cycle count:
el: Πλήθος κύκλων ενέργειας HDD:

# #13200
source: Profiles
el: Προφίλ

# #13201
source: Delete profile '%s'?
el: Διαγραφή προφίλ '%s';

# #13204
source: Last loaded profile:
el: Προηγούμενο προφίλ:

# #13205
source: Unknown
el: Άγνωστο

# #13206
source: Overwrite
el: Αντικατάσταση

# #13208
source: Alarm clock
el: Ξυπνητήρι

# #13209
source: Alarm clock interval (in minutes)
el: Διάρκεια κουδουνισμού (σε λεπτά)

# #13210
source: Started, alarm in %im
el: Εκκίνηση ξυπνητηριού σε %i λεπτά

# #13211
source: Alarm!
el: Συναγερμός!

# #13212
source: Cancelled with %im%is left
el: Ακυρώθηκε με %i λεπτά %i δευτ. να απομένουν

# #13213
source: %2.0fm
el: %2.0f λεπτά

# #13214
source: %2.0fs
el: %2.0f δευτ.

# #13249
source: Search for subtitles in RARs
el: Αναζήτηση υποτίτλων σε RAR

# #13250
source: Browse for subtitle...
el: Αναζήτηση για υπότιτλο...

# #13251
source: Move item
el: Μετακίνηση αντικειμένου

# #13252
source: Move item here
el: Μετακίνηση αντικειμένου εδώ

# #13253
source: Cancel move
el: Ακύρωση μετακίνησης

# #13270
source: Hardware:
el: Υλικό:

# #13271
source: CPU Usage:
el: Χρήση CPU:

# #13274
source: Connected, but no DNS is available.
el: Συνδέθηκε, αλλά δεν υπάρχει διαθέσιμη DNS.

# #13275
source: Hard Disk
el: Σκληρός δίσκος

# #13277
source: Storage
el: Μέσα αποθήκευσης

# #13278
source: Default
el: Προεπιλογή

# #13279
source: Network
el: Δίκτυο

# #13280
source: Video
el: Βίντεο

# #13281
source: Hardware
el: Υλικό

# #13283
source: Operating system:
el: Λειτουργικό σύστημα:

# #13284
source: CPU speed:
el: Ταχύτητα CPU:

# #13286
source: Video encoder:
el: Κωδικοποιητής βίντεο:

# #13287
source: Screen resolution:
el: Ανάλυση οθόνης:

# #13292
source: A/V cable:
el: Καλώδιο A/V:

# #13294
source: DVD region:
el: Περιοχή DVD:

# #13295
source: Internet:
el: Διαδίκτυο:

# #13296
source: Connected
el: Συνδέθηκε

# #13297
source: Not connected. Check network settings.
el: Δε συνδέθηκε. Ελέγξτε τις ρυθμίσεις δικτύου.

# #13299
source: Target temperature
el: Επιθυμητή θερμοκρασία

# #13300
source: Fan speed
el: Ταχύτητα ανεμιστήρα

# #13301
source: Auto temperature control
el: Αυτόματος έλεγχος θερμοκρασίας

# #13302
source: Fan speed override
el: Παράκαμψη ταχύτητας ανεμιστήρα

# #13303
source: Fonts
el: Γραμματοσειρές

# #13304
source: Enable flipping bi-directional strings
el: Ενεργοποίηση αμφίδρομης κατεύθυνσης

# #13305
source: Show RSS news feeds
el: Εμφάνιση ροής τίτλων ειδήσεων (RSS)

# #13306
source: Show parent folder items
el: Εμφάνιση περιεχομένων αρχικού φακέλου

# #13307
source: Track naming template
el: Πρότυπο ονομασίας τραγουδιών

# #13308
source: Do you wish to reboot your system
el: Επιθυμείτε επανεκκίνηση του συστήματος

# #13309
source: instead of just Kodi?
el: και όχι μόνο του Kodi;

# #13310
source: Zoom effect
el: Εφέ μεγέθυνσης

# #13311
source: Float effect
el: Εφέ κίνησης

# #13312
source: Black bar reduction
el: Ελαχιστοποίηση μαύρης μπάρας

# #13313
source: Restart
el: Επανεκκίνηση

# #13314
source: Crossfade between songs
el: Βαθμιαία εξασθένιση μεταξύ των τραγουδιών

# #13315
source: Regenerate thumbnails
el: Επαναδημιουργία μικρογραφιών

# #13316
source: Recursive thumbnails
el: Μικρογραφίες και σε υποφακέλους

# #13317
source: View slideshow
el: Παρουσίαση διαφανειών

# #13318
source: Recursive slideshow
el: Παρουσίαση διαφανειών και των υποφακέλων

# #13319
source: Randomise
el: Τυχαία σειρά

# #13320
source: Stereo
el: Στερεοφωνικά

# #13321
source: Left only
el: Αριστερό μόνο

# #13322
source: Right only
el: Δεξί μόνο

# #13323
source: Enable karaoke support
el: Ενεργοποίηση υποστήριξης καραόκε

# #13324
source: Background transparency
el: Διαφάνεια υποβάθρου

# #13325
source: Foreground transparency
el: Διαφάνεια προσκηνίου

# #13326
source: A/V delay
el: Καθυστέρηση A/V

# #13327
source: Karaoke
el: Καραόκε

# #13328
source: %s not found
el: Το %s δε βρέθηκε

# #13329
source: Error opening %s
el: Σφάλμα κατά το άνοιγμα του %s

# #13330
source: Unable to load %s
el: Αδυναμία φόρτωσης %s

# #13331
source: Error: Out of memory
el: Σφάλμα: Έλλειψη μνήμης

# #13332
source: Move up
el: Μετακίνηση πάνω

# #13333
source: Move down
el: Μετακίνηση κάτω

# #13334
source: Edit label
el: Επεξεργασία ετικέτας

# #13335
source: Make default
el: Να γίνει προεπιλογή

# #13336
source: Remove button
el: Απαλοιφή πλήκτρου

# #13340
source: Leave as is
el: Να μείνει ως έχει

# #13341
source: Green
el: Πράσινο

# #13342
source: Orange
el: Πορτοκαλί

# #13343
source: Red
el: Κόκκινο

# #13344
source: Cycle
el: Κύκλος

# #13345
source: Switch LED off on playback
el: Απενεργοποίηση λυχνίας (LED) κατά την αναπαραγωγή

# #13346
source: Movie information
el: Πληροφορίες ταινίας

# #13347
source: Queue item
el: Αντικείμενο σε αναμονή

# #13348
source: Search IMDb...
el: Αναζήτηση στο IMDb...

# #13349
source: Scan for new content
el: Έρευνα για νέο περιεχόμενο

# #13350
source: Current playlist
el: Τρέχουσα λίστα αναπ/γής

# #13351
source: Album information
el: Πληροφορίες άλμπουμ

# #13352
source: Scan item to library
el: Σάρωση αντικειμένου στη συλλογή

# #13353
source: Stop scanning
el: Διακοπή σάρωσης

# #13354
source: Render method
el: Μέθοδος απόδοσης

# #13355
source: Low quality pixel shader
el: Χαμηλής ποιότητας σκίαση pixel

# #13356
source: Hardware overlays
el: Επικαλύψεις υλικού

# #13357
source: High quality pixel shader
el: Υψηλής ποιότητας σκίαση pixel

# #13358
source: Play item
el: Αναπαραγωγή αντικειμένου

# #13359
source: Set artist thumb
el: Ορισμός μικρογραφίας καλλιτέχνη

# #13360
source: Automatically generate thumbnails
el: Αυτόματη δημιουργία μικρογραφιών

# #13361
source: Enable voice
el: Ενεργοποίηση φωνής

# #13375
source: Enable device
el: Ενεργοποίηση συσκευής

# #13376
source: Volume
el: Ένταση

# #13377
source: Default view mode
el: Προεπιλεγμένος τύπος προβολής

# #13378
source: Default brightness
el: Προεπιλεγμένη φωτεινότητα

# #13379
source: Default contrast
el: Προεπιλεγμένη αντίθεση

# #13380
source: Default gamma
el: Προεπιλεγμένος συντελεστής γάμμα

# #13381
source: Resume video
el: Συνέχιση βίντεο

# #13382
source: Voice mask - Port 1
el: Μάσκα φωνής - Θύρα 1

# #13383
source: Voice mask - Port 2
el: Μάσκα φωνής - Θύρα 2

# #13384
source: Voice mask - Port 3
el: Μάσκα φωνής - Θύρα 3

# #13385
source: Voice mask - Port 4
el: Μάσκα φωνής - Θύρα 4

# #13386
source: Use time based seeking
el: Αναζήτηση βάσει χρόνου

# #13387
source: Track naming template - right
el: Πρότυπο ονομασίας τραγουδιών - δεξιά

# #13388
source: Preset
el: Προρύθμιση

# #13389
source: There are no presets available for this visualisation
el: Δεν υπάρχουν διαθέσιμες προρυθμίσεις γι' αυτήν την οπτικοποίηση

# #13390
source: There are no settings available for this visualisation
el: Δεν υπάρχουν διαθέσιμες ρυθμίσεις γι' αυτήν την οπτικοποίηση

# #13391
source: Eject/Load
el: Εξαγωγή/Φόρτωση

# #13392
source: Use visualisation if playing audio
el: Χρήση οπτικοποιήσεων κατά την αναπαραγωγή ήχου

# #13393
source: Calculate size
el: Υπολογισμός μεγέθους

# #13394
source: Calculating folder size
el: Υπολογισμός μεγέθους φακέλου

# #13395
source: Video settings
el: Ρυθμίσεις βίντεο

# #13396
source: Audio and subtitle settings
el: Ρυθμίσεις ήχου/υποτίτλων

# #13397
source: Enable subtitles
el: Ενεργοποίηση υποτίτλων

# #13398
source: Shortcuts
el: Συντομεύσεις

# #13399
source: Ignore articles when sorting (e.g. "the")
el: Να αγνοούνται τα άρθρα κατά την ταξινόμηση (π.χ. το "The")

# #13400
source: Crossfade between songs on the same album
el: Βαθμιαία εξασθένιση μεταξύ τραγουδιών του ίδιου άλμπουμ

# #13401
source: Browse for %s
el: Αναζήτηση για %s

# #13402
source: Show track position
el: Εμφάνιση της θέσης του τραγουδιού

# #13403
source: Clear default
el: Απαλοιφή προεπιλογών

# #13404
source: Resume
el: Συνέχιση

# #13405
source: Get thumb
el: Λήψη μικρογραφίας

# #13406
source: Picture information
el: Πληροφορίες εικόνας

# #13407
source: %s presets
el: %s προρυθμίσεις

# #13408
source: (IMDb user rating)
el: (Αξιολόγηση IMDb)

# #13409
source: Top 250
el: 250 κορυφαία

# #13410
source: Tune in on Last.fm
el: Συντονισμός στο Last.fm

# #13411
source: Minimum fan speed
el: Ελάχιστη ταχύτητα ανεμιστήρα

# #13412
source: Play from here
el: Αναπαραγωγή από εδώ

# #13413
source: Downloading
el: Λήψη

# #13414
source: Include artists who appear only on compilations
el: Συμπερίληψη καλλιτεχνών που εμφανίζονται μόνο σε συνθέσεις

# #13415
source: Render method
el: Μέθοδος απόδοσης

# #13416
source: Auto detect
el: Αυτόματη ανίχνευση

# #13417
source: Basic shaders (ARB)
el: Στοιχειώδεις σκιαστές (ARB)

# #13418
source: Advanced shaders (GLSL)
el: Προηγμένοι σκιαστές (GLSL)

# #13419
source: Software
el: Λογισμικό

# #13420
source: Remove safely
el: Ασφαλής κατάργηση

# #13422
source: Start slideshow here
el: Παρουσίαση διαφανειών από εδώ

# #13423
source: Remember for this path
el: Απομνημόνευση για αυτή τη διαδρομή

# #13424
source: Use pixel buffer objects
el: Χρήση αντικειμένων προσωρινής μνήμης pixel

# #13425
source: Allow hardware acceleration (VDPAU)
el: Χρήση επιτάχυνσης υλικού (VDPAU)

# #13426
source: Allow hardware acceleration (VAAPI)
el: Χρήση επιτάχυνσης υλικού (VAAPI)

# #13427
source: Allow hardware acceleration (DXVA2)
el: Χρήση επιτάχυνσης υλικού (DXVA2)

# #13428
source: Allow hardware acceleration (CrystalHD)
el: Χρήση επιτάχυνσης υλικού (CrystalHD)

# #13429
source: Allow hardware acceleration (VDADecoder)
el: Χρήση επιτάχυνσης υλικού (VDADecoder)

# #13430
source: Allow hardware acceleration (OpenMax)
el: Χρήση επιτάχυνσης υλικού (OpenMax)

# #13431
source: Pixel Shaders
el: Σκιάσεις Pixel

# #13432
source: Allow hardware acceleration (VideoToolbox)
el: Χρήση επιτάχυνσης υλικού (VideoToolbox)

# #13433
source: Play the next video automatically
el: Αναπαραγωγή του επόμενου βίντεο αυτόματα

# #13434
source: Play only this
el: Αναπαραγωγή μόνο αυτού

# #13435
source: Enable HQ Scalers for scalings above
el: Ενεργοποίηση HQ Scalers για προσαρμογή ανάλυσης πάνω από

# #13436
source: Allow hardware acceleration (libstagefright)
el: Να επιτρέπεται επιτάχυνση υλικού (libstagefright)

# #13437
source: Prefer VDPAU Video Mixer
el: Προτίμηση του Μείκτη Βίντεο VDPAU

# #13438
source: Allow hardware acceleration (amcodec)
el: Να επιτρέπεται επιτάχυνση υλικού (amcodec)

# #13439
source: Allow hardware acceleration (MediaCodec)
el: Να επιτρέπεται επιτάχυνση υλικού (MediaCodec)

# #13440
source: Allow multi threaded software decoding
el: Να επιτρέπεται η πολυνηματική αποκωδικοποίηση λογισμικού

# #13441
source: Use Mpeg-2 VDPAU
el: Χρήση Mpeg-2 VDPAU

# #13442
source: Enable this option to use hardware acceleration for Mpeg-(1/2) codecs. If disabled the CPU will be used instead. Older Radeon Cards tend to segfault with this enabled.
el: Ενεργοποιήστε αυτήν την επιλογή για χρήση της κάρτας γραφικών για κωδικοποίηση Mpeg-(1/2). Αν απενεργοποιηθεί, θα χρησιμοποιηθεί ο επεξεργαστής. Παλαιότερες κάρτες Radeon τείνουν να παρουσιάζουν προβλήματα με αυτήν την επιλογή.

# #13443
source: Use Mpeg-4 VDPAU
el: Χρήση Mpeg-4 VDPAU

# #13444
source: Enable this option to use hardware acceleration for the Mpeg-4 codec. If disabled the CPU will be used instead. Some ION Hardware has problems with this being enabled by default.
el: Ενεργοποιήστε αυτήν την επιλογή για χρήση της κάρτας γραφικών για κωδικοποίηση Mpeg-4. Αν απενεργοποιηθεί, θα χρησιμοποιηθεί ο επεξεργαστής. Κάποιες κάρτες ION τείνουν να παρουσιάζουν προβλήματα με αυτήν την επιλογή.

# #13445
source: Use VC-1 VDPAU
el: Χρήση VC-1 VDPAU

# #13446
source: Enable this option to use hardware acceleration for VC-1 based codecs. If disabled the CPU will be used instead. AMD Hardware with VDPAU cannot decode VC-1 Simple.
el: Ενεργοποιήστε αυτήν την επιλογή για χρήση της κάρτας γραφικών για κωδικοποίηση τύπου VC-1. Αν απενεργοποιηθεί, θα χρησιμοποιηθεί ο επεξεργαστής. Κάρτες AMD με VDPAU δεν μπορούν να αποκωδικοποιήσουν το VC-1 Simple.

# #13447
source: Use Mpeg-2 VAAPI
el: Χρήση Mpeg-2 VAAPI

# #13448
source: Enable this option to use hardware acceleration for Mpeg-(1/2) codecs. If disabled the CPU will be used instead. Some Mpeg-2 Videos might have green artifacts.
el: Ενεργοποιήστε αυτήν την επιλογή για χρήση της κάρτας γραφικών για κωδικοποίηση Mpeg-(1/2). Αν απενεργοποιηθεί, θα χρησιμοποιηθεί ο επεξεργαστής. Κάποια βίντεο Mpeg-2 ενδέχεται να εμφανίζουν πράσινα κομμάτια.

# #13449
source: Use Mpeg-4 VAAPI
el: Χρήση Mpeg-4 VAAPI

# #13450
source: Enable this option to use hardware acceleration for the Mpeg-4 codec. If disabled the CPU will be used instead.
el: Ενεργοποιήστε αυτήν την επιλογή για χρήση της κάρτας γραφικών για κωδικοποίηση Mpeg-4. Αν απενεργοποιηθεί, θα χρησιμοποιηθεί ο επεξεργαστής.

# #13451
source: Use VC-1 VAAPI
el: Χρήση VC-1 VAAPI

# #13452
source: Enable this option to use hardware acceleration for VC-1 based codecs. If disabled the CPU will be used instead. Especially VC-1 Interlaced fails hard on Intel hardware.
el: Ενεργοποιήστε αυτήν την επιλογή για χρήση της κάρτας γραφικών για κωδικοποίηση τύπου VC-1. Αν απενεργοποιηθεί, θα χρησιμοποιηθεί ο επεξεργαστής. Έντονα πεπλεγμένα βίντεο (Interlaced) κωδικοποίησης VC-1 τείνουν να κρασάρουν με κάρτες Intel.

# #13454
source: Decoding method
el: Μέθοδος αποκωδικοποίησης

# #13455
source: Software
el: Λογισμικό

# #13456
source: Hardware accelerated
el: Επιτάχυνση υλικού

# #13500
source: A/V sync method
el: Μέθοδος συγχρονισμού A/V

# #13501
source: Audio clock
el: Χρονισμός ήχου

# #13502
source: Video clock (Drop/Dupe audio)
el: Χρονισµός βίντεο (εις βάρος του ήχου)

# #13503
source: Video clock (Resample audio)
el: Χρονισμός βίντεο (εκ νέου δειγματοληψία ήχου)

# #13504
source: Maximum speedup/slowdown amount (%)
el: Μέγιστο ποσοστό επιτάχυνσης/επιβράδυνσης (%)

# #13505
source: Resample quality
el: Ποιότητα επανάληψης δειγματοληψίας

# #13506
source: Low(fast)
el: Χαμηλή(γρήγορη)

# #13507
source: Medium
el: Μεσαία

# #13508
source: High
el: Υψηλή

# #13509
source: Really high(slow!)
el: Πραγματικά υψηλή(αργή!)
