Repository: xbmc/xbmc
Catalog: language/Greek/strings.po
Languages: el

# #20154
source: Summary information
el: Συνοπτικές πληροφορίες

# #20155
source: Storage information
el: Πληροφορίες αποθηκευτικού χώρου

# #20156
source: Hard disk information
el: Πληροφορίες σκληρού δίσκου

# #20157
source: DVD-ROM information
el: Πληροφορίες DVD-ROM

# #20158
source: Network information
el: Πληροφορίες δικτύου

# #20159
source: Video information
el: Πληροφορίες βίντεο

# #20160
source: Hardware information
el: Πληροφορίες υλικού

# #20161
source: Total
el: Συνολικά

# #20162
source: Used
el: Χρησιμοποιημένα

# #20163
source: of
el: από τα

# #20164
source: Locking not supported
el: Δεν υποστηρίζεται κλείδωμα

# #20165
source: Not locked
el: Ξεκλείδωτος

# #20166
source: Locked
el: Κλειδωμένος

# #20167
source: Frozen
el: Παγωμένος

# #20168
source: Requires reset
el: Απαιτεί επανεκκίνηση

# #20169
source: Week
el: Εβδομάδα

# #20170
source: Line
el: Γραμμή

# #20171
source: Windows network (SMB)
el: Δίκτυο Windows (SMB)

# #20172
source: XBMSP server
el: Διακομιστής XBMSP

# #20173
source: FTP server
el: Διακομιστής FTP

# #20174
source: iTunes music share (DAAP)
el: Διαμοίραση μουσικής iTunes (DAAP)

# #20175
source: UPnP server
el: Διακομιστής UPnP

# #20176
source: Show video info
el: Εμφάνιση πληροφοριών για το βίντεο

# #20177
source: Done
el: Τέλος

# #20180
source: Symbols
el: Σύμβολα

# #20181
source: Backspace
el: Διαγραφή

# #20182
source: Space
el: Κενό

# #20183
source: Reload skin
el: Επαναφόρτωση κελύφους

# #20184
source: Rotate pictures using EXIF information
el: Περιστροφή εικόνων που χρησιμοποιούν πληροφορίες EXIF

# #20185
source: Use poster view styles for TV shows
el: Χρήση στυλ αφισών για τις τηλ. σειρές

# #20186
source: Please wait
el: Απασχολημένο

# #20188
source: Announce library updates via UPnP
el: Αναγγελία ενημερώσεων της συλλογής μέσω UPnP

# #20189
source: Enable auto scrolling for plot & review
el: Ενεργοποίηση αυτόματης κύλισης για πλοκή & κριτική

# #20190
source: Custom
el: Προσαρμογή

# #20191
source: Enable debug logging
el: Ενεργοποίηση καταγραφής σφαλμάτων (debug log)

# #20192
source: Download additional information during updates
el: Λήψη πρόσθετων πληροφοριών κατά τις ενημερώσεις συλλογής

# #20193
source: Default service for album information
el: Προεπιλεγμένη υπηρεσία πληροφοριών άλμπουμ

# #20194
source: Default service for artist information
el: Προεπιλεγμένη υπηρεσία πληροφοριών καλλιτέχνη

# #20195
source: Change scraper
el: Αλλαγή scraper

# #20196
source: Export music library
el: Εξαγωγή μουσικής συλλογής

# #20197
source: Import music library
el: Εισαγωγή μουσικής συλλογής

# #20198
source: No artist found!
el: Δεν βρέθηκε ο καλλιτέχνης!

# #20199
source: Downloading artist info failed
el: Αποτυχία λήψης πληροφοριών καλλιτέχνη

# #20220
source: Override song tags with online information
el: Παράκαμψη ετικετών τραγουδιών με πληροφορίες από το διαδίκτυο

# #20221
source: With this enabled, any information that is downloaded for albums and artists will override anything you have set in your song tags, such as genres, year, song artists etc. Useful if you have MusicBrainz identifiers in your song tags.
el: Αν το ενεργοποιήσετε, κάθε πληροφορία που θα ληφθεί από το διαδίκτυο σχετικά με άλμπουμ και καλλιτέχνες θα παρακάμψει ό,τι έχετε ορίσει στις ετικέτες των τραγουδιών σας, όπως είναι το είδος, το έτος, τα ονόματα καλλιτεχνών, κτλ. Χρήσιμο όταν έχετε τα αναγνωριστικά MusicBrainz στις ετικέτες των τραγουδιών σας.

# #20240
source: Android music
el: Μουσική Android

# #20241
source: Android videos
el: Βίντεο Android

# #20242
source: Android pictures
el: Εικόνες Android

# #20243
source: Android photos
el: Φωτογραφίες Android

# #20244
source: Android Apps
el: Εφαρμογές Android

# #20250
source: Party on! (videos)
el: Party on! (βίντεο)

# #20251
source: Mixing drinks (videos)
el: Αναμιγνύονται τα ποτά (βίντεο)

# #20252
source: Filling glasses (videos)
el: Γεμίζουν τα ποτήρια (βίντεο)

# #20253
source: WebDAV server (HTTP)
el: Διακομιστής WebDAV (HTTP)

# #20254
source: WebDAV server (HTTPS)
el: Διακομιστής WebDAV (HTTPS)

# #20255
source: First logon, edit your profile
el: Πρώτη σύνδεση, επεξεργαστείτε το προφίλ σας

# #20256
source: HTS Tvheadend client
el: Πελάτης HTS Tvheadend

# #20257
source: VDR Streamdev client
el: Πελάτης VDR Streamdev

# #20258
source: MythTV client
el: Πελάτης MythTV

# #20259
source: Network Filesystem (NFS)
el: Σύστημα Αρχείων Δικτύου (NFS)

# #20260
source: Secure Shell (SSH/SFTP)
el: Ασφαλές Κέλυφος (SSH/SFTP)

# #20261
source: Apple Filing Protocol (AFP)
el: Πρωτόκολλο Αρχειοθέτησης Apple (AFP)

# #20300
source: Web server directory (HTTP)
el: Κατάλογος διακομιστή ιστού (HTTP)

# #20301
source: Web server directory (HTTPS)
el: Κατάλογος διακομιστή ιστού (HTTPS)

# #20302
source: Unable to write to folder:
el: Αδυναμία εγγραφής στο φάκελο:

# #20303
source: Do you want to skip and proceed?
el: Θέλετε να παραβλεφθεί και να συνεχίσετε;

# #20304
source: RSS Feed
el: Ροή τίτλων ειδήσεων (RSS)

# #20307
source: Secondary DNS
el: Δευτερεύον DNS

# #20308
source: DHCP server:
el: Διακομιστής DHCP:

# #20309
source: Make new folder
el: Δημιουργία νέου φακέλου

# #20311
source: Unknown or onboard (protected)
el: Άγνωστο ή πάνω στην μητρική (με προστασία)

# #20314
source: Videos - Library
el: Βίντεο - Συλλογή

# #20316
source: Sort by: ID
el: Ταξ.: ID

# #20317
source: Scanning movies using %s
el: Σάρωση ταινιών με %s

# #20318
source: Scanning music videos using %s
el: Σάρωση μουσικών βίντεο με %s

# #20319
source: Scanning tvshows using %s
el: Σάρωση τηλ. σειρών με %s

# #20320
source: Scanning artists using %s
el: Σάρωση καλλιτεχνών με %s

# #20321
source: Scanning albums using %s
el: Σάρωση άλμπουμ με %s

# #20323
source: Movie plot
el: Πλοκή ταινίας

# #20324
source: Play part...
el: Αναπαραγωγή κομματιού...

# #20325
source: Calibration reset
el: Επαναφορά βαθμονόμησης

# #20326
source: This will reset the calibration values for %s
el: Επαναφορά των τιμών βαθμονόμησης για %s

# #20327
source: to its default values.
el: στις προεπιλεγμένες τιμές.

# #20328
source: Browse for destination
el: Αναζήτηση προορισμού

# #20329
source: Movies are in separate folders that match the movie title
el: Οι ταινίες είναι σε ξεχωριστούς φακέλους με αντίστοιχα ονόματα

# #20330
source: Use folder names for lookups
el: Χρήση ονόματος φακέλου για αναζητήσεις

# #20331
source: File
el: Αρχείο

# #20332
source: Use file or folder names in lookups?
el: Χρήση φακέλων ή ονομάτων αρχείων στις αναζητήσεις;

# #20333
source: Set content
el: Ορισμός περιεχομένου

# #20334
source: Folder
el: Φάκελος

# #20335
source: Look for content recursively?
el: Έλεγχος περιεχομένου και στους υποφάκελους;

# #20336
source: Unlock sources
el: Ξεκλείδωμα πηγών

# #20337
source: Actor
el: Ηθοποιός

# #20338
source: Movie
el: Ταινία

# #20339
source: Director
el: Σκηνοθεσία

# #20340
source: Do you want to remove all items within
el: Θέλετε να αφαιρέσετε όλα τα αντικείμενα

# #20341
source: this path from the Kodi library?
el: αυτής της διαδρομής από τη συλλογή;

# #20342
source: Movies
el: Ταινίες

# #20343
source: TV shows
el: Τηλ. Σειρές

# #20344
source: This directory contains
el: Αυτός ο φάκελος περιέχει

# #20345
source: Run automated scan
el: Εκτέλεση αυτόματης σάρωσης

# #20346
source: Scan recursively
el: Σάρωση και των υποφακέλων

# #20347
source: as
el: ως

# #20348
source: Directors
el: Σκηνοθέτες

# #20349
source: No video files found in this path!
el: Δεν βρέθηκαν αρχεία βίντεο σε αυτή τη διαδρομή!

# #20350
source: votes
el: ψήφοι

# #20351
source: TV show information
el: Πληροφορίες τηλ. σειράς

# #20352
source: Episode information
el: Πληροφορίες επεισοδίου

# #20353
source: Loading TV show details
el: Φόρτωση λεπτομερειών τηλ. σειράς

# #20354
source: Fetching episode guide
el: Ανάκτηση οδηγού επεισοδίων

# #20355
source: Loading info for episodes in directory
el: Φόρτωση πληροφοριών για τα επεισόδια στο φάκελο

# #20356
source: Select TV show:
el: Επιλεγμένη τηλ. σειρά:

# #20357
source: Enter the TV show name
el: Εισαγωγή ονόματος τηλ. σειράς

# #20358
source: Season %i
el: Κύκλος %i

# #20359
source: Episode
el: Επεισόδιο

# #20360
source: Episodes
el: Επεισόδια

# #20361
source: Loading episode details
el: Φορτώνονται λεπτομέρειες για το επεισόδιο

# #20362
source: Remove episode from library
el: Αφαίρεση επεισοδίου από τη συλλογή

# #20363
source: Remove TV show from library
el: Αφαίρεση τηλ. σειράς από τη συλλογή

# #20364
source: TV show
el: Τηλ. Σειρά

# #20365
source: Episode plot
el: Πλοκή επεισοδίου

# #20366
source: * All seasons
el: * Όλοι οι κύκλοι

# #20367
source: Hide watched
el: Απόκρυψη προβληθέντων

# #20368
source: Prod code
el: Κωδικός παραγωγής

# #20369
source: Show plot for unwatched items
el: Εμφάνιση πλοκής στα μη προβληθέντα

# #20370
source: * Hidden to prevent spoilers *
el: * Απόκρυψη για αποφυγή spoiler *

# #20371
source: Set season thumb
el: Ορισμός μικρογραφίας κύκλου

# #20372
source: Season image
el: Εικόνα κύκλου

# #20373
source: Season
el: Κύκλος

# #20374
source: Downloading movie information
el: Λήψη πληροφοριών ταινίας

# #20375
source: Unassign content
el: Εκχώρηση περιεχόμενου

# #20376
source: Original title
el: Πρωτότυπος τίτλος

# #20377
source: Refresh TV show information
el: Ανανέωση πληροφοριών τηλ. σειράς

# #20378
source: Refresh info for all episodes?
el: Ανανέωση πληροφοριών για όλα τα επεισόδια;

# #20379
source: Selected folder contains a single TV show
el: Ο επιλεγμένος φάκελος περιέχει μόνο μία τηλ. σειρά

# #20380
source: Exclude selected folder from scans
el: Εξαίρεση του επιλεγμένου φακέλου από τυχόν ελέγχους

# #20381
source: Specials
el: Ειδικά επεισόδια

# #20383
source: Selected folder contains a single video
el: Ο επιλεγμένος φάκελος περιέχει μόνο ένα βίντεο

# #20384
source: Link to TV show
el: Σύνδεση με τηλ. σειρά

# #20385
source: Remove link to TV show
el: Αφαίρεση συνδέσμου από τηλ. σειρά

# #20386
source: Recently added movies
el: Ταινίες που προστέθηκαν πρόσφατα

# #20387
source: Recently added episodes
el: Επεισόδια που προστέθηκαν πρόσφατα

# #20388
source: Studios
el: Στούντιο

# #20389
source: Music videos
el: Μουσικά βίντεο

# #20390
source: Recently added music videos
el: Μουσικά βίντεο που προστέθηκαν πρόσφατα

# #20391
source: Music video
el: Μουσικό βίντεο

# #20392
source: Remove music video from library
el: Αφαίρεση μουσικού βίντεο από τη συλλογή

# #20393
source: Music video information
el: Πληροφορίες μουσικού βίντεο

# #20394
source: Loading music video information
el: Φόρτωση πληροφοριών για το μουσικό βίντεο

# #20395
source: Mixed
el: Ανάμικτα

# #20396
source: Go to albums by artist
el: Άλμπουμ καλλιτέχνη

# #20397
source: Go to album
el: Άλμπουμ

# #20398
source: Play song
el: Αναπαραγωγή τραγουδιού

# #20399
source: Go to music videos from album
el: Μουσικά βίντεο από άλμπουμ

# #20400
source: Go to music videos by artist
el: Μουσικά βίντεο καλλιτέχνη

# #20401
source: Play music video
el: Αναπαραγωγή μουσικού βίντεο

# #20402
source: Download actor thumbnails when adding to library
el: Λήψη μικρογραφιών ηθοποιών κατά την προσθήκη στη συλλογή

# #20403
source: Set actor thumb
el: Ορισμός μικρογραφίας ηθοποιού

# #20404
source: Remove bookmark
el: Αφαίρεση σελιδοδείκτη

# #20405
source: Remove episode bookmark
el: Αφαίρεση σελιδοδείκτη επεισοδίου

# #20406
source: Set episode bookmark
el: Ορισμός σελιδοδείκτη επεισοδίου

# #20407
source: Scraper settings
el: Ρυθμίσεις scraper

# #20408
source: Downloading music video information
el: Λήψη πληροφοριών για το μουσικό βίντεο

# #20409
source: Downloading TV show information
el: Λήψη πληροφοριών για την τηλ. σειρά

# #20410
source: Trailer
el: Διαφημιστικό

# #20411
source: Flatten
el: Ενιαία λίστα

# #20412
source: Flatten TV show seasons
el: Ενιαία λίστα κύκλων σειράς (Flatten)

# #20413
source: Get fanart
el: Λήψη Fanart

# #20414
source: Show fanart in video and music libraries
el: Προβολή fanart στις συλλογές βίντεο και μουσικής

# #20415
source: Scanning for new content
el: Έλεγχος για νέα περιεχόμενα

# #20416
source: First aired
el: Πρεμιέρα

# #20417
source: Writer
el: Σενάριο

# #20418
source: Writers
el: Σενάριο

# #20419
source: Replace file names with library titles
el: Αντικατάσταση ονομάτων αρχείων με τίτλους συλλογών

# #20420
source: Never
el: Ποτέ

# #20421
source: If only one season
el: Eάν είναι ενός κύκλου

# #20422
source: Always
el: Πάντα

# #20423
source: Has trailer
el: Έχει διαφημιστικό

# #20424
source: False
el: Ψευδές

# #20425
source: Fanart slideshow
el: Παρουσίαση διαφανειών Fanart

# #20426
source: Export to a single file or separate
el: Εξαγωγή σε ένα αρχείο ή σε πολλαπλά

# #20427
source: files per entry?
el: αρχεία ανά εγγραφή;

# #20428
source: Single file
el: Ένα αρχείο

# #20429
source: Separate
el: Πολλαπλά

# #20430
source: Export thumbnails and fanart?
el: Εξαγωγή μικρογραφιών και fanart;

# #20431
source: Overwrite old files?
el: Αντικατάσταση παλιών αρχείων;

# #20432
source: Exclude path from library updates
el: Εξαίρεση διαδρομής από τις ενημερώσεις συλλογής

# #20433
source: Extract thumbnails and video information
el: Εξαγωγή μικρογραφιών και πληροφοριών

# #20434
source: Sets
el: Ομάδες Ταινιών

# #20435
source: Combine split video items
el: Συνένωση διαχωρισμένων βίντεο

# #20436
source: Export actor thumbs?
el: Εξαγωγή μικρογραφιών ηθοποιών;

# #20437
source: Choose fanart
el: Επιλογή fanart

# #20438
source: Local fanart
el: Τοπικό fanart

# #20439
source: No fanart
el: Χωρίς fanart

# #20440
source: Current fanart
el: Τρέχον fanart

# #20441
source: Remote fanart
el: Απομακρυσμένο fanart

# #20442
source: Change content
el: Αλλαγή περιεχομένου

# #20443
source: Do you want to refresh info for all
el: Επιθυμείτε να ανανεώσετε τις πληροφορίες

# #20444
source: items within this path?
el: για όλα τα αντικείμενα αυτής της διαδρομής;

# #20446
source: Locally stored information found.
el: Βρέθηκαν τοπικά αποθηκευμένες πληροφορίες.

# #20447
source: Ignore and refresh from internet?
el: Να αγνοηθούν και να ανανεωθούν από το διαδίκτυο;

# #20448
source: Could not download information
el: Αδυναμία λήψης πληροφοριών

# #20449
source: Unable to connect to remote server
el: Αδυναμία σύνδεσης με τον απομακρυσμένο διακομιστή

# #20450
source: Would you like to continue scanning?
el: Επιθυμείτε να συνεχίσετε την αναζήτηση;

# #20451
source: Countries
el: Χώρες

# #20452
source: episode
el: επεισόδιο

# #20453
source: episodes
el: επεισόδια

# #20454
source: Listener
el: Ακροατής

# #20455
source: Listeners
el: Ακροατές

# #20456
source: Flatten library hierarchy
el: Ενιαία λίστα ιεραρχίας συλλογής

# #20457
source: Movie set
el: Ομάδα Ταινιών

# #20458
source: Group movies in sets
el: Ομαδοποίηση ταινιών

# #20459
source: Tags
el: Ετικέτες

# #20460
source: Add %s
el: Προσθήκη %s

# #20461
source: Remove %s
el: Αφαίρεση %s

# #20462
source: New tag...
el: Νέα ετικέτα...

# #20463
source: A tag with the name '%s' already exists.
el: Υπάρχει ήδη μία ετικέτα με το όνομα '%s'.

# #20464
source: Select %s
el: Επιλογή %s

# #20465
source: Manage movie set
el: Διαχείριση ομάδας ταινιών

# #20466
source: Select movie set
el: Επιλογή ομάδας ταινιών

# #20467
source: No set (Remove from %s)
el: Καμία ομάδα (Αφαίρεση από %s)

# #20468
source: Add movie to a new set
el: Προσθήκη ταινίας σε νέα ομάδα

# #20469
source: Keep current set (%s)
el: Διατήρηση τρέχουσας ομάδας (%s)

# #21330
source: Show hidden files and directories
el: Προβολή κρυφών αρχείων και φακέλων

# #21331
source: TuxBox client
el: Πελάτης TuxBox

# #21332
source: WARNING: Target TuxBox device is in recording-mode!
el: ΠΡΟΣΟΧΗ: Η συσκευή TuxBox βρίσκεται σε κατάσταση εγγραφής!

# #21333
source: The stream will be stopped!
el: Η ροή πολυμέσων θα σταματήσει!

# #21334
source: Zap to channel: %s failed!
el: Η μετάβαση στο κανάλι: %s απέτυχε!

# #21335
source: Are you sure to start the stream?
el: Θέλετε να ξεκινήσει η ροή πολυμέσων;

# #21336
source: Connecting to: %s
el: Σύνδεση στο: %s

# #21337
source: TuxBox device
el: Συσκευή TuxBox

# #21359
source: Add media share...
el: Προσθήκη κοινόχρηστου πολυμέσου...

# #21360
source: Share video and music libraries through UPnP
el: Διαμοιρασμός συλλογών μουσικής και βίντεο μέσω UPnP

# #21361
source: Look for remote UPnP players
el: Αναζήτηση για απομακρυσμένους UPnP αναπαραγωγείς

# #21362
source: Bookmark created
el: Δημιουργήθηκε σελιδοδείκτης

# #21363
source: Episode Bookmark created
el: Δημιουργήθηκε σελιδοδείκτης επεισοδίου

# #21364
source: Edit media share
el: Επεξεργασία κοινόχρηστων πολυμέσων

# #21365
source: Remove media share
el: Αφαίρεση κοινόχρηστων πολυμέσων

# #21366
source: Custom subtitle folder
el: Προσαρμοσμένος φάκελος υποτίτλων

# #21367
source: Movie & alternate subtitle directory
el: Ταινία & εναλλακτικός φάκελος υποτίτλων

# #21368
source: Override ASS/SSA subtitles fonts
el: Παράκαμψη γραμματοσειρών υποτίτλων ASS/SSA

# #21369
source: Enable mouse and touch screen support
el: Ενεργοποίηση ποντικιού και υποστήριξη οθόνης αφής

# #21370
source: Play navigation sounds during media playback
el: Ενεργοποίηση ήχων πλοήγησης κατά την αναπαραγωγή

# #21371
source: Thumbnail
el: Μικρογραφία

# #21372
source: Forced DVD player region
el: Περιοχή αναπαραγωγέα DVD

# #21373
source: Video output
el: Έξοδος βίντεο

# #21374
source: Video aspect
el: Αναλογίες εικόνας

# #21375
source: Normal
el: Κανονική

# #21377
source: Widescreen
el: Ευρεία οθόνη

# #21378
source: Enable 480p
el: Ενεργοποίηση 480p

# #21379
source: Enable 720p
el: Ενεργοποίηση 720p

# #21380
source: Enable 1080i
el: Ενεργοποίηση 1080i

# #21381
source: Enter name of new playlist
el: Εισαγωγή ονόματος της νέας λίστας αναπ/γής

# #21382
source: Show "Add source" buttons in file lists
el: Εμφάνιση πλήκτρου "Προσθήκη πηγής" στις λίστες αρχείων

# #21383
source: Enable scrollbars
el: Ενεργοποίηση μπαρών κύλισης

# #21384
source: Make watched filtering a toggle in video library
el: Δημιουργία μεταβλητών για φιλτράρισμα στη συλλογή των βίντεο

# #21385
source: Open
el: Άνοιγμα

# #21386
source: Acoustic management level
el: Διαχείριση στάθμης θορύβου

# #21387
source: Fast
el: Θορυβώδες

# #21388
source: Quiet
el: Αθόρυβο

# #21389
source: Enable custom background
el: Ενεργοποίηση προσαρμοσμένου υποβάθρου

# #21390
source: Power management level
el: Διαχείριση παροχής ενέργειας

# #21391
source: High power
el: Υψηλή τροφοδοσία

# #21392
source: Low power
el: Χαμηλή τροφοδοσία

# #21393
source: High standby
el: Υψηλή αναμονή

# #21394
source: Low standby
el: Χαμηλή αναμονή

# #21395
source: Unable to cache files bigger than 4GB
el: Αδυναμία δημιουργίας προσωρινών αρχείων μεγαλύτερων από 4GB

# #21396
source: Chapter
el: Κεφάλαιο

# #21397
source: High quality pixel shader v2
el: Υψηλής ποιότητας σκίαση pixel v2

# #21398
source: Enable playlist at startup
el: Ενεργοποίηση λίστας αναπ/γής κατά την εκκίνηση

# #21399
source: Use tween animations
el: Χρήση εφέ παλινδρομικής κίνησης

# #21400
source: contains
el: περιέχει

# #21401
source: does not contain
el: δεν περιέχει

# #21402
source: is
el: είναι

# #21403
source: is not
el: δεν είναι

# #21404
source: starts with
el: αρχίζει με

# #21405
source: ends with
el: τελειώνει σε

# #21406
source: greater than
el: μεγαλύτερο από

# #21407
source: less than
el: μικρότερο από

# #21408
source: after
el: μετά

# #21409
source: before
el: πριν

# #21410
source: in the last
el: στο τελευταίο

# #21411
source: not in the last
el: όχι στο τελευταίο

# #21412
source: Scrapers
el: Scraper

# #21413
source: Default movie scraper
el: Προεπιλεγμένο scraper ταινιών

# #21414
source: Default tvshow scraper
el: Προεπιλεγμένο scraper τηλ. σειρών

# #21415
source: Default music video scraper
el: Προεπιλεγμένο scraper μουσικών βίντεο

# #21417
source: Settings
el: Ρυθμίσεις

# #21418
source: Multilingual
el: Πολύγλωσσο

# #21419
source: No scrapers present
el: Δεν υπάρχει διαθέσιμο scraper

# #21420
source: Value to match
el: Τιμή για αντιστοίχιση

# #21421
source: Smart playlist rule
el: Κανόνας έξυπνης λίστας αναπ/γής

# #21422
source: Match items where
el: Αντιστοίχιση αντικειμένων όταν

# #21423
source: New rule...
el: Νέος κανόνας...

# #21424
source: Items must match
el: Τα αντικείμενα πρέπει να πληρούν

# #21425
source: all of the rules
el: όλους τους κανόνες

# #21426
source: one or more of the rules
el: έναν ή περισσότερους κανόνες

# #21427
source: Limit to
el: Αριθμητικό όριο

# #21428
source: No limit
el: Χωρίς περιορισμό

# #21429
source: Order by
el: Σειρά κατά

# #21430
source: ascending
el: αύξουσα

# #21431
source: descending
el: φθίνουσα

# #21432
source: Edit smart playlist
el: Επεξεργασία έξυπνης λίστας αναπ/γής

# #21433
source: Name of the playlist
el: Όνομα λίστας αναπ/γής

# #21434
source: Find items where
el: Εύρεση αντικειμένων για τα οποία

# #21435
source: Edit
el: Επεξεργασία

# #21436
source: %i items
el: %i αντικείμενα

# #21437
source: New smart playlist...
el: Νέα έξυπνη λίστα αναπ/γής...

# #21438
source: %c Drive
el: %c Δίσκος

# #21439
source: Edit party mode rules
el: Επεξεργασία κανόνων λειτουργίας party

# #21440
source: Home folder
el: Αρχικός φάκελος

# #21441
source: Watched count
el: Πλήθος προβληθέντων

# #21442
source: Episode title
el: Τίτλος επεισοδίου

# #21443
source: Video resolution
el: Ανάλυση βίντεο

# #21444
source: Audio channels
el: Κανάλια ήχου

# #21445
source: Video codec
el: Κωδικοποίηση βίντεο

# #21446
source: Audio codec
el: Κωδικοποίηση ήχου

# #21447
source: Audio language
el: Γλώσσα ήχου

# #21448
source: Subtitle language
el: Γλώσσα υποτίτλων

# #21449
source: Remote control sends keyboard presses
el: Το τηλεχειριστήριο στέλνει εντολές πληκτρολογίου

# #21450
source: Edit
el: Επεξεργασία

# #21451
source: Internet connection required.
el: Απαιτείται σύνδεση στο Διαδίκτυο.

# #21452
source: Get More...
el: Λήψη Περισσότερων...

# #21453
source: Root filesystem
el: Σύστημα αρχείων αρχικού φακέλου

# #21454
source: Cache full
el: Λανθάνουσα μνήμη πλήρης

# #21455
source: Cache filled before reaching required amount for continous playback
el: Η λανθάνουσα μνήμη γέμισε πριν φθάσει το απαιτούμενο μέγεθος για συνεχόμενη αναπαραγωγή

# #21456
source: External storage
el: Εξωτερικός χώρος αποθήκευσης

# #21457
source: Watched episode count
el: Πλήθος προβληθέντων επεισοδίων

# #21458
source: Group by
el: Σε γκρουπ ανά

# #21459
source: mixed
el: ανάμικτα

# #21460
source: Subtitle position on screen
el: Θέση υποτίτλου στην οθόνη

# #21461
source: Fixed
el: Σταθερή

# #21462
source: Bottom of video
el: Κάτω πλευρά του βίντεο

# #21463
source: Below video
el: Κάτω από το βίντεο

# #21464
source: Top of video
el: Πάνω πλευρά του βίντεο

# #21465
source: Above video
el: Πάνω από το βίντεο

# #21467
source: %.1f to %.1f
el: %.1f με %.1f

# #21468
source: %d to %d
el: %d με %d

# #21469
source: %s to %s
el: %s με %s

# #21602
source: (External)
el: (Εξωτερικός)

# #21800
source: File name
el: Όνομα αρχείου

# #21801
source: File path
el: Διαδρομή αρχείου

# #21802
source: File size
el: Μέγεθος αρχείου

# #21803
source: File date/time
el: Ημερομηνία αρχείου

# #21804
source: Slide index
el: Θέση διαφάνειας

# #21805
source: Resolution
el: Ανάλυση

# #21806
source: Comment
el: Σχόλιο

# #21807
source: Colour/B&W
el: Έγχρωμη/Ασπρόμαυρη

# #21808
source: JPEG process
el: Επεξεργασία JPEG

# #21820
source: Date/Time
el: Ημερομηνία/Ώρα

# #21821
source: Description
el: Περιγραφή

# #21822
source: Camera make
el: Κατασκευαστής κάμερας

# #21823
source: Camera model
el: Μοντέλο κάμερας

# #21824
source: EXIF comment
el: Σχόλια EXIF

# #21825
source: Firmware
el: Έκδοση υλικού

# #21826
source: Aperture
el: Διάφραγμα

# #21827
source: Focal length
el: Εστιακή απόσταση

# #21828
source: Focus distance
el: Απόσταση αντικειμένου

# #21829
source: Exposure
el: Έκθεση

# #21830
source: Exposure time
el: Χρόνος έκθεσης

# #21831
source: Exposure bias
el: Πόλωση έκθεσης
