Repository: xbmc/xbmc
Catalog: language/Greek/strings.po
Languages: el

# #19164
source: Cannot start recording. Check the log for details.
el: Δεν είναι δυνατή η έναρξη εγγραφής. Ελέγξτε το αρχείο καταγραφής για λεπτομέρειες.

# #19165
source: Switch
el: Μετάβαση

# #19166
source: PVR information
el: Πληροφορίες PVR

# #19167
source: Scan for missing icons
el: Σάρωση για εικονίδια που λείπουν

# #19169
source: Hide video information box
el: Απόκρυψη παραθύρου πληροφοριών βίντεο

# #19170
source: Timeout when starting playback
el: Χρονικό όριο κατά την έναρξη αναπαραγωγής

# #19171
source: Start playback minimised
el: Εκκίνηση αναπαραγωγής σε ελαχιστοποίηση

# #19172
source: Instant recording duration
el: Διάρκεια άμεσης εγγραφής

# #19173
source: Default recording priority
el: Προεπιλεγμένη προτεραιότητα εγγραφής

# #19174
source: Default recording lifetime
el: Προεπιλεγμένος χρόνος ζωής εγγραφής

# #19175
source: Margin at the start of a recording
el: Περιθώριο στην αρχή μίας εγγραφής

# #19176
source: Margin at the end of a recording
el: Περιθώριο στο τέλος μιας εγγραφής

# #19177
source: Playback
el: Αναπαραγωγή

# #19178
source: Show channel information when switching channels
el: Εμφάνιση πληροφοριών καναλιού κατά το ζάπινγκ

# #19179
source: Automatically hide channel information
el: Αυτόματη απόκρυψη πληροφοριών καναλιού

# #19180
source: TV
el: Τηλεόραση

# #19181
source: Menu/OSD
el: Μενού/OSD

# #19182
source: Days to display in the EPG
el: Ημέρες που θα εμφανίζονται στο EPG

# #19184
source: Channel information duration
el: Διάρκεια πληροφοριών καναλιού

# #19185
source: Reset the PVR database
el: Επαναφορά της βάσης δεδομένων PVR

# #19186
source: All data in the PVR database is being erased
el: Διαγράφονται όλα τα στοιχεία της βάσης δεδομένων του PVR

# #19187
source: Reset the EPG database
el: Επαναφορά της βάσης δεδομένων EPG

# #19188
source: EPG is being reset
el: Γίνεται επαναφορά της βάσης δεδομένων EPG

# #19189
source: Continue last channel on startup
el: Συνέχεια του τελευταίου καναλιού κατά την εκκίνηση

# #19190
source: Minimised
el: Ελαχιστοποιημένο

# #19191
source: PVR service
el: Υπηρεσία PVR

# #19192
source: None of the connected PVR backends supports scanning for channels.
el: Κανένα από τα συνδεδεμένα backend δεν υποστηρίζει σάρωση για κανάλια.

# #19193
source: The channel scan cannot be started. Check the log for details.
el: Η σάρωση καναλιών δεν μπορεί να ξεκινήσει. Ελέγξτε το αρχείο καταγραφής για λεπτομέρειες.

# #19194
source: Continue?
el: Συνέχεια;

# #19195
source: Client actions
el: Ενέργειες πελάτη

# #19196
source: PVR client specific actions
el: Ειδικές ενέργειες πελάτη PVR

# #19197
source: Recording started on: %s
el: Η εγγραφή ξεκίνησε στις: %s

# #19198
source: Recording finished on: %s
el: Η εγγραφή τελείωσε στις: %s

# #19199
source: Channel manager
el: Διαχείριση καναλιών

# #19200
source: EPG source:
el: Πηγή EPG:

# #19201
source: Channel name:
el: Όνομα καναλιού:

# #19202
source: Channel icon:
el: Εικονίδιο καναλιού:

# #19203
source: Edit channel
el: Ρύθμιση καναλιού

# #19204
source: New channel
el: Νέο κανάλι

# #19205
source: Group management
el: Διαχείριση γκρουπ

# #19206
source: Activate EPG:
el: Ενεργοποίηση EPG:

# #19207
source: Group:
el: Γκρουπ:

# #19208
source: Enter the name of the new channel
el: Εισάγετε το όνομα του νέου καναλιού

# #19209
source: Kodi virtual backend
el: Εικονικό backend Kodi

# #19210
source: Client
el: Πελάτης

# #19211
source: Delete channel
el: Διαγραφή καναλιού

# #19212
source: This list contains changes
el: Αυτή η λίστα περιέχει αλλαγές

# #19213
source: Select backend
el: Επιλογή backend

# #19214
source: Enter a valid URL for the new channel
el: Εισάγετε μία έγκυρη διεύθυνση URL για το νέο κανάλι

# #19215
source: The PVR backend does not support timers.
el: Το backend του PVR δεν υποστηρίζει χρονοδιακόπτες.

# #19216
source: All radio channels
el: Όλοι οι ραδ. σταθμοί

# #19217
source: All TV channels
el: Όλα τα τηλ. κανάλια

# #19218
source: Visible
el: Φανερά

# #19219
source: Ungrouped channels
el: Κανάλι εκτός γκρουπ

# #19220
source: Channels in
el: Κανάλια σε

# #19221
source: Synchronise channel groups with backend(s)
el: Συγχρονισμός γκρουπ καναλιών με τα backend

# #19223
source: No PVR Add-on could be enabled. Check your settings or the log for more info.
el: Αδυναμία ενεργοποίησης οποιουδήποτε Πρόσθετου PVR. Ελέγξτε τις ρυθμίσεις ή το αρχείο καταγραφής για περισσότερες πληροφορίες.

# #19224
source: Recording aborted
el: Η εγγραφή ακυρώθηκε

# #19225
source: Recording scheduled
el: Προγραμματίστηκε η εγγραφή

# #19226
source: Recording started
el: Η εγγραφή ξεκίνησε

# #19227
source: Recording completed
el: Η εγγραφή ολοκληρώθηκε

# #19228
source: Recording deleted
el: Η εγγραφή διεγράφη

# #19229
source: Close channel OSD after switching channels
el: Κλείσιμο του OSD του καναλιού κατά το ζάπινγκ

# #19230
source: Prevent EPG updates during playback
el: Αποτροπή ενημερώσεων EPG κατά την αναπαραγωγή

# #19231
source: Always use the channel order from the backend(s)
el: Πάντα να χρησιμοποιείται η διάταξη των καναλιών από τα backend

# #19232
source: Clear search results
el: Εκκαθάριση αποτελεσμάτων αναζήτησης

# #19233
source: Display a notification on timer updates
el: Εμφάνιση ειδοποίησης κατά τις ενημερώσεις χρονοδιακοπτών

# #19234
source: Use backend channels numbers (only works with 1 enabled PVR Add-on)
el: Χρήση αριθμών καναλιών του backend (δουλεύει μόνο για 1 ενεργοποιημένο Πρόσθετο PVR)

# #19235
source: PVR manager is starting up
el: Ξεκινά η διαχείριση PVR

# #19236
source: Loading channels from clients
el: Φορτώνονται κανάλια από τους πελάτες

# #19237
source: Loading timers from clients
el: Φορτώνονται χρονοδιακόπτες από τους πελάτες

# #19238
source: Loading recordings from clients
el: Φορτώνονται εγγραφές από τους πελάτες

# #19239
source: Starting background threads
el: Εκκίνηση νημάτων παρασκηνίου

# #19240
source: No PVR Add-on enabled
el: Δεν έχει ενεργοποιηθεί κανένα Πρόσθετο PVR

# #19241
source: The PVR manager has been enabled without any
el: Η διαχείρηση PVR ενεργοποιήθηκε χωρίς κανένα

# #19242
source: enabled PVR Add-on. Enable at least one Add-on
el: ενεργό Πρόσθετο PVR. Ενεργοποιήστε τουλάχιστον ένα

# #19243
source: in order to use the PVR functionality.
el: προκειμένου να χρησιμοποιήσετε τη λειτουργία PVR.

# #19244
source: Backend idle time
el: Χρόνος αδράνειας backend

# #19245
source: Set wakeup command (cmd [timestamp])
el: Ορισμός εντολής αφύπνισης (cmd [timestamp])

# #19246
source: Wakeup before recording
el: Αφύπνιση πριν την εγγραφή

# #19247
source: Daily wakeup
el: Καθημερινή αφύπνιση

# #19248
source: Daily wakeup time (HH:MM:SS)
el: Ώρα καθημερινής αφύπνισης (ΩΩ:λλ:δδ)

# #19249
source: Filter channels
el: Φιλτράρισμα καναλιών

# #19250
source: Loading EPG from database
el: Φορτώνεται το EPG από τη βάση δεδομένων

# #19251
source: Update EPG information
el: Ενημέρωση πληροφοριών EPG

# #19252
source: Schedule EPG update for this channel?
el: Να προγραμματιστεί ενημέρωση EPG για αυτό το κανάλι;

# #19253
source: EPG update scheduled for channel
el: Προγραμματίστηκε ενημέρωση EPG για το κανάλι

# #19254
source: EPG update failed for channel
el: Απέτυχε η ενημέρωση EPG για το κανάλι

# #19255
source: Start recording
el: Έναρξη εγγραφής

# #19256
source: Stop recording
el: Διακοπή εγγραφής

# #19257
source: Lock channel
el: Κλείδωμα καναλιού

# #19258
source: Unlock channel
el: Ξεκλείδωμα καναλιού

# #19259
source: Parental control
el: Γονικός έλεγχος

# #19260
source: Unlock duration
el: Διάρκεια ξεκλειδώματος

# #19261
source: Change PIN
el: Αλλαγή PIN

# #19262
source: Parental control. Enter PIN:
el: Γονικός έλεγχος. Εισάγετε το PIN:

# #19263
source: Locked channel. Enter PIN:
el: Κλειδωμένο κανάλι. Εισάγετε το PIN:

# #19264
source: Incorrect PIN
el: Λανθασμένο PIN

# #19265
source: The entered PIN number was incorrect.
el: Το PIN που εισαγάγατε είναι λανθασμένο.

# #19266
source: Parental locked
el: Γονικό κλείδωμα

# #19267
source: Parental locked:
el: Γονικό κλείδωμα:

# #19268
source: Do not show 'no information available' labels
el: Να μην εμφανίζονται ετικέτες για 'μη διαθέσιμες πληροφορίες'

# #19269
source: Do not show 'connection lost' warnings
el: Να μην εμφανίζονται ειδοποιήσεις 'απώλειας σύνδεσης'

# #19270
source: * All recordings
el: * Όλες οι εγγραφές

# #19271
source: No PVR Add-ons could be found
el: Δε βρέθηκαν Πρόσθετα PVR

# #19272
source: You need a tuner, backend software, and an
el: Χρειάζεστε ένα δέκτη (tuner), ένα backend, και ένα

# #19273
source: Add-on for the backend to be able to use PVR.
el: Πρόσθετο για το backend προκειμένου να μπορεί να κάνει χρήση του PVR.

# #19274
source: Please visit xbmc.org/pvr to learn more.
el: Επισκεφθείτε το xbmc.org/pvr για να μάθετε περισσότερα.

# #19275
source: Conflict warning
el: Προειδοποίηση διένεξης

# #19276
source: Conflict error
el: Σφάλμα διένεξης

# #19277
source: Recording conflict
el: Διένεξη εγγραφής

# #19278
source: Recording error
el: Σφάλμα εγγραφής

# #19279
source: Client specific
el: Ρυθμίσεις πελάτη

# #19280
source: Client specific settings
el: Ειδικές ρυθμίσεις πελάτη

# #19281
source: Confirm channel switches by pressing OK
el: Επιβεβαίωση αλλαγής καναλιού πιέζοντας 'Επιλογή'

# #19282
source: Current icon
el: Τρέχον εικονίδιο

# #19283
source: No icon
el: Κανένα εικονίδιο

# #19284
source: Choose icon
el: Επιλογή εικονιδίου

# #19285
source: Browse for icon
el: Αναζήτηση εικονιδίου

# #19499
source: Other/Unknown
el: Άλλο/Άγνωστο

# #19500
source: Movie/Drama
el: Ταινία/Δράμα

# #19501
source: Detective/Thriller
el: Αστυνομικό/Θρίλερ

# #19502
source: Adventure/Western/War
el: Περιπέτεια/Γουέστερν/Πολεμικό

# #19503
source: Science Fiction/Fantasy/Horror
el: Επιστημονική Φαντασία/Φαντασία/Τρόμου

# #19504
source: Comedy
el: Κωμωδία

# #19505
source: Soap/Melodrama/Folkloric
el: Σαπουνόπερα/Μελόδραμα/Φολκλορικό

# #19506
source: Romance
el: Ρομαντική

# #19507
source: Serious/Classical/Religious/Historical Movie/Drama
el: Σοβαρή/Κλασική/Θρησκευτική/Ιστορική Ταινία/Δράμα

# #19508
source: Adult Movie/Drama
el: Πορνό/Δράμα

# #19516
source: News/Current Affairs
el: Ειδήσεις/Επικαιρότητα

# #19517
source: News/Weather Report
el: Ειδήσεις/Δελτίο Καιρού

# #19518
source: News Magazine
el: Ειδησεογραφικό Περιοδικό

# #19519
source: Documentary
el: Ντοκυμαντέρ

# #19520
source: Discussion/Interview/Debate
el: Συζήτηση/Συνέντευξη/Ντιμπέιτ

# #19532
source: Show/Game Show
el: Σόου/Τηλεπαιχνίδι

# #19533
source: Game Show/Quiz/Contest
el: Τηλεπαιχνίδι/Κουίζ/Διαγωνισμός

# #19534
source: Variety Show
el: Βαριετέ

# #19535
source: Talk Show
el: Τοκ Σόου

# #19548
source: Sports
el: Αθλητικά

# #19549
source: Special Event
el: Ειδική Εκδήλωση

# #19550
source: Sport Magazine
el: Αθλητικό Περιοδικό

# #19551
source: Football
el: Ποδόσφαιρο

# #19552
source: Tennis/Squash
el: Τένις/Σκουός

# #19553
source: Team Sports
el: Ομαδικά Αθλήματα

# #19554
source: Athletics
el: Αθλήματα

# #19555
source: Motor Sport
el: Μηχανοκίνητος Αθλητισμός

# #19556
source: Water Sport
el: Θαλάσσια Σπορ

# #19557
source: Winter Sports
el: Χειμερινά Αθλήματα

# #19558
source: Equestrian
el: Ιππασία

# #19559
source: Martial Sports
el: Πολεμικές Τέχνες

# #19564
source: Children's/Youth Programmes
el: Παιδικά/Νεανικά Προγράμματα

# #19565
source: Pre-school Children's Programmes
el: Προσχολικής Ηλικίας Προγράμματα

# #19566
source: Entertainment Programmes for 6 to 14
el: Ψυχαγωγικά Προγράμματα για 6 έως 14

# #19567
source: Entertainment Programmes for 10 to 16
el: Ψυχαγωγικά Προγράμματα για 10 έως 16

# #19568
source: Informational/Educational/School Programme
el: Ενημερωτικό/Εκπαιδευτικό/Σχολικό Πρόγραμμα

# #19569
source: Cartoons/Puppets
el: Καρτούν/Μαριονέτες

# #19580
source: Music/Ballet/Dance
el: Μουσική/Μπαλέτο/Χορός

# #19581
source: Rock/Pop
el: Ροκ/Ποπ

# #19582
source: Serious/Classical Music
el: Σοβαρή/Κλασική Μουσική

# #19583
source: Folk/Traditional Music
el: Λαϊκή/Παραδοσιακή Μουσική

# #19584
source: Musical/Opera
el: Μιούζικαλ/Όπερα

# #19585
source: Ballet
el: Μπαλέτο

# #19596
source: Arts/Culture
el: Τέχνη/Πολιτισμός

# #19597
source: Performing Arts
el: Τέχνες του Θεάματος

# #19598
source: Fine Arts
el: Καλές Τέχνες

# #19599
source: Religion
el: Θρησκεία

# #19600
source: Popular Culture/Traditional Arts
el: Λαϊκή Κουλτούρα/Παραδοσιακές Τέχνες

# #19601
source: Literature
el: Λογοτεχνία

# #19602
source: Film/Cinema
el: Φιλμ/Σινεμά

# #19603
source: Experimental Film/Video
el: Πειραματικός Κινηματογράφος/Βίντεο

# #19604
source: Broadcasting/Press
el: Εκπομπή/Εφημερίδες

# #19605
source: New Media
el: Νέα Μέσα

# #19606
source: Arts/Culture Magazines
el: Περιοδικά Τέχνης/Πολιτισμού

# #19607
source: Fashion
el: Μόδα

# #19612
source: Social/Political/Economics
el: Κοινωνία/Πολιτική/Οικονομία

# #19613
source: Magazines/Reports/Documentary
el: Περιοδικά/Εκθέσεις/Ντοκυμαντέρ

# #19614
source: Economics/Social Advisory
el: Οικονομική/Κοινωνική Συμβουλευτική

# #19615
source: Remarkable People
el: Αξιοσημείωτοι Άνθρωποι

# #19628
source: Education/Science/Factual
el: Εκπαίδευση/Επιστήμη/Γεγονότα

# #19629
source: Nature/Animals/Environment
el: Φύση/Ζώα/Περιβάλλον

# #19630
source: Technology/Natural Sciences
el: Τεχνολογία/Φυσικές Επιστήμες

# #19631
source: Medicine/Physiology/Psychology
el: Ιατρική/Φυσιολογία/Ψυχολογία

# #19632
source: Foreign Countries/Expeditions
el: Ξένες Χώρες/Αποστολές

# #19633
source: Social/Spiritual Sciences
el: Κοινωνικές/Πνευματικές Επιστήμες

# #19634
source: Further Education
el: Περαιτέρω Εκπαίδευση

# #19635
source: Languages
el: Γλώσσες

# #19644
source: Leisure/Hobbies
el: Αναψυχή/Χόμπυ

# #19645
source: Tourism/Travel
el: Τουρισμός/Ταξίδια

# #19646
source: Handicraft
el: Χειροτεχνία

# #19647
source: Motoring
el: Μηχανοκίνηση

# #19648
source: Fitness & Health
el: Φυσική Κατάσταση & Υγεία

# #19649
source: Cooking
el: Μαγειρική

# #19650
source: Advertisement/Shopping
el: Διαφημιστικά/Αγορές

# #19651
source: Gardening
el: Κηπουρική

# #19660
source: Special Characteristics
el: Ειδικά Χαρακτηριστικά

# #19661
source: Original Language
el: Αρχική Γλώσσα

# #19662
source: Black & White
el: Ασπρόμαυρη

# #19663
source: Unpublished
el: Αδημοσίευτο

# #19664
source: Live Broadcast
el: Ζωντανή Μετάδοση

# #19676
source: Drama
el: Δράμα

# #19677
source: Detective/Thriller
el: Αστυνομικό/Θρίλερ

# #19678
source: Adventure/Western/War
el: Περιπέτεια/Γουέστερν/Πολεμικό

# #19679
source: Science Fiction/Fantasy/Horror
el: Επιστημονική Φαντασία/Φαντασία/Τρόμου

# #19680
source: Comedy
el: Κωμωδία

# #19681
source: Soap/Melodrama/Folkloric
el: Σαπουνόπερα/Μελόδραμα/Φολκλορικό

# #19682
source: Romance
el: Ρομαντική

# #19683
source: Serious/ClassicalReligion/Historical
el: Σοβαρή/Κλασική/Θρησκευτική/Ιστορική

# #19684
source: Adult
el: Πορνό

# #20000
source: Saved music folder
el: Φάκελος αποθήκευσης μουσικής

# #20001
source: Use external DVD player
el: Χρήση εξωτερικού αναπαραγωγέα DVD

# #20002
source: External DVD player
el: Εξωτερικός αναπαραγωγέας DVD

# #20003
source: Trainers folder
el: Φάκελος trainer

# #20004
source: Screenshot folder
el: Φάκελος στιγμιότυπων

# #20006
source: Playlists folder
el: Φάκελος λιστών αναπ/γής

# #20007
source: Recordings
el: Εγγραφές

# #20008
source: Screenshots
el: Στιγμιότυπα

# #20009
source: Use Kodi
el: Χρήση Kodi

# #20011
source: Music playlists
el: Λίστες αναπ/γής μουσικής

# #20012
source: Video playlists
el: Λίστες αναπ/γής βίντεο

# #20013
source: Do you wish to launch the game?
el: Να εκτελεστεί το παιχνίδι;

# #20014
source: Sort by: Playlist
el: Ταξ.: Λίστα αναπ/γής

# #20015
source: Remote thumb
el: Απομακρυσμένη μικρογραφία

# #20016
source: Current thumb
el: Τρέχουσα μικρογραφία

# #20017
source: Local thumb
el: Τοπική μικρογραφία

# #20018
source: No thumb
el: Χωρίς μικρογραφία

# #20019
source: Choose thumbnail
el: Επιλογή μικρογραφίας

# #20023
source: Conflict
el: Διένεξη

# #20024
source: Scan new
el: Σάρωση νέων

# #20025
source: Scan all
el: Σάρωση όλων

# #20026
source: Region
el: Περιοχή

# #20037
source: Summary
el: Συνοπτικά

# #20038
source: Lock music window
el: Κλείδωμα παραθύρου μουσικής

# #20039
source: Lock videos window
el: Κλείδωμα παραθύρου βίντεο

# #20040
source: Lock pictures window
el: Κλείδωμα παραθύρου εικόνων

# #20041
source: Lock programs & scripts windows
el: Κλείδωμα παραθύρου εφαρμογών & script

# #20042
source: Lock file manager
el: Κλείδωμα της διαχείρισης αρχείων

# #20043
source: Lock settings
el: Κλείδωμα των ρυθμίσεων

# #20044
source: Start fresh
el: Έναρξη με νέες ρυθμίσεις

# #20045
source: Enter master mode
el: Είσοδος στη γενική διαχείριση

# #20046
source: Leave master mode
el: Έξοδος από τη γενική διαχείριση

# #20047
source: Create profile '%s'?
el: Δημιουργία προφίλ '%s';

# #20048
source: Start with fresh settings
el: Έναρξη με νέες ρυθμίσεις

# #20049
source: Best available
el: Η καλύτερη δυνατή

# #20050
source: Auto-switch between 16x9 and 4x3
el: Αυτόματη εναλλαγή μεταξύ 16:9 και 4:3

# #20051
source: Treat stacked files as single file
el: Μεταχείριση στοιβαγμένων αρχείων σαν ένα

# #20052
source: Caution
el: Προσοχή

# #20053
source: Left master mode
el: Αποχώρηση από τη γεν. διαχείριση

# #20054
source: Entered master mode
el: Εισαγωγή στη γεν. διαχείριση

# #20055
source: Allmusic.com thumb
el: Μικρογραφία Allmusic.com

# #20057
source: Remove thumbnail
el: Αφαίρεση μικρογραφίας

# #20058
source: Add profile...
el: Προσθήκη προφίλ...

# #20059
source: Query info for all albums
el: Εύρεση πληροφοριών για όλα τα άλμπουμ

# #20060
source: Media info
el: Πληροφορίες πολυμέσων

# #20061
source: Separate
el: Ξεχωριστές

# #20062
source: Shares with default
el: Κοινόχρηστα με προεπιλογές

# #20063
source: Shares with default (read only)
el: Κοινόχρηστα με προεπιλογές (ανάγνωση μόνο)

# #20064
source: Copy default
el: Αντιγραφή προεπιλογών

# #20065
source: Profile picture
el: Εικόνα προφίλ

# #20066
source: Lock preferences
el: Προτιμήσεις κλειδώματος

# #20067
source: Edit profile
el: Επεξεργασία προφίλ

# #20068
source: Profile lock
el: Κλείδωμα προφίλ

# #20069
source: Could not create folder
el: Αδύνατη η δημιουργία φακέλου

# #20070
source: Profile directory
el: Φάκελος προφίλ

# #20071
source: Start with fresh media sources
el: Έναρξη με νέες πηγές πολυμέσων

# #20072
source: Make sure the selected folder is writable
el: Βεβαιωθείτε ότι ο επιλεγμένος φάκελος μπορεί να εγγραφεί

# #20073
source: and that the new folder name is valid
el: και ότι το νέο όνομα είναι έγκυρο

# #20074
source: MPAA rating
el: Καταλληλότητα

# #20075
source: Enter master lock code
el: Εισαγωγή κωδικού κεντρικού κλειδώματος

# #20076
source: Ask for master lock code on startup
el: Αίτημα για κωδικό κεντρικού κλειδώματος στην εκκίνηση

# #20077
source: Skin settings
el: Ρυθμίσεις κελύφους

# #20078
source: - no link set -
el: - δεν έχει οριστεί σύνδεσμος -

# #20079
source: Enable animations
el: Ενεργοποίηση εφέ κίνησης

# #20080
source: Disable RSS during music
el: Απενεργοποίηση της Ροής Τίτλων Ειδήσεων (RSS) κατά την ακρόαση μουσικής

# #20081
source: Enable shortcut buttons
el: Ενεργοποίηση πλήκτρων συντόμευσης

# #20082
source: Show programs in main menu
el: Εμφάνιση εφαρμογών στο κεντρικό μενού

# #20083
source: Show music info
el: Εμφάνιση πληροφοριών για τη μουσική

# #20084
source: Show weather info
el: Εμφάνιση πληροφοριών για τον καιρό

# #20085
source: Show system info
el: Εμφάνιση πληροφοριών για το σύστημα

# #20086
source: Show available disk space C: E: F:
el: Εμφάνιση διαθέσιμου χώρου στα C: E: F:

# #20087
source: Show available disk space E: F: G:
el: Εμφάνιση διαθέσιμου χώρου στα E: F: G:

# #20088
source: Weather info
el: Πληροφορίες καιρού

# #20089
source: Drive space free
el: Ελεύθερος χώρος

# #20090
source: Enter the name of an existing share
el: Εισαγωγή ονόματος κοινόχρηστου πόρου

# #20091
source: Lock code
el: Κωδικός κλειδώματος

# #20092
source: Load profile
el: Φόρτωση προφίλ

# #20093
source: Profile name
el: Όνομα προφίλ

# #20094
source: Media sources
el: Πηγές πολυμέσων

# #20095
source: Enter profile lock code
el: Εισαγωγή κωδικού κλειδώματος προφίλ

# #20096
source: Login screen
el: Οθόνη σύνδεσης

# #20097
source: Fetching album info
el: Λήψη πληροφοριών άλμπουμ

# #20098
source: Fetching info for album
el: Λαμβάνονται πληροφορίες για το άλμπουμ

# #20099
source: Can't rip CD or track while playing from CD
el: Αδυναμία αντιγραφής του CD ή του τραγουδιού κατά την αναπαραγωγή του CD

# #20100
source: Master lock code and settings
el: Κωδικός κεντρικού κλειδώματος και επιλογές

# #20101
source: Entering master lock code always enables master mode
el: Ο κωδικός κεντρικού κλειδώματος να ενεργοποιεί πάντα τη γεν. διαχείριση

# #20102
source: or copy from default?
el: ή να αντιγράφεται ο προκαθορισμένος κωδικός;

# #20103
source: Save changes to profile?
el: Αποθήκευση αλλαγών στο προφίλ;

# #20104
source: Old settings found.
el: Βρέθηκαν παλιές ρυθμίσεις.

# #20105
source: Do you want to use them?
el: Θέλετε να τις χρησιμοποιήσετε;

# #20106
source: Old media sources found.
el: Βρέθηκαν παλιές πηγές πολυμέσων.

# #20107
source: Separate (locked)
el: Ξεχωριστές (κλειδωμένο)

# #20108
source: Root
el: Αρχ. Φάκελος

# #20109
source: Zoom
el: Μεγέθυνση

# #20110
source: UPnP settings
el: Ρυθμίσεις UPnP

# #20111
source: Autostart UPnP client
el: Αυτόματη έναρξη πελάτη UPnP

# #20112
source: Last login: %s
el: Τελευταία σύνδεση: %s

# #20113
source: Never logged on
el: Ποτέ δε συνδέθηκε

# #20114
source: Profile %i / %i
el: Προφίλ %i / %i

# #20115
source: User login / Select a profile
el: Σύνδεση χρήστη / Επιλογή προφίλ

# #20116
source: Use lock on login screen
el: Χρήση κλειδώματος στην οθόνη σύνδεσης

# #20117
source: Invalid lock code.
el: Λάθος κωδικός κλειδώματος.

# #20118
source: This requires the master lock to be set.
el: Απαιτείται ορισμός του κεντρικού κλειδώματος.

# #20119
source: Would you like to set it now?
el: Θέλετε να το ορίσετε τώρα;

# #20120
source: Loading program information
el: Φόρτωση πληροφοριών εφαρμογής

# #20122
source: True
el: Αληθές

# #20123
source: Mixing drinks
el: Αναμιγνύονται τα ποτά

# #20124
source: Filling glasses
el: Γεμίζουν τα ποτήρια

# #20125
source: Logged on as
el: Συνδεμένος σαν

# #20126
source: Log off
el: Αποσύνδεση

# #20128
source: Go to root
el: Μετάβαση σε αρχ. φάκελο

# #20130
source: Weave (inverted)
el: Weave (αντιστροφή)

# #20132
source: Restart video
el: Επανεκκίνηση βίντεο

# #20133
source: Edit network location
el: Επεξεργασία τοποθεσίας δικτύου

# #20134
source: Remove network location
el: Αφαίρεση τοποθεσίας δικτύου

# #20135
source: Do you want to scan the folder?
el: Θέλετε να σαρώσετε το φάκελο;

# #20136
source: Memory unit
el: Μονάδα μνήμης

# #20137
source: Memory unit mounted
el: Προσάρτηση μονάδας μνήμης

# #20138
source: Unable to mount memory unit
el: Αδύνατη η προσάρτηση μονάδας μνήμης

# #20139
source: In port %i, slot %i
el: Στη θύρα %i, υποδοχή %i

# #20140
source: Lock screensaver
el: Κλείδωμα προφύλαξης οθόνης

# #20141
source: Set
el: Ορισμός σε

# #20142
source: Username
el: Όνομα χρήστη

# #20143
source: Enter password for
el: Εισαγωγή κωδικού πρόσβασης για

# #20144
source: Shutdown timer
el: Χρονοδιακόπτης τερματισμού

# #20145
source: Shutdown interval (in minutes)
el: Χρόνος τερματισμού (σε λεπτά)

# #20146
source: Started, shutdown in %im
el: Ξεκίνησε, τερματισμός σε %i λεπτά

# #20147
source: Shutdown in 30 minutes
el: Τερματισμός σε 30 λεπτά

# #20148
source: Shutdown in 60 minutes
el: Τερματισμός σε 60 λεπτά

# #20149
source: Shutdown in 120 minutes
el: Τερματισμός σε 120 λεπτά

# #20150
source: Custom shutdown timer
el: Προσαρμογή χρονοδιακόπτη τερματισμού

# #20151
source: Cancel shutdown timer
el: Ακύρωση χρονοδιακόπτη τερματισμού

# #20152
source: Lock preferences for %s
el: Κλείδωμα ρυθμίσεων για %s

# #20153
source: Browse...
el: Αναζήτηση...
