Repository: xbmc/xbmc
Catalog: addons/weather.wunderground/resources/language/Albanian/strings.po
Languages: sq

# #32101
source: Location setup
sq: Cilësime të vendi

# #32102
source: Advanced options
sq: Cilësime të shtuara

# #32111
source: Location 1
sq: Vendi 1

# #32112
source: Location 2
sq: Vendi 2

# #32113
source: Location 3
sq: Vendi 3

# #32114
source: Location 1 display name
sq: Vendi 1 trego emrin

# #32115
source: Location 2 display name
sq: Vendi 2 trego emrin

# #32116
source: Location 3 display name
sq: Vendi 3 trego emrin

# #32117
source: Location 1 id
sq: Vendi 1 id

# #32118
source: Location 2 id
sq: Vendi 2 id

# #32119
source: Location 3 id
sq: Vendi 3 id

# #32120
source: Enable logging
sq: Aktivo logging

# #32121
source: Weekend
sq: Fundjavë

# #32122
source: Saturday/Sunday
sq: E Shtunë/E Diel

# #32123
source: Friday/Saturday
sq: E Premte/E Shtunë

# #32124
source: Thursday/Friday
sq: E Ejnte/E Premte

# #32125
source: Map zoom level
sq: Niveli i zoom'it i hartës

# #32126
source: Animated map
sq: Hart e gjallëruar

# #32501
source: New Moon
sq: Hëna e re

# #32502
source: Waxing Crescent
sq: Hëna e gjysme duke plotësuar

# #32503
source: First Quarter
sq: Hëna e plotësuar 1/4

# #32504
source: Waxing Gibbous
sq: Hëna duke plotësuar

# #32505
source: Full Moon
sq: Hëna e plotë

# #32506
source: Waning Gibbous
sq: Hëna e plotësuar 3/4

# #32507
source: Last Quarter
sq: Hëna e plotësuar 3/4

# #32508
source: Waning Crescent
sq: Hëna e plotësuar 3/4

# #32510
source: Warning
sq: Kujdësi

# #32511
source: Watch
sq: Shikimi

# #32512
source: Advisory
sq: Këshillë

# #32513
source: Statement
sq: Caktimi

# #32514
source: Outlook
sq: Pikëpamje

# #32515
source: Forecast
sq: Parashikimi
