Repository: xbmc/xbmc
Catalog: addons/visualization.milkdrop/resources/language/Tamil (India)/strings.po
Languages: ta_in

# #30000
source: Automatic Blend Time
ta_in: தானியங்கி கலப்பு நேரம்

# #30001
source: Time Between Presets
ta_in: அடுக்கு குணங்கலுக்கு இடையேயான நேரம்

# #30002
source: Additional Random Time
ta_in: கூடுதல் குறிப்பிலாத நேரம்

# #30003
source: Enable Anisotropic Filtering
ta_in: திசையற்ற வடித்தல் செயல்படுத்த

# #30004
source: Enable Hard Cuts
ta_in: கடின குறைப்புக்கள் செயல்படுத்த

# #30005
source: Loudness Threshold For Hard Cuts
ta_in: கடின குறைப்புக்கள் உரத்தல் எல்லையளவு

# #30006
source: Average Time Between Hard Cuts
ta_in: கடின குறைப்புக்கள் இடையே சராசரி நேரம்

# #30007
source: Maximum Refresh Rate
ta_in: அதிகபட்ச புதுப்பிக்கும் வீதம்

# #30008
source: Enable Stereo 3D
ta_in: ஸ்டீரியோ 3D செயல்படுத்த

# #30009
source: Preset Pack
ta_in: முன்னமைவு தொகுப்பு

# #30010
source: User Preset Folder
ta_in: பயனர் முன்னமைவு கோப்புறை

# #30011
source: Preset Shuffle Mode
ta_in: முன்னமைவு குலை முறை

# #30020
source: WA51 Presets
ta_in: WA51 முன்னமைவுகள்

# #30021
source: Winamp Presets
ta_in: Winamp முன்னமைவுகள்

# #30022
source: User Defined Preset Folder
ta_in: பயனர் வரையறுக்கப்பட்ட முன்னமைவு கோப்புறை

# #30050
source: %2.0f secs
ta_in: %2.0f நொடிகள்
