Repository: xbmc/xbmc
Catalog: addons/visualization.dxspectrum/resources/language/resource.language.szl/strings.po
Languages: szl

# #30000
source: Mode
szl: Tryb

# #30001
source: Filled
szl: Wypołniōne

# #30003
source: Points
szl: Pōnkty

# #30004
source: Bar Height
szl: Wyżka lajsty

# #30005
source: Small
szl: Małe

# #30006
source: Default
szl: Wychodne

# #30007
source: Big
szl: Sroge

# #30008
source: Very Big
szl: Fest sroge

# #30009
source: Speed
szl: Wartkość

# #30010
source: Very Slow
szl: Fest poleku

# #30011
source: Slow
szl: Poleku

# #30012
source: Default
szl: Wychodne

# #30013
source: Fast
szl: Wartko

# #30014
source: Very Fast
szl: Fest wartko
