Repository: xbmc/xbmc
Catalog: addons/skin.confluence/language/Albanian/strings.po
Languages: sq

# #31000
source: Change Your
sq: Ndrysho

# #31003
source: Power Options
sq: Opcionet e Energjisë

# #31004
source: Working...
sq: Në Funksionim...

# #31005
source: Hide Information
sq: Fshehi Informacionet

# #31006
source: View Options
sq: Opcionet e Pamjes

# #31008
source: Fullscreen
sq: Ekran i Plotë

# #31009
source: Total Duration
sq: Kohëzgjatja

# #31022
source: Music - Files
sq: Skeda - Muzikë

# #31023
source: Playing
sq: Duke riprodhuar

# #31024
source: Page
sq: Faqe

# #31025
source: Items
sq: Artikuj

# #31026
source: Misc Options
sq: Opcione të Ndryhme

# #31027
source: Location
sq: Lokalizimi

# #31028
source: Poster Wrap
sq: Mbështjellëse Posteri

# #31031
source: Pic Thumbs
sq: Foto Thumb

# #31032
source: Image Wrap
sq: Mbështjellëse Imazhi

# #31040
source: Now Playing
sq: Duke Riprodhuar tani

# #31042
source: PLAYING
sq: DUKE RIPRODHUAR

# #31043
source: PAUSED
sq: PAUZUAR

# #31044
source: FAST FORWARD
sq: PËRSHPEJTO

# #31045
source: REWIND
sq: RIKTHE

# #31048
source: Visualization Presets
sq: Paracilësime të Vizualizimit

# #31049
source: End Time
sq: Koha e Përfundimit

# #31050
source: Sort: Ascending
sq: Rendit: Me Ngjitje

# #31051
source: Sort: Descending
sq: Rendit: Me Zbritje

# #31055
source: Open playlist
sq: Hape listën e dëgjimit

# #31056
source: Save playlist
sq: Ruaj listën e dëgjimit

# #31057
source: Close playlist
sq: Mbyll listën e dëgjimit

# #31058
source: System music files
sq: Skeda muzikore të sistemit

# #31059
source: Current playlist
sq: Listë dëgjimi aktuale

# #31060
source: This file is stacked, select the part you want to play from.
sq: Kjo skedë është e grupuar, zgjidh pjesën, nga e cila dëshiron të riprodhosh.

# #31061
source: Current Selected
sq: Selekcioni aktual

# #31101
source: Home screen options
sq: Opcionet e ekranit kryesor

# #31102
source: Background
sq: Sfondi

# #31103
source: Show "Paused" in picture slide show
sq: Trego "Pauzuar" gjatë paradës së fotografive

# #31104
source: Play Trailers in a window [COLOR=grey3](Video Information Dialog Only)[/COLOR]
sq: Riprodho "Trailer'in" në një dritare [COLOR=grey3](vetëm dialogu i informacioneve video)[/COLOR]

# #31106
source: Miscellaneous options
sq: Opcione të ndryshme

# #31107
source: Hide Flagging read from video filenames [COLOR=grey3](Blu-ray, HD-DVD)[/COLOR]
sq: Fshehe "Flagging read" nga emrat të skedave [COLOR=grey3](Blu-ray, HD-DVD)[/COLOR]

# #31108
source: Hide Main Menu Buttons
sq: Fshehi Butonet e Menys Kryesore

# #31109
source: Enable Custom Background
sq: Aktivizo Sfond alternativ

# #31110
source: Background path:
sq: Rregjistri i Sfondit

# #31111
source: Hide
sq: Fsheh

# #31112
source: Options
sq: Opcionet

# #31116
source: Show Recently added Albums
sq: Trego Albume të shtuar së fundi

# #31117
source: Show Recently added Videos
sq: Trego Video të shtuar së fundi

# #31118
source: Home Page Programs Submenu
sq: Ndërmenyja e programeve të faqes kryesore

# #31119
source: Hide Background Fanart
sq: Fsheh Fanart në Sfond

# #31122
source: Weather Page
sq: Faqja e Motit

# #31124
source: Show Background "Now Playing" Video
sq: Trego Sfondin "Duke Riprodhuar" Video

# #31125
source: Show Background "Now Playing" Visualization
sq: Trego Sfondin "Duke Riprodhuar" Vizualizim

# #31126
source: Play TV theme songs in video library (TvTunes add-on)
sq: Luaj melodinë kryesore përcjellse së një seriali televiziv ne bibleotekën video (Shtesa TVTunes)

# #31128
source: Lyrics
sq: Tekste Këngësh

# #31129
source: Hide Fanart in full screen visualization
sq: Fsheh Fanart gjat vizualizimit në ekran të plotë

# #31132
source: Lyrics Add-on
sq: Shtesë Tekstesh të Këngëve

# #31133
source: Subtitle Add-on
sq: Shtesë Subtitërash

# #31134
source: Home Page Videos Submenu
sq: Submeny Video në Faqen Kryesore

# #31135
source: Home Page Music Submenu
sq: Submeny Muzikë në Faqen Kryesore

# #31136
source: Home Page Pictures Submenu
sq: Submeny Foto në Faqen Kryesore

# #31140
source: Music OSD
sq: OSD Muizikë

# #31141
source: Video OSD
sq: OSD Video

# #31200
source: Shortcuts
sq: Shkurtor

# #31203
source: Choose Your Song
sq: Zgjidh Këngën Tënde

# #31205
source: Lyrics Source
sq: Origjinë Tekstesh të Këngëve

# #31206
source: Found
sq: Gjetur

# #31207
source: Find More Items
sq: Kërko më shumë artikuj

# #31208
source: Upcoming Episodes
sq: Episode të ardhsme

# #31300
source: Current Temp
sq: Temperatura Aktuale

# #31301
source: Last Updated
sq: Azhornuar së Fundi

# #31303
source: Data provider
sq: Pajisës i të Dhënave

# #31307
source: Hide Fanart
sq: Fsheh Fanart

# #31308
source: Movie Details
sq: Detale të Filmit

# #31309
source: Memory Used:
sq: Memorje e Përdorur

# #31310
source: Track Number
sq: Numri i Këngës

# #31311
source: Fanart image[CR][CR]Unavailable[CR][CR] Click button to set
sq: Imazhi Fanart [CR][CR]i padisponueshëm[CR][CR] Kliko butonin për aktualizimin

# #31312
source: Current Scraper
sq: "Scraper" i Zgjedhur

# #31313
source: Choose a Scraper
sq: Zgjidh një "Scraper"

# #31314
source: Content Scanning Options
sq: Opcionet e Skanimit të Përmbajtjes

# #31317
source: Set Fanart Path
sq: Vendos Vendndodhjen e "Fanart'it"

# #31319
source: Selected Profile
sq: Profili i Zgjedhur

# #31320
source: Last Logged In
sq: I Paraqitur së Fundi

# #31321
source: Karaoke Song Selector
sq: Përzgjedhës i Këngëve Karaoke

# #31322
source: Aired
sq: Në Transmetim

# #31325
source: Playlist Options
sq: Opcionet e Listës së Degjimit

# #31326
source: Created
sq: Krijuar

# #31327
source: Resolution
sq: Zbërthimi

# #31328
source: Recently Added
sq: Shtuar së fundi

# #31329
source: [B]Timer set![/B] [COLOR=grey2] - System auto shutdown in[/COLOR]
sq: [B]"Timer" ështe vendosur![/B] [COLOR=grey2] - Auto mbyllja në [/COLOR]

# #31330
source: Click button to play[CR][CR]Movie trailer
sq: Kliko butonin për të riprodhuar[CR][CR]Film "trailer'in"

# #31331
source: Album Details
sq: Detalet e Albumeve

# #31351
source: Pause
sq: Pauzo

# #31352
source: Stop
sq: Ndalo

# #31353
source: Fast Forward
sq: Përshpejto

# #31354
source: Rewind
sq: Rikthe

# #31355
source: Movie menu
sq: Meny Filmi

# #31356
source: Download Subtitles
sq: Shkarko Subtitra

# #31390
source: Skin default
sq: Standartet e Maskës

# #31391
source: Skin default with no Caps
sq: Maska kryesore pa shkronja kapitale

# #31392
source: Arial based
sq: Në Arial

# #31400
source: [B]CONFIGURE APPEARANCE SETTINGS[/B][CR][CR]Change the skin · Set language and region · Change file listing options[CR]Set up a screensaver
sq: [B]KONFIGURO OPCIONET TË PAMJES[/B][CR][CR]Ndrysho maskën · Cakto gjuhën dhe rajonin · Ndrysho opcionet e skedarit[CR]Cakto një Ekran-ruajtes

# #31401
source: [B]CONFIGURE VIDEO SETTINGS[/B][CR][CR]Manage your video library · Set video playback options · Change video listing options[CR]Set subtitle fonts
sq: [B]KONFIGURO OPCIONET E VIDEOVE[/B][CR][CR]Menaxho video-bibliotekën tënde · Cakto opcionet e video-riprodhimit · Ndrysho pamjen e video-listës[CR]Cakto shkrimin e subtitrave

# #31402
source: [B]CONFIGURE MUSIC SETTINGS[/B][CR][CR]Manage your music library · Set music playback options · Change music listing options[CR]Setup song submission · Set karaoke options
sq: [B]KONFIGURO OPCIONET E MUZIKËS[/B][CR][CR]Menaxho bibliotekën e muzikës tënde · Cakto opcione të riprodhimit të muzikës · Ndrysho pamjen e listës së muzikës[CR]Cakto opcionet karaoke

# #31403
source: [B]CONFIGURE PICTURE SETTINGS[/B][CR][CR]Set picture listing options · Configure slideshows
sq: [B]KONFIGURO OPCIONET E IMAZHEVE[/B][CR][CR]Cakto pamjen e listës së imazheve · Konfiguro paradën (slideshows)

# #31404
source: [B]CONFIGURE WEATHER SETTINGS[/B][CR][CR]Set three cities to collect weather information
sq: [B]KONFIGURO OPCIONET E MOTIT[/B][CR][CR]Cakto tre shtete për shkarkimin e informatave mbi motin

# #31406
source: [B]CONFIGURE SYSTEM SETTINGS[/B][CR][CR]Setup and calibrate displays · Configure audio output · Setup remote controls[CR]Set power saving options · Enable debugging · Setup master lock
sq: [B]KONFIGURO OPCIONET E SISTEMIT[/B][CR][CR]Konfiguro dhe Kalibro Ekranet · Konfiguro daljen e zërit · Konfiguro telekomandat [CR]Cakto opcionet për kursimin e rrymës · Aktivizo debugging · Konfiguro dryrin përdorues

# #31408
source: [B]CONFIGURE ADD-ONS[/B][CR][CR]Manage your installed Add-ons · Browse for and install Add-ons from xbmc.org[CR]Modify Add-on settings
sq: [B]KONFIGURO SHTESAT[/B][CR][CR]Menaxho shtesat e installuara · Shiko dhe installo shtesa nga xbmc.org[CR]Modifiko konfigurimet e shtesave.

# #31409
source: [B]CONFIGURE TV SETTINGS[/B][CR][CR]Change fullscreen info · Manage EPG data settings
sq: [B]KONFIGURO OPCIONET E TV[/B][CR][CR]Ndrysho informacionet në ekran të plotë · Menaxho opcionet e EPG's

# #31410
source: [B]CONFIGURE SERVICE SETTINGS[/B][CR][CR]Setup control of XBMC via UPnP and HTTP · Configure file sharing[CR]Enable Zeroconf · Configure AirPlay
sq: [B]KONFIGURO OPCIONET E SERVISEVE[/B][CR][CR]Konfiguro kontrollimin e XBMC'së nëpërmjet UPnP dhe HTTP · Konfiguro shpërndarjen e skedeve[CR]Aktivizo Zeroconf · Konfiguro AirPlay

# #31411
source: First run help....
sq: Ndihma për përdorimin e parë...

# #31412
source: This tab signifies that there is a menu off to the side of this window that contains extra options for this section. To access the menu, navigate to the left with your remote control or keyboard or place your mouse pointer over the tab. [CR][CR]Click "Ok" to close this dialog. It will not appear again.
sq: Ky tab sinjifikon që eksiston një meny në këto dritare në të majtë që përmbanë opcione plotësuese për këtë sekcion. Për të hapur këtë meny, navigo në të majtë me telekomandën ose tastierrën tënde ose lëviz mausin në të majtë.[CR][CR]Kliko "OK" për të mbyllur këtë dialog. Nuk do të paraqitet përsëri.

# #31421
source: Select your XBMC user Profile[CR]to login and continue
sq: Zgjidh XBMC profilin [CR] në cilin don të paraqitesh dhe vazhdo

# #31500
source: Recording Timers
sq: Orari i regjistrimit

# #31501
source: Scheduled Time
sq: Koha e caktuar

# #31503
source: Add Group
sq: Shto Grup

# #31504
source: Rename Group
sq: Riemro Grupet

# #31505
source: Delete Group
sq: Fshij Grupet

# #31506
source: Available[CR]Groups
sq: Grupë në dispzicion[CR]

# #31509
source: Channel Group
sq: Grupi i kanaleve

# #31510
source: Timer Set
sq: Orari i saktësuar

# #31511
source: Channel Options
sq: Opcionet e kanaleve

# #31901
source: 36 Hour Forecast
sq: Parashikimi 36 Orësh

# #31902
source: Hourly Forecast
sq: Parashikimi Orë pas Orë

# #31903
source: Weekend Forecast
sq: Parashikimi Fundjavë

# #31904
source: 10 Day Forecast
sq: Parashikimi 10 Ditësh

# #31905
source: Forecast
sq: Parashikimi

# #31908
source: Chance of Precipitation
sq: Mundësi për Reshje

# #31909
source: Fetching forecast info...
sq: Duke tërhequr parashikimin...

# #31910
source: Map & Alerts
sq: Harta & Alarme
