Repository: xbmc/xbmc
Catalog: addons/skin.plex/language/*/strings.po
Languages: dutch, french, italian

# #31852
source: At Plex, we would like to thank the following projects, without whom none of this would be possible:
dutch: Bij Plex willen we de volgende projecten bedanken, zonder hun was dit niet mogelijk geweest:
french: Dans l'équipe Plex, nous voudrions remercier les projets suivants, sans lesquels rien n'aurait pu être possible:

# #31853
source: [COLOR=orange]XBMC[/COLOR]: The most important one, for supplying us with a great foundation to build on.
dutch: [COLOR=orange]XBMC[/COLOR]: De meest belangrijke, voor het leveren van een geweldige basis om op te bouwen.
french: XBMC: le plus important, qui nous a fourni une énorme base de développement.

# #31854
source: [COLOR=orange]Team RazorFish[/COLOR]: The talented team who created the original MediaStream skin.
dutch: [COLOR=orange]Team RazorFish[/COLOR]: Het getalenteerde team die het originele Mediastream thema hebben gemaakt.
french: Team RazorFish: l'équipe talentueuse qui a créé la superbe skin MediaStream.

# #31855
source: [COLOR=orange]FFmpeg[/COLOR]: Without this, there would be no decoding of video inside Plex. A critical component, to be sure.
dutch: [COLOR=orange]FFmpeg[/COLOR]: Zonder dit zou er geen decoding van video plaatsvinden in Plex. Een kritiek component, dat is het zeker.
french: FFmpeg: sans cela, il n'y aurait pas de décodage vidéo dans Plex. Pour sûr un composant critique.

# #31856
source: [COLOR=orange]SQLite[/COLOR]: The media database is stored using this excellent, industry standard free database.
dutch: [COLOR=orange]SQLite[/COLOR]: De media database word opgeslagen in deze uitstekende, industrie standaard gratis database.
french: SQLite: la base de données multimédia est stockée dans ce système de base de données gratuit de niveau industriel.

# #31857
source: [COLOR=orange]CxImage[/COLOR]: The workhorse code responsible for loading images and photos. It uses lots of other libraries like libPNG, libJPEG, etc.
dutch: [COLOR=orange]CxImage[/COLOR]: De werkpaard code die verantwoordelijk is voor het laden van afbeeldingen en fotos. Deze gebruikt een aantal andere bibliotheken zoals libPNG, libJPEG, etc.
french: CxImage: le socle de code responsable de l'affichage des images et des photos. Il utilise une multitude d'autres librairies telles que libPNG, libJPEG, etc.

# #31858
source: [COLOR=orange]FreeType[/COLOR]: This code is responsible for the beautiful rendering of fonts within the application.
dutch: [COLOR=orange]FreeType[/COLOR]: Deze code is verantwoordelijk voor het mooie renderen van lettertypes in de applicatie.
french: FreeType: ce code est responsable du magnifique rendu des polices de caractères dans l'application.

# #31859
source: [COLOR=orange]Python[/COLOR]: The media center embeds the Python interpreter to provide powerful scripting functionality.
dutch: [COLOR=orange]Python[/COLOR]: De media center gebruikt de Python interpreter om krachtige script functionaliteit toe te voegen.
french: Python: le centre multimédia intègre un interpréteur Python pour fournir de puissantes fonctionalités de scripts.

# #31860
source: Please visit http://www.plexapp.com/credits.php for links and more information.
dutch: Ga naar http://www.plexapp.com/credits.php voor links en meer informatie.
french: Visitez http://www.plexapp.com/credits.php pour les liens et d'autres informations.

# #31900
source: Login As
dutch: Inloggen als
french: Connexion
italian: Loggati Come

# #31901
source: Modify Your
dutch: Wijzig
french: Modifier votre
italian: Modifica

# #31902
source: Profile
dutch: Profiel
french: Profil
italian: Il Profilo

# #31903
source: Profile name
dutch: Profielnaam
french: Nom du profil
italian: Il Nome Profilo

# #31904
source: Profile picture
dutch: Profielfoto
french: Image du profil
italian: L'Immagine Profilo

# #31950
source: Go to your
dutch: Ga naar je
french: Afficher vos

# #31951
source: Visit
dutch: Bezoek
french: Ouvrir

# #31952
source: Channel Directory
dutch: Kanalen Overzicht
french: Plex Channels

# #31953
source: Get
dutch: Krijg
french: Ouvrir

# #31954
source: Help
dutch: Hulp
french: Aide

# #31955
source: Preferences
dutch: Voorkeuren
french: Préférences

# #31956
source: Show
french: Montrer

# #31960
source: Sleep
dutch: Sluimer
french: Mettre en veille

# #31961
source: Shut Down
dutch: Afsluiten
french: Éteindre

# #31962
source: Power Menu
dutch: Menu
french: le menu Mise en route

# #31963
source: displays
french: affichages

# #31964
source: Sleep Display
dutch: Scherm Slapen
french: Mettre l'écran en veille

# #31970
source: Channels
dutch: Kanalen
french: Extensions

# #31971
source: Video Channels
dutch: Video Kanalen
french: Extensions Vidéos

# #31972
source: Music Channels
dutch: Muziek Kanalen
french: Extensions Musiques

# #31973
source: Picture Channels
dutch: Foto Kanalen
french: Extensions Images

# #31981
source: Show Thumbnails in List View
dutch: Toon miniaturen in Lijst overzicht
french: Afficher les vignettes dans la vue Liste

# #31982
source: Show Plot in Video OSD
dutch: Laat plot zien in Video OSD
french: Afficher le résumé dans l'interface Vidéo

# #31983
source: Show Picture Descriptions in Slideshow
dutch: Laat Afbeelding Omschrijving zien in Slideshow
french: Afficher la description des photos pendant le diaporama

# #31984
source: Show Now Playing Information in Visualisations
dutch: Laat Nu aan het Afspelen informatie zien in Visualisaties
french: Afficher le cadre Lecture en cours dans les Visualisations

# #31985
source: Show Separate Menu Items for Plug-in Sections
dutch: Laat apart Menu item zijn voor Plug-in secties
french: Entrées séparées du menu pour les sections Plug-ins

# #31999
source: End Time
dutch: Eindtijd
french: Heure de fin

# #32000
source: Please choose the type of audio connector used on this computer. If you're unsure, or if you're using built-in speakers, you can accept the default and continue. You can access this setting at any time in the Preferences.
dutch: Kies het type audio verbinding dat je gebruikt op deze computer. Als je niet zeker bent, of als je ingebouwde speakers gebruikt, kun je de standaard selectie gebruiken en doorgaan. Je kunt de instellingen later ook nog aanpassen.
french: S'il vous plaît choisissez le type de connecteur audio utilisé sur cet ordinateur. Si vous n'êtes pas sûr, ou si vous utilisez des haut-parleurs, vous pouvez accepter la valeur par défaut et continuer. Vous pouvez accéder à ce paramètre à tout moment dans les Préférences.

# #32001
source: Plex Home Theater Setup
french: Installation de Plex Home Theater

# #32003
source: [B]Welcome to Plex![/B] [CR][CR]In order to ensure the best experience, let's take a minute to determine some audio settings and get signed in to [B]myPlex[/B]. [CR][CR][B]myPlex[/B] lets you queue and share online videos, and access shared media from your friends' libraries. [CR][CR]If you don't already have a free [B]myPlex[/B] account, you can create one now at [COLOR=orange]http://my.plexapp.com[/COLOR] before continuing.
dutch: [B]Welkom bij Plex![/B] [CR][CR] Om de beste ervaring te garanderen gaan we nu eerst een aantal instellingen nalopen en inloggen bij [B]myPlex[/B]. [CR][CR][B]myPlex[/B] laat je een wachtrij maken of videos online delen, en geeft toegang tot gedeelde media van je vrienden. [CR][CR]Als je nog geen gratis [B]myPlex[/B] account hebt, kun je die aanmaken via [COLOR=orange]http://my.plexapp.com[/COLOR] voordat je verder gaat.
french: [B] Bienvenue sur Plex! [/ B] [CR] [CR] Afin de vous assurer une meilleure expérience, nous allons prendre une minute pour déterminer certains paramètres audio et connecter votre compte [B] myPlex [/ B]. [CR] [CR] [B] myPlex [/ B] vous permet de partager des vidéos en ligne, et d'accéder aux médias partagés provenant de bibliothèques de vos amis. [CR] [CR] Si vous ne possédez pas déjà un compte [B] myPlex [/ B] , vous pouvez en créer un maintenant sur [COLOR = Orange] http://my.plexapp.com [/ COLOR] avant de continué.

# #32100
source: Set Rating
dutch: Voeg beoordeling toe
french: Définir la note
italian: Imposta Valutazione

# #32101
source: Episodes added
dutch: Afleveringen toegevoegd
french: Episodes ajoutés

# #32102
source: All Episodes
dutch: Alle Afleveringen
french: Tous les épisodes

# #32103
source: There is no description available for this
dutch: Er is geen beschrijving beschikbaar hiervoor
french: Il n'y a pas de description pour ce

# #32104
source: You can add one for it in the Media Manager
dutch: Je kunt een toevoegen via de Media Manager
french: Vous pouvez en ajouter un dans le Media Manager

# #32105
source: * Plot hidden to avoid spoilers *
dutch: * Plot onzichtbaar om spoilers te voorkomen *
french: * Masqué pour éviter les spoilers *

# #31004
source: Applications
dutch: Toepassingen
italian: I Programmi

# #31020
source: Options
dutch: Opties
italian: Opzioni

# #31031
source: Active
dutch: Actief
italian: Attivo

# #31115
source: N/A
dutch: N/B
italian: N/D

# #31124
source: Eps.
dutch: Afl.
italian: Epis.

# #31608
source: Source
dutch: Bron
italian: Sorgente

# #31609
source: Dest
dutch: Doel

# #31657
source: Image
dutch: Afbeelding
italian: Immagine

# #31704
source: Photo
dutch: Foto
italian: Foto

# #31709
source: Concave
dutch: Hol
italian: Concavo

# #31805
source: Note
dutch: Opmerking
italian: Nota

# #31061
source: Scripts
italian: Script
