Repository: xbmc/xbmc
Catalog: addons/skin.plex/language/*/strings.po
Languages: dutch, french, italian

# #31000
source: Browse
dutch: Bladeren
french: Parcourir
italian: Esplora

# #31001
source: Videos
french: Vidéos
italian: I Video

# #31002
source: Music
dutch: Muziek
french: Musique
italian: La Musica

# #31003
source: Pictures
dutch: Foto's
french: Images
italian: Le Immagini

# #31005
source: Weather
dutch: Weer
french: Météo
italian: Il Meteo

# #31006
source: System
dutch: Systeem
french: Système
italian: Il Sistema

# #31007
source: Quit
dutch: Aan/Uit
french: Quitter
italian: On/Off

# #31008
source: TV Shows
dutch: TV series
french: Séries TV
italian: Serie TV

# #31011
source: Watch your
dutch: Kijk naar
french: Visionner vos
italian: Guarda

# #31012
source: Listen to
dutch: Luister naar
french: Écouter votre
italian: Ascolta

# #31013
source: View your
dutch: Bekijk
french: Voir vos
italian: Vedi

# #31014
source: Use your
dutch: Gebruik
french: Utiliser vos
italian: Usa

# #31015
source: Check
dutch: Raadpleeg
french: Consulter
italian: Controlla

# #31016
source: Change your
dutch: Configureer
french: Configurer les
italian: Configura

# #31019
source: Play the
dutch: Speel
french: Jouer le
italian: Suona

# #31021
source: Seasons
dutch: Seizoenen
french: Saisons
italian: Stagioni

# #31022
source: Hide
dutch: Verberg
french: Cacher
italian: Nascondi

# #31023
source: Sort By
dutch: Sorteer op
french: Lister par
italian: Ordina Per

# #31024
source: Sort Direction
dutch: Sorteerrichting
french: Direction du tri
italian: Direzione

# #31025
source: Backward
dutch: Achterwaarts
french: Reculer
italian: Decrescente

# #31026
source: Forward
dutch: Voorwaarts
french: Avancer
italian: Crescente

# #31027
source: Began
dutch: Gestart
french: Débuté
italian: Partito

# #31028
source: Finished
dutch: GeÃ«indigd
french: Terminé
italian: Terminato

# #31029
source: Writer
dutch: Schrijver
french: Scénariste
italian: Scrittore

# #31030
source: Track No.
dutch: Nummer
french: Piste No.
italian: Traccia N.

# #31032
source: Instrmts
dutch: Instrumenten
french: Instruments
italian: Strumenti

# #31033
source: Last Refreshed
dutch: Laatst ververst
french: Mise-à-jour le
italian: Ultimo Aggiornamento

# #31034
source: Build
french: Version

# #31035
source: Free RAM
dutch: Vrij geheugen
french: RAM libre
italian: RAM Libera

# #31036
source: IP Addr.
dutch: IP-adres
french: Adresse IP
italian: Ind. IP

# #31037
source: Hard Drive Space
dutch: Harde schijf ruimte
french: Espace Disque
italian: Spazio Su Disco

# #31038
source: Choose Your
dutch: Kies
french: Choisir votre
italian: Scegli

# #31039
source: Favourite
dutch: Favorieten
french: Favoris
italian: Preferito

# #31040
source: Modify
dutch: Wijzig
french: Modifier
italian: Modifica

# #31041
source: Editor
french: Éditeur

# #31042
source: Picture
dutch: Afbeelding
french: Image
italian: Immagine

# #31043
source: Check the
dutch: Raadpleeg
french: Consulter la
italian: Controlla

# #31044
source: By
dutch: Op
french: Par
italian: Per

# #31045
source: Recently Added
dutch: Recent toegevoegd
french: Nouveautés
italian: Nuovi Arrivi

# #31046
source: Path to Lyrics Script
dutch: Pad naar songteksten script
french: le chemin du script Lyrics
italian: Percorso dello Script Lyrics

# #31047
source: Not Available
dutch: Niet beschikbaar
french: Indisponible

# #31050
source: Items
french: Élément

# #31051
source: Games
french: Jeux
italian: Giochi

# #31052
source: Emulators
french: Émulateurs
italian: Emulatori

# #31053
source: Apps
dutch: Applicaties
french: Applications
italian: Applicazioni

# #31060
source: Settings
dutch: Instellingen
french: Paramètres
italian: Settaggi

# #31062
source: File Manager
dutch: Verkenner
french: Gestionnaire de fichiers
italian: Esplora Risorse

# #31063
source: Favourites
dutch: Favorieten
french: Favoris
italian: Preferiti

# #31064
source: Profiles
dutch: Profielen
french: Profils
italian: Profili

# #31065
source: Info
french: Infos

# #31066
source: Refresh
dutch: Ververs
french: Rafraîchir
italian: Aggiorna

# #31067
source: About Your
dutch: Over
french: A propos de
italian: Il

# #31068
source: User ID:
dutch: Gebruiker ID:
french: Identifiant de l'utilisateur :

# #31069
source: Password:
dutch: Wachtwoord:
french: Mot de passe

# #31071
source: Shutdown
dutch: Uitschakelen
french: Éteindre
italian: Spegni

# #31072
source: Restart
dutch: Herstarten
french: Redémarrer
italian: Riavvia

# #31073
source: Reload XBMC
dutch: Herlaad XBMC
french: Relancer Plex
italian: Ricarica XBMC

# #31074
source: Dashboard
french: Tableau de bord

# #31075
source: Refresh Skin
dutch: Herlaad skin
french: Rafraîchir le thème
italian: Ricarica skin

# #31111
source: Movies
dutch: Films
french: Films
italian: I Film

# #31112
source: TV Shows
dutch: TV series
french: Séries TV
italian: Serie TV

# #31113
source: Clips
french: Vos Vidéos
italian: Clip

# #31114
source: Episode
dutch: Aflevering:
french: Épisode :
italian: Episodio:

# #31116
source: Movie Title
dutch: Filmtitel
french: Titre du Film
italian: Titolo Film

# #31117
source: Thumb
french: Vignette
italian: Icona

# #31119
source: Synopsis
dutch: Toelichting
french: Résumé
italian: Descrizione

# #31120
source: Star Rating
dutch: Waardering
french: Note
italian: Valutazione

# #31121
source: Movie Details
dutch: Film details
french: Détails du Film
italian: Dettagli Film

# #31122
source: Aired
dutch: Gelanceerd
french: Diffusé le
italian: Trasmesso

# #31125
source: Theater Times
dutch: Theatertijden
french: Sortie cinéma
italian: Orari

# #31126
source: TV Show Details
dutch: TV serie details
french: Détails Série TV
italian: Dettagli Serie

# #31127
source: Episode Details
dutch: Aflevering details
french: Informations sur l'épisode
italian: Dettagli Episodio

# #31128
source: Banner
french: Banière

# #31129
source: Rating
dutch: Waardering
french: Note
italian: Valutazione

# #31130
source: IMDb Rating
dutch: IMDb Waardering
french: Note IMDb

# #31132
source: Duration
dutch: Duur
french: Durée

# #31133
source: Subtitles
dutch: Ondertitels
french: Sous-titres

# #31134
source: Cast
dutch: Rolbezetting
french: Distribution

# #31135
source: Director
french: Réalisateur

# #31136
source: Writer
dutch: Schrijver
french: Scénariste
italian: Scrittore

# #31137
source: Episodes
dutch: Afleveringen
french: Épisodes

# #31138
source: Watched
dutch: Bekeken
french: Vus

# #31139
source: Unwatched
dutch: Niet bekeken
french: Non vus

# #31140
source: First Aired
dutch: Gelanceerd
french: Première diffusion

# #31141
source: Season
dutch: Seizoen
french: Saison

# #31142
source: Movie
dutch: Film
french: Film

# #31143
source: TV Show
french: Série télé

# #31144
source: Video
french: Vidéo

# #31145
source: Specials
french: Remerciements

# #31220
source: Currently Playing
dutch: Speelt nu
french: Lecture en cours
italian: In Riproduzione

# #31221
source: Previous Track
dutch: Vorig nummer
french: Piste précédente
italian: Traccia Precedente

# #31222
source: Upcoming Tracks
dutch: Volgende nummers
french: Piste suivante
italian: Tracce Successive

# #31223
source: Click for Lyrics
dutch: Songteksten ophalen
french: Paroles
italian: Clicca Per I Testi

# #31224
source: Open MENU for Options
dutch: Open MENU voor opties
french: Ouvrir le MENU options
italian: Apri Il MENU

# #31225
source: Rating
dutch: Waardering
french: Note
italian: Valutazione

# #31226
source: Change
dutch: Wijzig
french: Modifier
italian: Cambia

# #31227
source: Your Preset
dutch: Eigen voorkeur
french: Vos sélections
italian: Il Preset

# #31228
source: Lyrics
dutch: Songteksten
french: Paroles
italian: Testi

# #31229
source: Artist
dutch: Artiest
french: Artiste

# #31601
source: Appearance
dutch: Uiterlijk
french: Apparence
italian: Aspetto

# #31602
source: Network
dutch: Netwerk
french: Réseau
italian: Rete

# #31603
source: Skin
french: Thème

# #31604
source: General
dutch: Algemeen
french: Général
italian: Generale

# #31605
source: Home
dutch: Hoofdscherm
french: Accueil

# #31606
source: Change Preferences For
dutch: Wijzig instellingen van
french: Changer vos paramètres pour
italian: Cambia Impostazioni Per

# #31607
source: Current
dutch: Huidige
french: Actuel
italian: Attuale

# #31610
source: Playback
dutch: Afspelen
french: Lecture

# #31621
source: Disable
dutch: Deactiveer
french: Désactiver
italian: Disabilita

# #31622
source: Enable
dutch: Activeer
french: Activer
italian: Abilita

# #31623
source: Background
dutch: Achtergrond
french: Arrière-plan
italian: Sfondo

# #31624
source: Select
dutch: Selecteer
french: Choisir
italian: Seleziona

# #31625
source: Use Default
dutch: Gebruik standaard
french: Utiliser par défaut
italian: Usa Il Default

# #31650
source: Hide right blade
dutch: Verberg rechter submenu
french: Masquer la partie de droite
italian: Nascondi Colonna Destra

# #31651
source: Enable custom backgrounds
dutch: Activeer eigen achtergronden
french: Activer arrière-plans perso
italian: Abilita Sfondi Personalizzati

# #31652
source: Enable
dutch: Activeer
french: Activer
italian: Abilita

# #31653
source: View
dutch: Bekijk
french: Voir
italian: Visualizza

# #31654
source: Hide Thumb Labels in File Browser dialog
dutch: Verberg thumblabels in verkenner dialoog
french: Cacher le texte des vignettes sur la fenêtre fichier
italian: Nascondi Etichette Icone in Esplora Risorse

# #31655
source: Display rotated Season thumb in Episodes view
dutch: Toon gekantelde seizoenthumbs in afl. weergave
french: Afficher la vignette saison dans la vue Épisode
italian: Visualizza Icone Ruotate in Visualizzazione Episodi

# #31656
source: Backgrounds
dutch: Achtergronden
french: Arrière-plan
italian: Sfondi

# #31658
source: Folder
dutch: Map
french: Dossier
italian: Cartella

# #31659
source: Reset
dutch: Herstel
french: Ré-initialiser
italian: Resetta

# #31660
source: Enable Custom BG's on Home
dutch: Activeer eigen achtergronden op hoofdscherm
french: Activer arrière-plan perso sur l'accueil
italian: Abilita Sfondi Personalizzati nella Home

# #31661
source: Apple Movie Trailers
french: Bande annonce Apple

# #31662
source: Hide clock
dutch: Verberg klok
french: Cacher l'horloge
italian: Nascondi Orologio

# #31663
source: Show Media Count
dutch: Toon media aantal
french: Afficher le compteur de Media
italian: Visualizza Numero File

# #31664
source: Hide Scrollbars on Media Screens
dutch: Verberg schuifbalk op media schermen
french: Cacher la barre de défilement sur l'écran Média
italian: Nascondi Barre di Scorrimento nelle Schermate Media

# #31665
source: Hide Watched/Unwatched icons
dutch: Verberg bekeken/niet-bekeken iconen
french: Cacher les icônes vue/non vue
italian: Nascondi Icone Visto/Non Visto

# #31666
source: Show Blade in Centre of Screen
dutch: Toon hoofdmenu in het midden
french: Afficher la barre au milieu de l'écran
italian: Mostra Colonna al Centro dello Schermo

# #31668
source: Show Larger Clock
dutch: Toon grotere klok
french: Afficher la grande horloge
italian: Visualizza Orologio Grande

# #31669
source: Show Weather on Home
dutch: Toon weerbericht op hoofdscherm
french: Afficher la météo sur la page d'accueil
italian: Visualizza Meteo in Home

# #31670
source: Show Fanart
dutch: Toon fanart
french: Afficher les fanarts
italian: Visualizza Fanart

# #31671
source: Hide Plot in Video OSD
dutch: Verberg plot in video OSD
french: Cacher le résumé dans l'OSD Vidéo
italian: Nascondi Trama nell'OSD

# #31672
source: Hide Info
dutch: Verberg info
french: Cacher les Infos
italian: Nascondi Info

# #31673
source: Media Views
dutch: media weergaven
french: Vues Media
italian: Visualizzazioni

# #31674
source: Hide Fanart
dutch: Verberg fanart
french: Cacher les Fanarts
italian: Nascondi Fanart

# #31675
source: with Movies Views
dutch: bij film weergave
french: de la vue Films
italian: Nelle Visualizzazioni Media

# #31676
source: In Media Preview
dutch: bij media preview
french: de la vue Aperçu Media
italian: Nell'Anteprima Media

# #31677
source: with TV Shows List
dutch: bij TV series lijst
french: dans les listes séries télévisées
italian: Nella lista Serie TV

# #31678
source: Show Season thumb
dutch: Toon seizoenthumb
french: Vignette Saison
italian: Mostra Icone Stagione

# #31679
source: Hide Focus Details in Panel Stream
dutch: Verberg focusdetails bij paneel weergave
french: Cacher les détails dans la vue Panneau
italian: Nascondi Dettagli Fuoco in Panel Stream

# #31680
source: Hide Thumbs in List View
dutch: Verberg thumbs bij lijst weergave
french: Cacher les vignettes de la vue Liste
italian: Nascondi Icone in Modo Lista

# #31681
source: in Files Mode
dutch: in bestandsmodus
french: en mode Fichiers
italian: in Modo File

# #31682
source: on TV Wall
dutch: op projectiescherm
french: sur le mur TV
italian: in Muro TV

# #31683
source: with TV Views
dutch: bij TV weergave
french: de la vue TV
italian: in Vista TV

# #31684
source: Hide Custom Backgrounds
dutch: Verberg eigen achtergronden
french: Cacher les fonds perso
italian: Nascondi Sfondi Personalizzati

# #31685
source: Show Animated
dutch: Toon animatie bij
french: Afficher les animations de
italian: Mostra Animazioni

# #31686
source: Show Horizontal Music Vis
dutch: Toon horizontale muziek VIS
french: Afficher la visualisation musicale horizontalement
italian: Mostra Vis. Musicali Orizzontali

# #31687
source: with Video Views
dutch: bij video weergave
french: de la vue Video
italian: nei Video

# #31688
source: with Music Views
dutch: bij muziek weergave
french: de la vue Musique
italian: nella Musica

# #31689
source: with Pictures Views
dutch: bij foto weergave
french: de la vue Images
italian: nelle Immagini

# #31690
source: Hide No Thumb Icons
dutch: Verberg 'geen thumb' iconen
french: Cacher l'icône Vignette manquante
italian: Non Nascondere Icone

# #31691
source: Use Low Overlay for TV Shows Coverflow
dutch: Gebruik lagere overlay bij TV series coverflow
french: Utiliser une incrustation légère pour le Coverflow Série TV
italian: Utilizza Sovrapposizione Bassa in modo Coverflow per le Serie TV

# #31692
source: Hide Info in Wall Stream view
dutch: Verberg info bij muur weergave
french: Cacher les infos dans la vue Wall Stream
italian: Nascondi Info in Modo Muraglia

# #31693
source: Hide Thumbs in Options Menu
dutch: Verberg thumbs in opties menu
french: Cacher les vignettes du menu Options
italian: Nascondi Icone nel Menu Opzioni

# #31694
source: Show Now Playing UI on Left
dutch: Toon 'Speelt nu' venster links
french: Afficher le cadre Lecture en cours sur la gauche
italian: Mostra Interfaccia di Riproduzione a Sinistra

# #31695
source: Show AM/PM in clock
dutch: Toon AM/PM in klok
french: Afficher AM/PM sur l'horloge
italian: Visualizza AM/PM nell'orologio

# #31697
source: Hide Photo Description in Slideshow
dutch: Foto Beschrijving in Slideshow Verbergen
french: Cacher la description des photos pendant le diaporama

# #31701
source: Setup
french: Réglages

# #31702
source: Showcase
french: Démonstration
italian: Locandina

# #31703
source: Seasons
dutch: Seizoenen
french: Saisons
italian: Stagioni

# #31705
source: Convex
dutch: Bol
french: Convexe
italian: Convesso

# #31706
source: Episode Thumbs
dutch: Aflevering thumbs
french: Vignettes d'épisode
italian: Icone Episodi

# #31707
source: Media Preview
french: Aperçu des Medias
italian: Anteprima

# #31708
source: Media List
dutch: Media lijst
french: Liste de médias
italian: Lista Media

# #31710
source: Display
dutch: Weergave
french: Afficher
italian: Visualizza

# #31711
source: Info List
dutch: Info lijst
french: Liste d'information
italian: Lista Info

# #31712
source: Image Stream
dutch: Afbeelding weergave
french: Diapositives
italian: Immagini

# #31713
source: Setup Options
dutch: Instellingen
french: Options
italian: Opzioni

# #31714
source: Wall Stream
dutch: Muur weergave
french: Mur
italian: Muraglia

# #31715
source: Panel Stream
dutch: Paneel weergave
french: Panneau
italian: Pannello

# #31717
source: Options Menu
dutch: opties menu
french: Menu Options
italian: Menu Opzioni

# #31720
source: Grid
dutch: Raster
french: Grille

# #31721
source: Episodes List
dutch: Afleveringen
french: Liste d'épisodes

# #31722
source: Plugin Stream
french: Module d'extension

# #31800
source: About Plex
dutch: Over
french: Crédits
italian: Riconoscimenti

# #31801
source: Welcome to
dutch: Welkom bij
french: Bienvenue sur
italian: Benvenuto a

# #31802
source: your media....[COLOR Highlighted]your[/COLOR] way
dutch: jouw media....[COLOR Highlighted]jouw[/COLOR] manier
french: vos médias....[COLOR Highlighted]votre[/COLOR] choix
italian: i tuoi media.... a modo [COLOR Highlighted]tuo[/COLOR]

# #31804
source: MediaStream is a new user interface for the popular multimedia XBMC. Created by the newly-formed "Team RazorFish", this new interface seeks to combine functionality with form, merging style with substance. Designed and optimized for the 'High-Def' generation, this interface seeks to bring a new experience to the already popular platform.
dutch: MediaStream is een nieuwe gebruikersinterface voor het populaire XBMC. Gemaakt door het nieuw gevormde "Team RazorFish". Deze nieuwe interface combineert gebruiksgemak met een ongekende schoonheid. Vormgegeven en geoptimaliseerd voor de 'High Def' generatie, tracht deze interface een nieuwe ervaring te brengen naar het al jaren populaire platform.
french: MediaStream est une nouvelle interface utilisateur pour le projet multimédia XBMC. Créée par l’équipe nouvellement formé "RazorFish", elle est le fruit d’une combinaison entre la fonctionnalité et la forme, la fusion du style et de la substance. Dessinée et optimisée pour la génération "haute définition", cette interface a pour but de vous apporter une nouvelle expérience sur cette plateforme déjà très populaire.
italian: MediaStream e' una nuova interfaccia per XBMC. Creata dal neonato "Team RazorFish", questa nuova interfaccia vorrebbe unire la funzionalita' e la forma, raggruppando stile e sostanza. Progettata ed ottimizzata per la generazione 'High-Def', questa interfaccia cerca di creare un'esperienza nuova ad una piattaforma gia' ben conosciuta.

# #31806
source: Please ensure that you have the very latest build of XBMC. We recommend the latest SVN build of XBMC, and would ask that you always download the full skin package.
dutch: Zorg ervoor dat je de meest recente build van XBMC hebt. Wij adviseren de laatste SVN build van XBMC, en vragen je om altijd het volledige skin-pakket te downloaden.
french: Vérifiez que vous disposez bien d'une version récente de XBMC. Nous recommandons la toute dernière version SVN de XBMC, et nous vous demandons de toujours télécharger l’archive entière du thème.
italian: Assicuratevi di avere l'ultima versione di XBMC. Ci sentiamo di raccomandare l'ultima versione SVN di XBMC, e desidereremmo che venisse sempre scaricato il pacchetto completo di skin.

# #31807
source: Skin Credits
dutch: Over Deze Skin
french: Thème réalisé par
italian: Riconoscimenti della Skin

# #31808
source: The entire project was a collaborative effort between many talented individuals. These are as follows: skunkmonkee, manturafs, justmed, timdog82001, wir3d, syphon, jmarshall, jezz_x, blittan, mikebeecham, grrowl, modplug, nuka1195 and aenima99x. Special thanks goes to emilio (a.k.a. thedeViL), without whom this project would never have happened. Of course all thanks go to you, the XBMC community... without you there would be no reason to do what we do... keep rocking guys, you're the best!!!
dutch: Het gehele project berust op een samenwerking tussen vele getalenteerde individuen. Namelijk: skunkmonkee, manturafs, justmed, timdog82001, wir3d, syphon, jmarshall, jezz_x, blittan, mikebeecham, grrowl, modplug, nuka1195 and aenima99x. Een speciaal dankwoord gaat uit naar emilio (a.k.a. thedeViL), zonder hem was dit project nooit van de grond gekomen. En natuurlijk bedanken wij jullie, de XBMC gemeenschap... zonder jullie zou er geen reden zijn geweest om dit te doen... blijf vooral doorgaan mensen, jullie zijn de beste!!!
french: Le projet entier a été une collaboration d’efforts entre plusieurs individus très talentueux. Ceux-ci sont les suivants : skunkmonkee, manturafs, justmed, timdog82001, wir3d, syphon, jmarshall, jezz_x, blittan, mikebeecham, grrowl, modplug, nuka1195 et aenima99x. Un remerciement spécial pour emilio (a.k.a. thedeViL), sans qui ce projet n’aurait jamais abouti. Bien sûr tout les remerciements vont pour vous, la communauté XBMC… sans vous il n’y aurait pas eu de raisons que l’on fasse ce que l'on a fait… Continuez d’assurer, vous êtes les meilleurs !!!
italian: Questo progetto nasce da una collaborazione tra molti individui talentosi. Questo l'elenco: skunkmonkee, manturafs, justmed, timdog82001, wir3d, syphon, jmarshall, jezz_x, blittan, mikebeecham, grrowl, modplug, nuka1195 e aenima99x. Un ringraziamento particolare per emilio (a.k.a. thedeViL), senza cui questo progetto non sarebbe mai nato. Naturalmente tutti i ringraziamenti vanno a voi, la comunita' di XBMC... senza di voi tutto questo non avrebbe ragione di essere... Continuate cosi', siete i migliori!!!

# #31809
source: Special Thanks: entire XBMC team, supporters at the xbmc and xbox-scene forums
dutch: Met Speciale Dank Aan: gehele XBMC team, supporters op de XBMC en Xbox-Scene forums
french: Remerciements Particuliers : Toute l'équipe XBMC, et les supporters des forums xbmc et xbox-scene
italian: Un ringraziamento speciale a tutto il team di XBMC, e a chi lo sostiene sul forum di XBMC e su xbox-scene

# #31810
source: Click "OK" to continue and begin using our skin
dutch: Klik "OK" om door te gaan en gebruik te gaan maken van onze skin
french: Cliquez sur "OK" pour continuer et commencer à utiliser notre thème.
italian: Clicca "OK" per continuare e cominciare ad usare la nostra skin

# #31811
source: Note: This is the only time you will see this message once you hit "OK"
dutch: Opmerking: Dit bericht zal niet meer verschijnen, nadat je op "OK" hebt gedrukt
french: Note : Vous ne verrez plus ce message les prochaines fois, après avoir cliqué sur "OK"
italian: Nota: Una volta premuto 'OK' qesto messaggio non apparira' piu'

# #31851
source: [COLOR=orange]Plex[/COLOR] bridges the gap between your Mac and your home theater, doing so with a visually appealing user interface that provides instant access to your media. [COLOR=orange]Plex[/COLOR] can play a wide range of video, audio and photo formats as well as online streaming audio and video. The real power of [COLOR=orange]Plex[/COLOR] is found in its library features: Organize your media into versatile libraries, automatically retrieve metadata from the Internet and display your library using one of the visually stunning skins.
dutch: [COLOR=orange]Plex[/COLOR] overbrugt de kloof tussen je Mac en je home theater door gebruik te maken van een visueel aantrekkelijke gebruikers interface die direct toegang geeft tot uw media. [COLOR=orange]Plex[/COLOR] kan een breed scala aan video-, audio-en fotoformaten afspelen alsmede online streaming van audio en video. De echte kracht van [COLOR=orange]Plex[/COLOR] is te vinden in de bibliotheek functies: Organiseer uw media in veelzijdige bibliotheken, automatisch ophalen van metadata van het internet en het weergeven van uw bibliotheek met behulp van een van de visueel verbluffende themas.
french: Plex comble le fossé entre votre Mac et votre home cinéma, au travers d'une interface visuellement attirante fournissant un accès instantané à vos médias. Plex peut afficher une large gamme de formats vidéos, audio et d'images ainsi que du streaming online audio et vidéo. La puissance réelle de Plex réside dans ses fonctions de librairie: organisez vos médias en diverses librairies, récupérez automatiquement les méta-données depuis Internet et affichez votre librairie depuis l'une des étonnantes skins.
