Repository: xbmc/xbmc
Catalog: addons/weather.wunderground/resources/language/Amharic/strings.po
Languages: am

# #32101
source: Location setup
am: አካባቢ ማሰናጃ

# #32102
source: Advanced options
am: የረቀቁ ምርጫዎች

# #32111
source: Location 1
am: አካባቢ 1

# #32112
source: Location 2
am: አካባቢ 2

# #32113
source: Location 3
am: አካባቢ 3

# #32114
source: Location 1 display name
am: አካባቢ 1 ስም ማሳያ

# #32115
source: Location 2 display name
am: አካባቢ 2 ስም ማሳያ

# #32116
source: Location 3 display name
am: አካባቢ 3 ስም ማሳያ

# #32117
source: Location 1 id
am: አካባቢ 1 መለያ

# #32118
source: Location 2 id
am: አካባቢ 2 መለያ

# #32119
source: Location 3 id
am: አካባቢ 3 መለያ

# #32120
source: Enable logging
am: መግቢያ ማስቻያ

# #32121
source: Weekend
am: የሳምንቱ መጨረሻ

# #32122
source: Saturday/Sunday
am: ቅዳሜ/እሑድ

# #32123
source: Friday/Saturday
am: አርብ/ቅዳሜ

# #32124
source: Thursday/Friday
am: ሐሙስ/አርብ

# #32125
source: Map zoom level
am: የካርታ ማሳያ መጠን

# #32126
source: Animated map
am: ተንቀሳቃሽ ካርታ

# #32127
source: Location 4
am: አካባቢ 4

# #32128
source: Location 5
am: አካባቢ 5

# #32129
source: Location 4 display name
am: አካባቢ 4 ስም ማሳያ

# #32130
source: Location 5 display name
am: አካባቢ 5 ስም ማሳያ

# #32131
source: Location 4 id
am: አካባቢ 4 መለያ

# #32132
source: Location 5 id
am: አካባቢ 5 መለያ

# #32501
source: New Moon
am: አዲስ ጨረቃ

# #32502
source: Waxing Crescent
am: እየጨመረ የሚሄድ ከ ግማሽ በታች

# #32503
source: First Quarter
am: የመጀመሪያው ሩብ

# #32504
source: Waxing Gibbous
am: እየጨመረ የሚሄድ ከ ግማሽ በላይ

# #32505
source: Full Moon
am: ሙሉ ጨረቃ

# #32506
source: Waning Gibbous
am: እየቀነሰ የሚሄድ ከ ግማሽ በላይ በላይ

# #32507
source: Last Quarter
am: የመጨረሻው ሩብ

# #32508
source: Waning Crescent
am: እየቀነሰ የሚሄድ ከ ግማሽ በታች

# #32510
source: Warning
am: ማስጠንቀቂያ

# #32511
source: Watch
am: ይጠንቀቁ

# #32512
source: Advisory
am: ይመከራሉ

# #32513
source: Statement
am: ባጠቃላይ

# #32515
source: Forecast
am: ደመናማ
