Repository: xbmc/xbmc
Catalog: addons/weather.wunderground/resources/language/Hungarian/strings.po
Languages: hu

# #32101
source: Location setup
hu: Hely beállítása

# #32102
source: Advanced options
hu: Haladó beállítások

# #32111
source: Location 1
hu: Hely 1

# #32112
source: Location 2
hu: Hely 2

# #32113
source: Location 3
hu: Hely 3

# #32114
source: Location 1 display name
hu: Hely 1 megjelenítési neve

# #32115
source: Location 2 display name
hu: Hely 2 megjelenítési neve

# #32116
source: Location 3 display name
hu: Hely 3 megjelenítési neve

# #32117
source: Location 1 id
hu: Hely 1 azonosító

# #32118
source: Location 2 id
hu: Hely 2 azonosító

# #32119
source: Location 3 id
hu: Hely 3 azonosító

# #32120
source: Enable logging
hu: Naplózás engedélyezése

# #32121
source: Weekend
hu: Hétvége

# #32122
source: Saturday/Sunday
hu: Szombat/Vasárnap

# #32123
source: Friday/Saturday
hu: Péntek/Szombat

# #32124
source: Thursday/Friday
hu: Csütörtök/Péntek

# #32125
source: Map zoom level
hu: Térkép nagyítási erősség

# #32126
source: Animated map
hu: Mozgó térkép

# #32501
source: New Moon
hu: Újhold

# #32502
source: Waxing Crescent
hu: Növőhold újhold után

# #32503
source: First Quarter
hu: Első holdnegyed

# #32504
source: Waxing Gibbous
hu: Növőhold telihold előtt

# #32505
source: Full Moon
hu: Telihold

# #32506
source: Waning Gibbous
hu: Fogyóhold telihold után

# #32507
source: Last Quarter
hu: Utolsó holdnegyed

# #32508
source: Waning Crescent
hu: Fogyóhold újhold előtt

# #32510
source: Warning
hu: Figyelmeztetés

# #32511
source: Watch
hu: Megfigyelés

# #32512
source: Advisory
hu: Ajánlás

# #32513
source: Statement
hu: Nyílatkozat

# #32514
source: Outlook
hu: Összefoglaló

# #32515
source: Forecast
hu: Időjárás

# #32516
source: Synopsis
hu: Összegzés
