Repository: xbmc/xbmc
Catalog: addons/weather.wunderground/resources/language/Romanian/strings.po
Languages: ro

# #32101
source: Location setup
ro: Configurare locaţie

# #32102
source: Advanced options
ro: Opţiuni avansate

# #32111
source: Location 1
ro: Locaţie 1

# #32112
source: Location 2
ro: Locaţie 2

# #32113
source: Location 3
ro: Locaţie 3

# #32114
source: Location 1 display name
ro: Nume pentru locaţia 1

# #32115
source: Location 2 display name
ro: Nume pentru locaţia 2

# #32116
source: Location 3 display name
ro: Nume pentru locaţia 3

# #32117
source: Location 1 id
ro: ID locaţie 1

# #32118
source: Location 2 id
ro: ID locaţie 2

# #32119
source: Location 3 id
ro: ID locaţie 3

# #32120
source: Enable logging
ro: Activează jurnal

# #32121
source: Weekend
ro: Sfârșit de săptămână

# #32122
source: Saturday/Sunday
ro: Sâmbătă/Duminică

# #32123
source: Friday/Saturday
ro: Vineri/Sâmbătă

# #32124
source: Thursday/Friday
ro: Joi/Vineri

# #32125
source: Map zoom level
ro: Nivel apropiere hartă

# #32126
source: Animated map
ro: Hartă animată

# #32501
source: New Moon
ro: Lună nouă

# #32503
source: First Quarter
ro: Primul pătrar

# #32505
source: Full Moon
ro: Lună plină

# #32507
source: Last Quarter
ro: Ultimul pătrar

# #32510
source: Warning
ro: Avertizare

# #32511
source: Watch
ro: Urmăreşte

# #32512
source: Advisory
ro: Buletin informativ

# #32513
source: Statement
ro: Declaraţie

# #32514
source: Outlook
ro: Perspectivă

# #32515
source: Forecast
ro: Previziune

# #32516
source: Synopsis
ro: Sinopsis
