Repository: xbmc/xbmc
Catalog: lib/win32/libiconv/po/*.po
Languages: pl

source: Usage: iconv [-c] [-s] [-f fromcode] [-t tocode] [file ...]
pl: Sk³adnia: iconv [-c] [-s] [f z_kodu] [-t do_kodu] [plik ...]

source: or: iconv -l
pl: lub: iconv -l

source: Try `%s --help' for more information.
pl: `%s --help' poka¿e wiêcej informacji.

source: Usage: %s [OPTION...] [-f ENCODING] [-t ENCODING] [INPUTFILE...]
pl: Sk³adnia: %s [OPCJA...] [-f KODOWANIE] [-t KODOWANIE] [PLIK_WEJ...]

source: or: %s -l
pl: lub: %s -l

source: Converts text from one encoding to another encoding.
pl: Konwersja tekstu z jednego kodowania do innego.

source: Options controlling the input and output format:
pl: Opcje steruj±ce formatem wej¶cia i wyj¶cia:

source: -f ENCODING, --from-code=ENCODING the encoding of the input
pl: -f KODOWANIE, --from-code=KODOWANIE kodowanie wej¶cia

source: -t ENCODING, --to-code=ENCODING the encoding of the output
pl: -t KODOWANIE, --to-code=KODOWANIE kodowanie wyj¶cia

source: Options controlling conversion problems:
pl: Opcje steruj±ce zagadnieniami konwersji:

source: -c discard unconvertible characters
pl: -c pominiêcie niekonwertowalnych znaków

source: --unicode-subst=FORMATSTRING substitution for unconvertible Unicode characters
pl: --unicode-subst=£AÑCUCH_FORMATUJ¡CY zamiennik dla niekonwertowalnych znaków Unicode

source: --byte-subst=FORMATSTRING substitution for unconvertible bytes
pl: --byte-subst=£AÑCUCH_FORMATUJ¡CY zamiennik dla niekonwertowalnych bajtów

source: --widechar-subst=FORMATSTRING substitution for unconvertible wide characters
pl: --widechar-subst=£AÑCUCH_FORMATUJ¡CY zamiennik dla niekonwertowalnych znaków szerokich

source: Options controlling error output:
pl: Opcje steruj±ce wyj¶ciem b³êdów:

source: -s, --silent suppress error messages about conversion problems
pl: -s, --silent pominiêcie komunikatów b³êdów dotycz±cych konwersji

source: Informative output:
pl: Wyj¶cie informacyjne:

source: -l, --list list the supported encodings
pl: -l, --list wypisanie obs³ugiwanych kodowañ

source: --help display this help and exit
pl: --help wy¶wietlenie tego opisu i zakoñczenie

source: --version output version information and exit
pl: --version wy¶wietlenie informacji o wersji i zakoñczenie

source: Report bugs to <bug-gnu-libiconv@gnu.org>.
pl: B³êdy proszê zg³aszaæ na adres <bug-gnu-libiconv@gnu.org>.

source: Written by %s.
pl: Napisane przez %s.

source: %s argument: A format directive with a variable width is not allowed here.
pl: Argument %s: dyrektywa formatuj±ca o zmiennej szeroko¶ci nie jest tutaj dozwolona.

source: %s argument: A format directive with a variable precision is not allowed here.
pl: Argument %s: dyrektywa formatuj±ca o zmiennej precyzji nie jest tutaj dozwolona.

source: %s argument: A format directive with a size is not allowed here.
pl: Argument %s: dyrektywa formatuj±ca z rozmiarem nie jest tutaj dozwolona.

source: %s argument: The string ends in the middle of a directive.
pl: Argument %s: ³añcuch koñczy siê w ¶rodku dyrektywy.

source: %s argument: The character '%c' is not a valid conversion specifier.
pl: Argument %s: znak '%c' nie jest poprawnym okre¶leniem konwersji.

source: %s argument: The character that terminates the format directive is not a valid conversion specifier.
pl: Argument %s: znak koñcz±cy dyrektywê formatuj±c± nie jest poprawnym okre¶leniem konwersji.

source: %s argument: The format string consumes more than one argument: %u argument.
pl: Argument %s: ³añcuch formatuj±cy pobiera wiêcej ni¿ jeden argument: %u argument.

source: cannot convert byte substitution to Unicode: %s
pl: nie mo¿na przekonwertowaæ zamiennika bajtu na Unicode: %s

source: cannot convert unicode substitution to target encoding: %s
pl: nie mo¿na przekonwertowaæ zamiennika unicode na kodowanie docelowe: %s

source: cannot convert byte substitution to wide string: %s
pl: nie mo¿na przekonwertowaæ zamiennika bajtu na ³añcuch szeroki: %s

source: cannot convert widechar substitution to target encoding: %s
pl: nie mo¿na przekonwertowaæ zamiennika znaku szerokiego na kodowanie docelowe: %s

source: cannot convert byte substitution to target encoding: %s
pl: nie mo¿na przekonwertowaæ zamiennika bajtu na kodowanie docelowe: %s

source: %s:%u:%u: cannot convert
pl: %s:%u:%u: nie mo¿na skonwertowaæ

source: %s:%u:%u: incomplete character or shift sequence
pl: %s:%u:%u niedokoñczony znak lub sekwencja shift

source: %s: I/O error
pl: %s: b³±d wej./wyj.

source: conversion from %s unsupported
pl: konwersja z kodu %s jest nieobs³ugiwana

source: conversion to %s unsupported
pl: konwersja do kodu %s jest nieobs³ugiwana

source: conversion from %s to %s unsupported
pl: konwersja z kodu %s do kodu %s jest nieobs³ugiwana

source: try '%s -l' to get the list of supported encodings
pl: '%s -l' poda listê obs³ugiwanych kodowañ

source: I/O error
pl: b³±d wej./wyj.
