Repository: xbmc/xbmc
Catalog: language/Macedonian/strings.po
Languages: mk

# #16314
source: Inverse Telecine
mk: Обратен Telecine

# #16316
source: Auto
mk: Автоматски

# #16317
source: Temporal (Half)
mk: Временски (половично)

# #16318
source: Temporal/Spatial (Half)
mk: Временски/просторни (половично)

# #17500
source: Display sleep timeout
mk: Време по кое екранот ќе премине во состојба на спиење

# #17998
source: %i hours
mk: %i часови

# #17999
source: %i days
mk: %i денови

# #19000
source: Switch to channel
mk: Префрли на канал

# #19007
source: Device status
mk: Статус на уредот

# #19008
source: Signal quality
mk: Квалитет на сигналот

# #19014
source: Fixed
mk: Фиксирано

# #19015
source: Encryption
mk: Енкрипција

# #19017
source: Recordings
mk: Снимки

# #19019
source: Channels
mk: Канали

# #19020
source: TV
mk: ТВ

# #19021
source: Radio
mk: Радио

# #19022
source: Hidden
mk: Скриен

# #19023
source: TV channels
mk: ТВ канали

# #19024
source: Radio channels
mk: Радио канали

# #19025
source: Upcoming recordings
mk: Следни снимања

# #19026
source: Add timer...
mk: Додади тајмер...

# #19027
source: No search results
mk: Нема резултати од пребарувањето

# #19029
source: Channel
mk: Канал

# #19030
source: Now
mk: Сега

# #19031
source: Next
mk: Следно

# #19032
source: Timeline
mk: Бременска линија

# #19033
source: Information
mk: Информација

# #19037
source: Show signal quality
mk: Прикажи квалитет на сигнал

# #19040
source: Timer
mk: Тајмер

# #19043
source: Recording
mk: Снимање

# #19046
source: New channel
mk: Нов канал

# #19048
source: Group management
mk: Управување со групи

# #19049
source: Show channel
mk: Покажи канал

# #19050
source: Show visible channels
mk: Прикажи видливи канали

# #19051
source: Show hidden channels
mk: Прикажи сокриени канали

# #19052
source: Move channel to:
mk: Премести канал во:

# #19054
source: Hide channel
mk: Сокриј канал

# #19055
source: No information available
mk: Нема достапни информации

# #19056
source: New timer
mk: Нов тајмер

# #19059
source: Stop recording
mk: Запри снимање

# #19061
source: Add timer
mk: Додади часовник

# #19062
source: Sort by: Channel
mk: Подреди по: Канал

# #19063
source: Go to begin
mk: Иди на почеток

# #19064
source: Go to end
mk: Иди на крај

# #19069
source: EPG
mk: ТВ-Водич

# #19074
source: Active:
mk: Активен:

# #19075
source: Name:
mk: Име:

# #19076
source: Folder:
mk: Папка:

# #19077
source: Radio:
mk: Радио:

# #19078
source: Channel:
mk: Канал:

# #19079
source: Day:
mk: Ден:

# #19080
source: Begin:
mk: Започни:

# #19081
source: End:
mk: Крај:

# #19082
source: Priority:
mk: Приоритет:

# #19084
source: First day:
mk: Прв ден:

# #19086
source: Mo-__-__-__-__-__-__
mk: По-__-__-__-__-__-__

# #19087
source: __-Tu-__-__-__-__-__
mk: __-Вт-__-__-__-__-__

# #19088
source: __-__-We-__-__-__-__
mk: __-__-Ср-__-__-__-__

# #19089
source: __-__-__-Th-__-__-__
mk: __-__-__-Че-__-__-__

# #19090
source: __-__-__-__-Fr-__-__
mk: __-__-__-__-Пе-__-__

# #19091
source: __-__-__-__-__-Sa-__
mk: __-__-__-__-__-Са-__

# #19092
source: __-__-__-__-__-__-Su
mk: __-__-__-__-__-__-Не

# #19093
source: Mo-Tu-We-Th-Fr-__-__
mk: По-Вт-Ср-Че-Пе-__-__

# #19094
source: Mo-Tu-We-Th-Fr-Sa-__
mk: По-Вт-Ср-Че-Пе-Са-__

# #19095
source: Mo-Tu-We-Th-Fr-Sa-Su
mk: По-Вт-Ср-Че-Пе-Са-Не

# #19096
source: __-__-__-__-__-Sa-Su
mk: __-__-__-__-__-Са-Не

# #19098
source: Warning
mk: Предупредување

# #19107
source: at
mk: на

# #19114
source: Version
mk: Верзија

# #19115
source: Address
mk: Адреса

# #19116
source: Disksize
mk: Големина на диск

# #19117
source: Search for channels
mk: Барај канали

# #19121
source: Avoid repeats
mk: Избегни повторувања

# #19126
source: Start time
mk: Време за почеток

# #19127
source: End time
mk: Време на крај

# #19128
source: Start date
mk: Почетен датум

# #19129
source: End date
mk: Краен датум

# #19141
source: Group
mk: Група

# #19143
source: Group management
mk: Управување со групи

# #19146
source: Groups
mk: Групи

# #19148
source: Channel
mk: Канал

# #19149
source: Mo
mk: По

# #19150
source: Tu
mk: Вт

# #19151
source: We
mk: Ср

# #19152
source: Th
mk: Че

# #19153
source: Fr
mk: Пе

# #19154
source: Sa
mk: Са

# #19155
source: Su
mk: Не

# #19156
source: from
mk: од

# #19159
source: from
mk: од

# #19160
source: to
mk: до

# #19163
source: Recordings
mk: Снимки

# #19177
source: Playback
mk: Репродукција

# #19180
source: TV
mk: ТВ

# #19181
source: Menu/OSD
mk: Мени / ОСД

# #19182
source: Days to display in the EPG
mk: Колку денови да се прикажат во ТВ-Водичот

# #19183
source: Radio
mk: Радио

# #19185
source: Reset the PVR database
mk: Бришење на сите снимања во ПВР базата

# #19186
source: All data in the PVR database is being erased
mk: Се бришат сите податоци од ПВР базата

# #19187
source: Reset the EPG database
mk: Ресетирање на ТВ-Водичот

# #19188
source: EPG is being reset
mk: ТВ-Водичот се ресетира

# #19189
source: Continue last channel on startup
mk: Продолжи со последниот канал при стартување

# #19190
source: Background
mk: Позадина

# #19191
source: PVR service
mk: ПВР сервис

# #19192
source: None of the connected PVR backends supports scanning for channels.
mk: Ниту еден од поврзаните ПВР уреди не поддржува скенирање на канали.

# #19193
source: The channel scan cannot be started. Check the log for details.
mk: Не може да се скенираат каналите. Погледнете во лот-от за детали.

# #19194
source: Continue?
mk: Продолжи?

# #19195
source: Client actions
mk: Акции на клиентот

# #19196
source: PVR client specific actions
mk: Акции специфични за ПВР клиентот

# #19197
source: Recording started on: %s
mk: Снимањето започна во: %s

# #19198
source: Recording finished on: %s
mk: Снимањето заврши во: %s

# #19199
source: Channel manager
mk: Управување со канали

# #19200
source: EPG source:
mk: Земи ТВ-Водич од:

# #19201
source: Channel name:
mk: Име на каналот:

# #19202
source: Channel icon:
mk: Икона на каналот:

# #19203
source: Edit channel
mk: Променување на каналот

# #19204
source: New channel
mk: Нов канал

# #19205
source: Group management
mk: Управување со групи

# #19206
source: Activate EPG:
mk: Активирај го ТВ-Водичот

# #19207
source: Group:
mk: Група:

# #19208
source: Enter the name of the new channel
mk: Внесете име за новиот канал

# #19210
source: Client
mk: Клиент

# #19211
source: Delete channel
mk: Избриши го каналот

# #19212
source: This list contains changes
mk: Во оваа листа има промени

# #19213
source: Select backend
mk: Одберете backend

# #19214
source: Enter a valid URL for the new channel
mk: Внесете валидна URL адреса за новиот канал

# #19215
source: The PVR backend does not support timers.
mk: ПВР уредот не поддржува тајмери.

# #19216
source: All radio channels
mk: Сите радио канали

# #19217
source: All TV channels
mk: Сите ТВ канали

# #19218
source: Visible
mk: Видливо

# #19219
source: Ungrouped channels
mk: Негрупирани канали

# #19220
source: Channels in
mk: Канали во

# #19222
source: EPG
mk: ТВ-Водич

# #19224
source: Recording aborted
mk: снимањето е откажано

# #19225
source: Recording scheduled
mk: снимањето е закажано

# #19226
source: Recording started
mk: снимањето започна

# #19227
source: Recording completed
mk: снимањето заврши

# #19228
source: Recording deleted
mk: снимката е избришана

# #19229
source: Close channel OSD after switching channels
mk: Сокриј ја информацијата за канали после промена на канал

# #19231
source: Always use the channel order from the backend(s)
mk: Секогаш користи го редоследот на канали од изворот(ите)

# #19232
source: Clear search results
mk: Испразни ја листата со резултати

# #19233
source: Display a notification on timer updates
mk: Прикажи информација за промена на тајмери

# #19235
source: PVR manager is starting up
mk: Се стартува управувачот со ПВР

# #19236
source: Loading channels from clients
mk: Се вчитуваат каналите од клиентите

# #19237
source: Loading timers from clients
mk: Се вчитуваат тајмерите од клиентите

# #19238
source: Loading recordings from clients
mk: Се вчитуваат снимањата од клиентите

# #19239
source: Starting background threads
mk: Се стартуваат позадинските процеси

# #19241
source: The PVR manager has been enabled without any
mk: Управувачот со ПВР беше активиран, но нема дефинирано

# #19243
source: in order to use the PVR functionality.
mk: за да се користат ПВР функциите.

# #19244
source: Backend idle time
mk: Време на мирување на Backend

# #19245
source: Set wakeup command (cmd [timestamp])
mk: Постави ја командата за мирување (cmd [timestamp])

# #19246
source: Wakeup before recording
mk: Будење пред снимање

# #19247
source: Daily wakeup
mk: Будење дневно

# #19248
source: Daily wakeup time (HH:MM:SS)
mk: Дневно будење (HH:MM:SS)

# #19249
source: Filter channels
mk: Филтрирање на каналите

# #19250
source: Loading EPG from database
mk: Вчитување EPG од базата

# #19251
source: Update EPG information
mk: Надополнување на EPG информацијата

# #19252
source: Schedule EPG update for this channel?
mk: Распоред на EPG надополнувања за овој канал?

# #19253
source: EPG update scheduled for channel
mk: EPG надополнување закажано за овој канал

# #19254
source: EPG update failed for channel
mk: EPG Надополнувањето за овој канал е неуспешно

# #19255
source: Start recording
mk: Почни со снимање

# #19256
source: Stop recording
mk: Запри снимање

# #19257
source: Lock channel
mk: Заклучи го каналот

# #19258
source: Unlock channel
mk: Отклучи го каналот

# #19259
source: Parental control
mk: Родителска контрола

# #19260
source: Unlock duration
mk: Отклучи го времетраењето

# #19261
source: Change PIN
mk: Смени PIN

# #19262
source: Parental control. Enter PIN:
mk: Родителска контрола. Внеси PIN:

# #19263
source: Locked channel. Enter PIN:
mk: Заклучен канал. Внеси PIN:

# #19264
source: Incorrect PIN
mk: Некоректен PIN

# #19265
source: The entered PIN number was incorrect.
mk: Внесениот PIN не е точен.

# #19266
source: Parental locked
mk: Родителски заклучен

# #19267
source: Parental locked:
mk: Родителски заклучен:

# #19268
source: Do not show 'no information available' labels
mk: Не прикажувај знак за „нема информација“

# #19269
source: Do not show 'connection lost' warnings
mk: Не прикажувај опомена „Врската е прекината“

# #19272
source: You need a tuner, backend software, and an
mk: Потребен ти е тјунер, backend софтвер и

# #19274
source: Please visit xbmc.org/pvr to learn more.
mk: Погледни на xbmc.org/pvr за да научиш повеќе.

# #19275
source: Conflict warning
mk: Предупредување за конфликт

# #19276
source: Conflict error
mk: Грешка поради конфликт

# #19277
source: Recording conflict
mk: Конфликт при снимање

# #19278
source: Recording error
mk: Грешка при снимање

# #19281
source: Confirm channel switches by pressing OK
mk: Потврди замена на каналот со притискање ОК

# #19499
source: Other/Unknown
mk: Друго / Непознато

# #19500
source: Movie/Drama
mk: Филм/Драма

# #19501
source: Detective/Thriller
mk: Детектив/Трилер

# #19502
source: Adventure/Western/War
mk: Авантура/Вестерн/Војна

# #19503
source: Science Fiction/Fantasy/Horror
mk: Научна Фантастика/Фантазија/Хорор

# #19504
source: Comedy
mk: Комедија

# #19506
source: Romance
mk: Романса

# #19508
source: Adult Movie/Drama
mk: Филм за возрасни/Драма

# #19635
source: Languages
mk: Избор на јазици

# #19647
source: Motoring
mk: Автоматски

# #19649
source: Cooking
mk: Готвење

# #19677
source: Detective/Thriller
mk: Детектив/Трилер

# #19678
source: Adventure/Western/War
mk: Авантура/Вестерн/Војна

# #19679
source: Science Fiction/Fantasy/Horror
mk: Научна Фантастика/Фантазија/Хорор

# #19680
source: Comedy
mk: Комедија

# #19682
source: Romance
mk: Романса

# #20000
source: Saved music folder
mk: Папка со сочувана музика

# #20001
source: Use external DVD player
mk: Користи надворешен DVD уред за реп.

# #20002
source: External DVD player
mk: Надворешен DVD уред за реп.

# #20003
source: Trainers folder
mk: Папка на модификатор на игри

# #20004
source: Screenshot folder
mk: Папка со слики на екран

# #20006
source: Playlists folder
mk: Папка со списоци за реп.

# #20007
source: Recordings
mk: Снимки

# #20008
source: Screenshots
mk: Слики на екранот

# #20009
source: Use Kodi
mk: Користи Kodi

# #20011
source: Music playlists
mk: Списоции за репрод. на музика

# #20012
source: Video playlists
mk: Списоци за репрод. на филмови

# #20013
source: Do you wish to launch the game?
mk: Сакате ли да покренете игра?

# #20014
source: Sort by: Playlist
mk: Сложи по: Спис. за реп.

# #20015
source: Remote thumb
mk: Одалечена сликичка

# #20016
source: Current thumb
mk: Сегашна сликичка

# #20017
source: Local thumb
mk: Локална сликичка

# #20018
source: No thumb
mk: Нема сликичка

# #20019
source: Choose thumbnail
mk: Избери сликичка

# #20023
source: Conflict
mk: Неусогласеност

# #20024
source: Scan new
mk: Пребарување нови

# #20025
source: Scan all
mk: Пребарување на сите

# #20026
source: Region
mk: Регион

# #20037
source: Summary
mk: Краток преглед

# #20038
source: Lock music window
mk: Заклучај го прозорот со музика

# #20039
source: Lock videos window
mk: Заклучај го прозорот со филмови

# #20040
source: Lock pictures window
mk: Заклучај го прозорот со слики

# #20041
source: Lock programs & scripts windows
mk: Заклучај го прозорот со програми и скрипти

# #20042
source: Lock file manager
mk: Заклучај го управувачот со датотеки

# #20043
source: Lock settings
mk: Заклучај ги поставките

# #20044
source: Start fresh
mk: Нов почеток

# #20045
source: Enter master mode
mk: Влези во главен режим

# #20046
source: Leave master mode
mk: Напушти го главниот режим

# #20047
source: Create profile '%s'?
mk: Креирај профил '%s'?

# #20048
source: Start with fresh settings
mk: Стартувај со нови поставки

# #20049
source: Best available
mk: Најдобро можно

# #20050
source: Auto-switch between 16x9 and 4x3
mk: Автоматско префрлување помеѓу 16x9 и 4x3

# #20051
source: Treat stacked files as single file
mk: Сметај ги компромираните датотеки како една

# #20052
source: Caution
mk: Внимание

# #20053
source: Left master mode
mk: Напуштен главниот режим

# #20054
source: Entered master mode
mk: Пристапено на главниот режим

# #20055
source: Allmusic.com thumb
mk: Омот со Allmusic.com

# #20057
source: Remove thumbnail
mk: Отстрани сликичка

# #20058
source: Add profile...
mk: Додади профил...

# #20059
source: Query info for all albums
mk: Барај податоци за сите албуми

# #20060
source: Media info
mk: Податоци за медиум

# #20061
source: Separate
mk: Одвоено

# #20062
source: Shares with default
mk: Подразбирачко делење

# #20063
source: Shares with default (read only)
mk: Подразбирачко делење (само читање)

# #20064
source: Copy default
mk: Подразбирачко копирање

# #20065
source: Profile picture
mk: Слика на профил

# #20066
source: Lock preferences
mk: Заклучи поставки

# #20067
source: Edit profile
mk: Уреди го профилот

# #20068
source: Profile lock
mk: Заклучи го профилот

# #20069
source: Could not create folder
mk: Нее можно да се направи папка

# #20070
source: Profile directory
mk: Папка на профил

# #20071
source: Start with fresh media sources
mk: Покрени со нов извор на медиум

# #20072
source: Make sure the selected folder is writable
mk: Уверете се дека во одбраната папка можете

# #20073
source: and that the new folder name is valid
mk: упишувате и дека новото име на папка е исправно

# #20074
source: MPAA rating
mk: MPAA оцена

# #20075
source: Enter master lock code
mk: Внесете главен кôд за отклучување

# #20076
source: Ask for master lock code on startup
mk: Прашај за главен кôд за време на покрен. на апл.

# #20077
source: Skin settings
mk: Поставки за маска

# #20078
source: - no link set -
mk: - врска не е поставена -

# #20079
source: Enable animations
mk: Овозможи анимации

# #20080
source: Disable RSS during music
mk: Оневозможи RSS новости за време на музика

# #20081
source: Enable shortcut buttons
mk: Овозможи кратенки

# #20082
source: Show programs in main menu
mk: Прикажи ги програмите во главното мени

# #20083
source: Show music info
mk: Прикажи податоци за музика

# #20084
source: Show weather info
mk: Прикажи податоци за време

# #20085
source: Show system info
mk: Прикажи податоци за системот

# #20088
source: Weather info
mk: Податоци за време

# #20089
source: Drive space free
mk: Слободен простор на диск

# #20090
source: Enter the name of an existing share
mk: Внесете име на постоен споделен ресурс

# #20091
source: Lock code
mk: Кôд за заклучување

# #20092
source: Load profile
mk: Вчитај профил

# #20093
source: Profile name
mk: Име на профил

# #20094
source: Media sources
mk: Медија извори

# #20095
source: Enter profile lock code
mk: Внесете кôд за отклучување на профил

# #20096
source: Login screen
mk: Екран за најава

# #20097
source: Fetching album info
mk: Превземање податоци за албум

# #20098
source: Fetching info for album
mk: Превземање податоци за албум

# #20099
source: Can't rip CD or track while playing from CD
mk: Не е можно рипување музички CD-а за време на репродукција од CD-а

# #20100
source: Master lock code and settings
mk: Главен кôд за заклучување и поставки

# #20101
source: Entering master lock code always enables master mode
mk: Со Внесување на главен кôд секогаш овозможувате главен режим на работа

# #20102
source: or copy from default?
mk: или копирање од подразбирачкиот?

# #20103
source: Save changes to profile?
mk: Сочувај промени во профил?

# #20104
source: Old settings found.
mk: Пронајдени се стари поставки

# #20105
source: Do you want to use them?
mk: Сакате ли да ги користите?

# #20106
source: Old media sources found.
mk: Пронајдени стари извори на медиуми

# #20107
source: Separate (locked)
mk: Раздвојување (заклучено)

# #20108
source: Root
mk: Корен на папки

# #20109
source: Zoom
mk: Зголемен

# #20110
source: UPnP settings
mk: UPnP поставки

# #20111
source: Autostart UPnP client
mk: Автом. покренување на UPnP клиент

# #20112
source: Last login: %s
mk: Последна пријава: %s

# #20113
source: Never logged on
mk: Немало логување досега

# #20114
source: Profile %i / %i
mk: Профил %i / %i

# #20115
source: User login / Select a profile
mk: Пријава на корисник / Изаберете профил

# #20116
source: Use lock on login screen
mk: Користи заклучување на екран за најава

# #20117
source: Invalid lock code.
mk: Кôд не е исправен.

# #20118
source: This requires the master lock to be set.
mk: Ова бара внес на главен кôд.

# #20119
source: Would you like to set it now?
mk: Сакате веднаш да поставите?

# #20120
source: Loading program information
mk: Вчитување податоци за програмот

# #20121
source: Party on!
mk: Журка!

# #20122
source: True
mk: Вистина

# #20123
source: Mixing drinks
mk: Мешање пијалоци

# #20124
source: Filling glasses
mk: Полонење чаша

# #20125
source: Logged on as
mk: Пријавен како

# #20126
source: Log off
mk: Одјави се

# #20128
source: Go to root
mk: Оди на почеток

# #20129
source: Weave
mk: Бранови

# #20130
source: Weave (inverted)
mk: Бранови (обратни)

# #20131
source: Blend
mk: Мешано

# #20132
source: Restart video
mk: Одново стартувај филмот

# #20133
source: Edit network location
mk: Уреди мрежна локација

# #20134
source: Remove network location
mk: Отстрани мрежна локација

# #20135
source: Do you want to scan the folder?
mk: Сакате ли да ја анализирате папката?

# #20136
source: Memory unit
mk: единица на меморија

# #20137
source: Memory unit mounted
mk: поставена единица на меморија

# #20138
source: Unable to mount memory unit
mk: Не е можно да се постави единица на меморија

# #20139
source: In port %i, slot %i
mk: Во приклучок %i, конектор %i

# #20140
source: Lock screensaver
mk: Заклучи чувар на екран

# #20141
source: Set
mk: Постави

# #20142
source: Username
mk: Корисничко име

# #20143
source: Enter password for
mk: Внесете лозинка за

# #20144
source: Shutdown timer
mk: Одбројување до искључување

# #20145
source: Shutdown interval (in minutes)
mk: Интервал на исклучување (во минути)

# #20146
source: Started, shutdown in %im
mk: Покренато, исклучување за %i мин.

# #20147
source: Shutdown in 30 minutes
mk: Исклучи за 30 минути

# #20148
source: Shutdown in 60 minutes
mk: Исклучи за 60 минути

# #20149
source: Shutdown in 120 minutes
mk: Исклучи за 120 минути

# #20150
source: Custom shutdown timer
mk: Прилагодено одбројување до исклучување

# #20151
source: Cancel shutdown timer
mk: Откажи одбројување

# #20152
source: Lock preferences for %s
mk: Заклучи подесувања за %s

# #20153
source: Browse...
mk: Пребарај...

# #20154
source: Summary information
mk: Краток преглед на информации

# #20155
source: Storage information
mk: Податоци за склад

# #20156
source: Hard disk information
mk: Податoци за хард диск

# #20157
source: DVD-ROM information
mk: Податоци за DVD-ROM уред

# #20158
source: Network information
mk: Податоци за мрежа

# #20159
source: Video information
mk: Податоци за видеото

# #20160
source: Hardware information
mk: Податоци за хардверот

# #20161
source: Total
mk: Вкупно

# #20162
source: Used
mk: Искористено

# #20163
source: of
mk: од

# #20164
source: Locking not supported
mk: Заклучување не е подржано

# #20165
source: Not locked
mk: Не е заклучено

# #20166
source: Locked
mk: Заклучено

# #20167
source: Frozen
mk: Смрзнато

# #20168
source: Requires reset
mk: Бара одново покренување

# #20169
source: Week
mk: Недела

# #20170
source: Line
mk: Линија

# #20171
source: Windows network (SMB)
mk: Windows мрежа (SMB)

# #20172
source: XBMSP server
mk: XBMSP сервер

# #20173
source: FTP server
mk: FTP сервер

# #20174
source: iTunes music share (DAAP)
mk: iTunes споделена музика (DAAP)

# #20175
source: UPnP server
mk: UPnP сервер

# #20176
source: Show video info
mk: Прикажи податоци за филм

# #20177
source: Done
mk: Заврши

# #20179
source: Caps Lock
mk: Гол. букви

# #20180
source: Symbols
mk: Симболи

# #20181
source: Backspace
mk: Бришење наназад

# #20182
source: Space
mk: Празно место

# #20183
source: Reload skin
mk: Одново вчитај маска

# #20184
source: Rotate pictures using EXIF information
mk: Ротирај слики врз основа на EXIF податоци

# #20185
source: Use poster view styles for TV shows
mk: Користи стил на приказ на постери за TV серии

# #20186
source: Please wait
mk: Молиме почекајте

# #20187
source: UPnP
mk: Правење рез. копија на EEPROM

# #20189
source: Enable auto scrolling for plot & review
mk: Овозможи автом. помрднување на опис и рецензија

# #20190
source: Custom
mk: Прилагодено

# #20191
source: Enable debug logging
mk: Овозможи обележување на грешки

# #20192
source: Download additional information during updates
mk: Превземи дополнителни податоци при ажурирање

# #20193
source: Default service for album information
mk: Подразбирачки сервис за инфо за албум

# #20194
source: Default service for artist information
mk: Подразбирачки давач на податоци за музика

# #20195
source: Change scraper
mk: Промени давач на податоци

# #20196
source: Export music library
mk: Извоз на музичка библиотека

# #20197
source: Import music library
mk: Увоз на музичка библиотека

# #20198
source: No artist found!
mk: Изведувач не е пронајден!

# #20199
source: Downloading artist info failed
mk: Неуспешно превземање податоци за изведувач

# #20250
source: Party on! (videos)
mk: Журка! (филмови)

# #20251
source: Mixing drinks (videos)
mk: Мешање пијалоци (филмови)

# #20252
source: Filling glasses (videos)
mk: Полнење чаши (филмови)

# #20253
source: WebDAV server (HTTP)
mk: WebDAV сервер (HTTP)

# #20254
source: WebDAV server (HTTPS)
mk: WebDAV сервер (HTTPS)

# #20255
source: First logon, edit your profile
mk: Изменете ваш профил за време на прво пријавување

# #20256
source: HTS Tvheadend client
mk: HTS Tvheadend клиент

# #20257
source: VDR Streamdev client
mk: VDR Streamdev клиент

# #20258
source: MythTV client
mk: MythTV клиент

# #20300
source: Web server directory (HTTP)
mk: Папка на Web сервер (HTTP)
