Repository: xbmc/xbmc
Catalog: language/Macedonian/strings.po
Languages: mk

# #33070
source: Custom background
mk: Сопствена позадина

# #33071
source: Custom backgrounds
mk: Сопствени позадини

# #33072
source: View Readme
mk: Погледни го „Readme“

# #33074
source: This version of %s requires an
mk: На оваа верзија од %s и е потребна

# #33075
source: Kodi revision of %s or greater to run.
mk: Kodi ревизија %s или поголема за да работи.

# #33076
source: Please update Kodi.
mk: Ве молиме ажурирајте го Kodi

# #33077
source: No data found!
mk: Нема пронајдени податоци

# #33078
source: Next page
mk: Следна страница

# #33079
source: Love
mk: Љубов

# #33080
source: Hate
mk: Омраза

# #33081
source: This file is stacked, select the part you want to play from.
mk: Оваа датотека е сложена, изаберете дел кој сакате да го репродуцирате.

# #33082
source: Path to script
mk: Пат до Скриптата

# #33100
source: Failed to start
mk: Неуспа за почне

# #33101
source: Webserver
mk: Вебсервер

# #33200
source: Detected New Connection
mk: Нова конекција детектирана

# #34100
source: Number of channels
mk: Број на канали

# #34120
source: Play GUI sounds
mk: Пуштај ги звуците од г.и.

# #34122
source: Always
mk: Секогаш

# #34123
source: Never
mk: Никогаш

# #34201
source: Can't find a next item to play
mk: Следната содржина не може да се најде за пуштање

# #34202
source: Can't find a previous item to play
mk: Претходната содржина не може да се најде за пуштање

# #34300
source: Failed to start Zeroconf
mk: Неуспешно стартување на Zeroconf

# #34301
source: Is Apple's Bonjour Service installed? See log for more info.
mk: Дали е инсталиран Bonjour сервисот на Apple? Прегледај лог за повеќе информации.

# #34400
source: Video Rendering
mk: Видео Рендерирање

# #34403
source: Check your audiosettings
mk: Провери ги аудио поставките

# #34404
source: Use gestures for navigation:
mk: Користи гестикулации за навигација:

# #35000
source: Peripherals
mk: Уреди

# #35001
source: Generic HID device
mk: Општ HID уред

# #35003
source: Generic disk
mk: Општ диск

# #35005
source: New device configured
mk: Поставен е нов уред

# #35006
source: Device removed
mk: Уредот е тргнат

# #35500
source: Location
mk: Локација

# #35501
source: Class
mk: Класа

# #35502
source: Name
mk: Име

# #35504
source: Product ID
mk: ID на производот

# #36016
source: Connected
mk: Поврзано

# #36028
source: Ignore
mk: Игнорирај

# #36035
source: Always
mk: Секогаш

# #36036
source: On start/stop
mk: При старт/стоп

# #36037
source: TV
mk: ТВ

# #36038
source: Amplifier / AVR device
mk: Amplifier / AVR уред

# #36041
source: * Item folder
mk: * локација

# #36135
source: No info available yet.
mk: Сеуште нема инфоермации.

# #36136
source: No info available yet.
mk: Сеуште нема инфоермации.

# #36137
source: No info available yet.
mk: Сеуште нема инфоермации.

# #36181
source: No info available yet.
mk: Сеуште нема инфоермации.

# #36197
source: No info available yet.
mk: Сеуште нема инфоермации.

# #36260
source: No info available yet.
mk: Сеуште нема инфоермации.

# #36301
source: No info available yet.
mk: Сеуште нема инфоермации.

# #36302
source: No info available yet.
mk: Сеуште нема инфоермации.

# #36303
source: No info available yet.
mk: Сеуште нема инфоермации.

# #36310
source: No info available yet.
mk: Сеуште нема инфоермации.

# #36366
source: Select this option if your receiver is capable of decoding DTS streams.
mk: Изберете ја оваа опција ако вашиот ресивер е способен за декодирање DTS потоци.

# #36370
source: Select this option if your receiver is capable of decoding DTS-HD streams.
mk: Изберете ја оваа опција ако вашиот ресивер е способен за декодирање DTS-HD потоци.

# #36410
source: No info available yet.
mk: Сеуште нема инфоермации.

# #36411
source: No info available yet.
mk: Сеуште нема инфоермации.

# #36412
source: No info available yet.
mk: Сеуште нема инфоермации.

# #36413
source: No info available yet.
mk: Сеуште нема инфоермации.

# #36414
source: No info available yet.
mk: Сеуште нема инфоермации.

# #36415
source: No info available yet.
mk: Сеуште нема инфоермации.

# #36426
source: Switch to channel
mk: Префрли на канал

# #36428
source: Record
mk: Сними

# #36902
source: TV show
mk: ТВ Серија

# #36903
source: TV shows
mk: ТВ Серии

# #36906
source: episode
mk: епизода

# #36907
source: episodes
mk: епизоди

# #37026
source: Auto
mk: Автоматски
