Repository: xbmc/xbmc
Catalog: language/Macedonian/strings.po
Languages: mk

# #20301
source: Web server directory (HTTPS)
mk: Папка на Web сервер (HTTPS)

# #20302
source: Unable to write to folder:
mk: Не е можно впишување во папка:

# #20303
source: Do you want to skip and proceed?
mk: Сакате ли да пресконете и продолжите?

# #20304
source: RSS Feed
mk: RSS новости

# #20307
source: Secondary DNS
mk: Алтернативен DNS

# #20308
source: DHCP server:
mk: DHCP сервер:

# #20309
source: Make new folder
mk: Направи нова папка

# #20311
source: Unknown or onboard (protected)
mk: Непознат или е вграден на плоча (заштитено)

# #20314
source: Videos - Library
mk: Филмска Библиоте.

# #20316
source: Sort by: ID
mk: Подреди по: ID

# #20317
source: Scanning movies using %s
mk: Скенирање на филмови со %s

# #20318
source: Scanning music videos using %s
mk: Скенирање на музички видеа со %s

# #20319
source: Scanning tvshows using %s
mk: Скенирање на емисии со %s

# #20320
source: Scanning artists using %s
mk: Скенирање на изведувачи со %s

# #20321
source: Scanning albums using %s
mk: Скенирање на албуми со %s

# #20324
source: Play part...
mk: Репродуцирај дел...

# #20325
source: Calibration reset
mk: Ресет на калибрација

# #20326
source: This will reset the calibration values for %s
mk: Со ова се поништуваат вредностите на калибрација за %s

# #20328
source: Browse for destination
mk: Побарај целно место

# #20329
source: Movies are in separate folders that match the movie title
mk: Филмовите се во различни папки кои се совпаѓаат со името на филмот

# #20330
source: Use folder names for lookups
mk: Користи имиња на датотеки за пребарување

# #20331
source: File
mk: Датоте.

# #20332
source: Use file or folder names in lookups?
mk: Користење на име на датотека или папка за пребарување?

# #20333
source: Set content
mk: Постави содржина

# #20334
source: Folder
mk: Папки

# #20335
source: Look for content recursively?
mk: Пребарувај содржини рекурзивно?

# #20336
source: Unlock sources
mk: Отклучи извори

# #20337
source: Actor
mk: Глумец

# #20338
source: Movie
mk: Филм

# #20339
source: Director
mk: Режисер

# #20340
source: Do you want to remove all items within
mk: Дали да ги одстранам сите ставки од

# #20341
source: this path from the Kodi library?
mk: оваа патека во Kodi библиотеката?

# #20342
source: Movies
mk: Филмови

# #20343
source: TV shows
mk: ТВ Серии

# #20344
source: This directory contains
mk: Директориумот содржи

# #20345
source: Run automated scan
mk: Започни автоматско сканирање

# #20346
source: Scan recursively
mk: Анализирај рекурзивно

# #20347
source: as
mk: како

# #20348
source: Directors
mk: Режисери

# #20349
source: No video files found in this path!
mk: Нема пронајдени видео фајлови на оваа патека

# #20350
source: votes
mk: гласови

# #20351
source: TV show information
mk: Информации за ТВ Серија

# #20352
source: Episode information
mk: Информации за Епизода

# #20353
source: Loading TV show details
mk: Внесувам детали за ТВ Серија

# #20354
source: Fetching episode guide
mk: Пронаоѓање водич на епизоди

# #20355
source: Loading info for episodes in directory
mk: Вчитавање опис на епизоде у папка

# #20356
source: Select TV show:
mk: Одбери ТВ Серија

# #20357
source: Enter the TV show name
mk: Внеси име на Тв Серија

# #20358
source: Season %i
mk: Сезона %i

# #20359
source: Episode
mk: Епизода

# #20360
source: Episodes
mk: Епизоди

# #20361
source: Loading episode details
mk: Вчитавање детали за епизоди

# #20362
source: Remove episode from library
mk: Одстрани епизода од библиотека

# #20363
source: Remove TV show from library
mk: Одстарни ТВ Серија од библиотека

# #20364
source: TV show
mk: ТВ Серија

# #20365
source: Episode plot
mk: Кратка содржина

# #20366
source: * All seasons
mk: Сите сезони

# #20367
source: Hide watched
mk: Скриј гледани

# #20368
source: Prod code
mk: Прод код

# #20369
source: Show plot for unwatched items
mk: Прикажи кратка содржина за неизгледани ставки

# #20370
source: * Hidden to prevent spoilers *
mk: * Скриено поради спречување на непрописна употреба *

# #20371
source: Set season thumb
mk: Постави сликичка за сезона

# #20372
source: Season image
mk: Слика од Сезона

# #20373
source: Season
mk: Сезона

# #20374
source: Downloading movie information
mk: Превземам информации за филмови

# #20375
source: Unassign content
mk: Неодредена содржина

# #20376
source: Original title
mk: Оригинален наслов

# #20377
source: Refresh TV show information
mk: Освежи информации за ТВ Серија

# #20378
source: Refresh info for all episodes?
mk: Освежи инфо за сите епизоди?

# #20379
source: Selected folder contains a single TV show
mk: Селектираниот фолдер содржи една ТВ Серија

# #20380
source: Exclude selected folder from scans
mk: Исклучи го селектираната датотека од сканирање

# #20381
source: Specials
mk: Посебни емисии

# #20383
source: Selected folder contains a single video
mk: Одбраната папка содржи еден филм

# #20384
source: Link to TV show
mk: Врска кон ТВ серии

# #20385
source: Remove link to TV show
mk: Отстрани врска со ТВ серија

# #20386
source: Recently added movies
mk: Неодамна додадени филмови

# #20387
source: Recently added episodes
mk: Неодамна додадени епизоди

# #20388
source: Studios
mk: Студиа

# #20389
source: Music videos
mk: Музички видеа

# #20390
source: Recently added music videos
mk: Неодамна додадени музички видеа

# #20391
source: Music video
mk: Музичко видео

# #20392
source: Remove music video from library
mk: Одстрани мизичко видео од библиотека

# #20393
source: Music video information
mk: Информации за музичко видео

# #20394
source: Loading music video information
mk: Внесувам информации за музичко видео

# #20395
source: Mixed
mk: Мешано

# #20396
source: Go to albums by artist
mk: Оди на албуми на изведувачи

# #20397
source: Go to album
mk: Оди на албум

# #20398
source: Play song
mk: Репродуцирај песна

# #20399
source: Go to music videos from album
mk: Пристапи кон музичко видео од албум

# #20400
source: Go to music videos by artist
mk: Пристапи кон музичко видео од изведувач

# #20401
source: Play music video
mk: Пушти музичко видео

# #20402
source: Download actor thumbnails when adding to library
mk: Симни сликички од актерот кога се додава во библиотека

# #20403
source: Set actor thumb
mk: Промени сликичка од актерот

# #20405
source: Remove episode bookmark
mk: Одстрани обележувач од епизода

# #20406
source: Set episode bookmark
mk: Постави обележувач на епизода

# #20407
source: Scraper settings
mk: Скрапер подесување

# #20408
source: Downloading music video information
mk: Превземам информации за музичко видео

# #20409
source: Downloading TV show information
mk: Превземам информации за ТВ серија

# #20410
source: Trailer
mk: Трејлер

# #20411
source: Flatten
mk: Порамни

# #20413
source: Get fanart
mk: Зан. слика

# #20415
source: Scanning for new content
mk: Пребарување за нови содржини

# #20416
source: First aired
mk: Првпат емитувана

# #20417
source: Writer
mk: Писател

# #20419
source: Replace file names with library titles
mk: Наместо имињата на датотеките прикажи наслови

# #20420
source: Never
mk: Никогаш

# #20421
source: If only one season
mk: Ако е само една сезона

# #20422
source: Always
mk: Секогаш

# #20423
source: Has trailer
mk: Трејлер

# #20424
source: False
mk: Неактивно

# #20425
source: Fanart slideshow
mk: Слајдшоу

# #20426
source: Export to a single file or separate
mk: Експортирај во една датотека или секое одделно

# #20427
source: files per entry?
mk: Колку датотеки во запис?

# #20428
source: Single file
mk: Една датотека

# #20429
source: Separate
mk: Одвоено

# #20430
source: Export thumbnails and fanart?
mk: Експортирај сликички?

# #20431
source: Overwrite old files?
mk: Пребриши стари датотеки?

# #20432
source: Exclude path from library updates
mk: Не скенирај ја оваа патека при освежување на библиотеката

# #20433
source: Extract thumbnails and video information
mk: Пронајди сликички и информации за видеата

# #20434
source: Sets
mk: Постави

# #20436
source: Export actor thumbs?
mk: Експортирај сликички за глумците

# #20437
source: Choose fanart
mk: Одбери постери

# #20438
source: Local fanart
mk: Локални постери

# #20439
source: No fanart
mk: Нема постери

# #20440
source: Current fanart
mk: Активни постери

# #20441
source: Remote fanart
mk: Други постери

# #20442
source: Change content
mk: Смени содржина

# #20443
source: Do you want to refresh info for all
mk: Дали да се обноват информации за сите

# #20444
source: items within this path?
mk: ставки во оваа патека?

# #20445
source: Fanart
mk: Зан. слика

# #20446
source: Locally stored information found.
mk: Локално чувана информација пронајдена

# #20447
source: Ignore and refresh from internet?
mk: Игнорирај и освежи од интернет?

# #20448
source: Could not download information
mk: Неможе да се превземат информации

# #20449
source: Unable to connect to remote server
mk: Неможам да се конектирам со серверот

# #20450
source: Would you like to continue scanning?
mk: Дали сакате да продолжите со скенирање

# #20451
source: Countries
mk: Држави

# #20452
source: episode
mk: епизода

# #20453
source: episodes
mk: епизоди

# #20454
source: Listener
mk: Слушател

# #20455
source: Listeners
mk: Слушатели

# #20457
source: Movie set
mk: Филмски сет

# #20458
source: Group movies in sets
mk: Групирај Филмови во сетови

# #21330
source: Show hidden files and directories
mk: Прикажи скриени датотеки и папки

# #21331
source: TuxBox client
mk: TuxBox клиент

# #21332
source: WARNING: Target TuxBox device is in recording-mode!
mk: ВНИМАНИЕ: Уредот TuxBox е веќе во режим за снимање!

# #21333
source: The stream will be stopped!
mk: Стримот ќе биде запрен!

# #21334
source: Zap to channel: %s failed!
mk: Префрлање на канал: %s неуспешно!

# #21335
source: Are you sure to start the stream?
mk: Дали да се активира стримот?

# #21336
source: Connecting to: %s
mk: Се поврзувам со: %s

# #21337
source: TuxBox device
mk: TuxBox уред

# #21359
source: Add media share...
mk: Додај медиа извор...

# #21360
source: Share video and music libraries through UPnP
mk: Споделувај видео и музички библиотеки преку UPnP

# #21368
source: Override ASS/SSA subtitles fonts
mk: Игнорирај фонтови во ASS/SSA титлови

# #21369
source: Enable mouse and touch screen support
mk: Овозможи глувче и екран на допир

# #21370
source: Play navigation sounds during media playback
mk: Активирај звуци за команди додека трае репродукција

# #21371
source: Thumbnail
mk: Сликичка

# #21372
source: Forced DVD player region
mk: Форсиран регион на DVD плејер

# #21373
source: Video output
mk: Видео излез

# #21374
source: Video aspect
mk: Формат на видеото

# #21375
source: Normal
mk: Нормален

# #21378
source: Enable 480p
mk: Овозможи 480p

# #21379
source: Enable 720p
mk: Овозможи 720p

# #21380
source: Enable 1080i
mk: Овозможи 1080i

# #21381
source: Enter name of new playlist
mk: Внесете име за новата листа

# #21382
source: Show "Add source" buttons in file lists
mk: Прикажи копче „Додај извор“ кај листите на датотеки

# #21383
source: Enable scrollbars
mk: Овозможи

# #21385
source: Open
mk: Отвори

# #21386
source: Acoustic management level
mk: Подесување на акустично ниво

# #21387
source: Fast
mk: Брзо

# #21388
source: Quiet
mk: Тивко

# #21389
source: Enable custom background
mk: Овозможи сопствени позадини

# #21390
source: Power management level
mk: Ниво на штедење струја

# #21391
source: High power
mk: Високо

# #21392
source: Low power
mk: Ниско

# #21393
source: High standby
mk: Високо (мирување)

# #21394
source: Low standby
mk: Ниско (мирување)

# #21395
source: Unable to cache files bigger than 4GB
mk: Не е можно кеширање датотеки поголеми од 4GB

# #21396
source: Chapter
mk: Поглавје

# #21397
source: High quality pixel shader v2
mk: Високо квалитетен pixel shader v2

# #21398
source: Enable playlist at startup
mk: Активирај листа за репр. при старување

# #21399
source: Use tween animations
mk: Користи двојни анимации

# #21400
source: contains
mk: содржи

# #21401
source: does not contain
mk: не содржи

# #21402
source: is
mk: е

# #21403
source: is not
mk: не е

# #21404
source: starts with
mk: започнува со

# #21405
source: ends with
mk: завршува со

# #21406
source: greater than
mk: поголем од

# #21407
source: less than
mk: помал од

# #21408
source: after
mk: после

# #21409
source: before
mk: пред

# #21410
source: in the last
mk: е последен

# #21411
source: not in the last
mk: не е во последните

# #21412
source: Scrapers
mk: Добавувачи

# #21413
source: Default movie scraper
mk: Основен добавувач за филмови

# #21414
source: Default tvshow scraper
mk: Основен добавувач за серии

# #21415
source: Default music video scraper
mk: Основен добавувач за музички спотови

# #21417
source: Settings
mk: Поставки

# #21418
source: Multilingual
mk: Повеќејазично

# #21419
source: No scrapers present
mk: нема добавувачи

# #21420
source: Value to match
mk: Вредност која се бара

# #21421
source: Smart playlist rule
mk: Правило за паметен список на реп.

# #21422
source: Match items where
mk: Пронајди ставки каде

# #21423
source: New rule...
mk: Ново правило...

# #21424
source: Items must match
mk: Ставките мора да ги исполнат

# #21425
source: all of the rules
mk: сите правила

# #21426
source: one or more of the rules
mk: едно или повеќе од правилата

# #21427
source: Limit to
mk: Ограничи на

# #21428
source: No limit
mk: Нема ограничувања

# #21429
source: Order by
mk: Подреди по

# #21430
source: ascending
mk: растечки

# #21431
source: descending
mk: опаѓачки

# #21432
source: Edit smart playlist
mk: Промена на паметен список на реп.

# #21433
source: Name of the playlist
mk: Име на список за реп.

# #21434
source: Find items where
mk: Пронајди ставки каде

# #21435
source: Edit
mk: Уреди

# #21436
source: %i items
mk: %i ставки

# #21437
source: New smart playlist...
mk: Нов паметен список за реп.

# #21438
source: %c Drive
mk: %c Драјв

# #21439
source: Edit party mode rules
mk: Промена на правилата за режим на журка

# #21440
source: Home folder
mk: Почетна папка

# #21441
source: Watched count
mk: Број на гледања

# #21442
source: Episode title
mk: Наслов на Епизода

# #21443
source: Video resolution
mk: Видео Резолуција

# #21444
source: Audio channels
mk: Аудио канали

# #21445
source: Video codec
mk: Видео кодек

# #21446
source: Audio codec
mk: Аудио кодек

# #21447
source: Audio language
mk: Аудио јазик

# #21448
source: Subtitle language
mk: Јазик на титл

# #21449
source: Remote control sends keyboard presses
mk: Далечинското праќа сигнали како тастатура

# #21450
source: Edit
mk: Уреди

# #21451
source: Internet connection required.
mk: Интернет конекција е потребна

# #21452
source: Get More...
mk: Превземи повеќе

# #21454
source: Cache full
mk: Кешот е полн

# #21455
source: Cache filled before reaching required amount for continous playback
mk: Кешот се преполни пред да има доволно податоци за непрекинато гледање

# #21457
source: Watched episode count
mk: Број на гледани епизоди

# #21460
source: Subtitle position on screen
mk: Позиција на превод

# #21461
source: Fixed
mk: Фиксирано

# #21462
source: Bottom of video
mk: На дното на видеото

# #21463
source: Below video
mk: Под видеото

# #21464
source: Top of video
mk: На врвот од видеото

# #21465
source: Above video
mk: Над видеото

# #21467
source: %.1f to %.1f
mk: %.1f до %.1f

# #21468
source: %d to %d
mk: %d до %d

# #21469
source: %s to %s
mk: %s до %s

# #21800
source: File name
mk: Име на датотека

# #21801
source: File path
mk: Патека

# #21802
source: File size
mk: Големина

# #21803
source: File date/time
mk: датум/време на датотеката

# #21805
source: Resolution
mk: Резолуција

# #21806
source: Comment
mk: Коментар

# #21807
source: Colour/B&W
mk: Колор/Ц&Б

# #21808
source: JPEG process
mk: JPEG тип

# #21820
source: Date/Time
mk: Дата/Време

# #21821
source: Description
mk: Опис

# #21822
source: Camera make
mk: Произведувач на камера

# #21823
source: Camera model
mk: Модел на камера

# #21824
source: EXIF comment
mk: EXIF коментар

# #21826
source: Aperture
mk: Апертура

# #21827
source: Focal length
mk: Фокална должина

# #21828
source: Focus distance
mk: Фокусно растојание

# #21829
source: Exposure
mk: Експозиција

# #21830
source: Exposure time
mk: Време на експозиција

# #21831
source: Exposure bias
mk: Прилагодување на експозиција

# #21832
source: Exposure mode
mk: Мод на експозиција

# #21833
source: Flash used
mk: Блиц користен

# #21834
source: White-balance
mk: Ниво на белата

# #21835
source: Light source
mk: Извор на светло

# #21836
source: Metering mode
mk: Начин на мерење

# #21838
source: Digital zoom
mk: Дигитален зум

# #21839
source: CCD width
mk: CCD ширина

# #21840
source: GPS latitude
mk: GPS ширина

# #21841
source: GPS longitude
mk: GPS должина

# #21842
source: GPS altitude
mk: GPS висина

# #21843
source: Orientation
mk: Ориентација

# #21860
source: Supplemental categories
mk: Дополнителни категории

# #21861
source: Keywords
mk: Клучни зборови

# #21862
source: Caption
mk: Наслов

# #21863
source: Author
mk: Автор

# #21864
source: Headline
mk: Наслов

# #21865
source: Special instructions
mk: Специјални инструкции

# #21866
source: Category
mk: Категорија

# #21867
source: Byline
mk: Опис

# #21868
source: Byline title
mk: наслов на опис

# #21869
source: Credit
mk: Автори

# #21870
source: Source
mk: Извор

# #21871
source: Copyright notice
mk: Авторски права

# #21872
source: Object name
mk: Име на објектот

# #21873
source: City
mk: Град

# #21874
source: State
mk: Држава

# #21875
source: Country
mk: Држава

# #21877
source: Date created
mk: Дата на креирање

# #21881
source: Allow control of Kodi via UPnP
mk: Дозволи контрола на Kodi преку UPnP

# #21882
source: Attempt to skip introduction before DVD menu
mk: Пробај да се прескокне Интро пред ДВД Мени

# #21883
source: Saved music
mk: Сочувана Музика

# #21884
source: Query info for all artists
mk: Пребарај инфо за сите изведувачи

# #21885
source: Downloading album information
mk: Превземам информации за албум

# #21886
source: Downloading artist information
mk: Превземам информации за изведувач

# #21887
source: Biography
mk: Биографија

# #21888
source: Discography
mk: Дискографија

# #21889
source: Searching artist
mk: Пребарувам изведувач

# #21890
source: Select artist
mk: Одбери изведувач

# #21891
source: Artist information
mk: Информации за изведувач

# #21892
source: Instruments
mk: Инструменти

# #21893
source: Born
mk: Роден

# #21894
source: Formed
mk: Оформен

# #21895
source: Themes
mk: Теми

# #21896
source: Disbanded
mk: Расформирани

# #21897
source: Died
mk: Починал

# #22006
source: Subtitle offset
mk: офсет на титл

# #22016
source: By title
mk: По наслов

# #22017
source: By group
mk: По група

# #22018
source: Live channels
mk: Канали во живо

# #22019
source: Recordings by title
mk: Снимки по наслов

# #22023
source: DirectX vendor:
mk: DirectX вендор:

# #22024
source: Direct3D version:
mk: Direct3D верзија:

# #22030
source: Font
mk: Букви

# #22031
source: Size
mk: Голем.

# #22032
source: Colours
mk: Боји

# #22034
source: Export karaoke titles as HTML
mk: Експортирај караоке наслови во HTML

# #22035
source: Export karaoke titles as CSV
mk: Експортирај караоке наслови во CSV

# #22036
source: Import karaoke titles...
mk: Импортирај караоке наслови ...

# #22038
source: Export karaoke titles...
mk: Експортирај караоке наслови

# #22039
source: Enter song number
mk: Внеси број на песна

# #22040
source: white/green
mk: бело/зелено

# #22041
source: white/red
mk: бело/црвено

# #22042
source: white/blue
mk: бело/плаво

# #22043
source: black/white
mk: бело/црно

# #22079
source: Default select action
mk: Подразбирачка акција при селектирање

# #22080
source: Choose
mk: Одбери

# #22081
source: Show Information
mk: Прикажи информација

# #22082
source: More...
mk: Повеќе ....

# #23049
source: Teletext not available
mk: Нема достапен телетекст

# #23050
source: Activate Teletext
mk: Активирај телетекст

# #23051
source: Part %i
mk: Дел %i

# #23052
source: Buffering %i bytes
mk: Баферирам %i бајти

# #23053
source: Stopping
mk: Запирам

# #23054
source: Running
mk: Стартување

# #23055
source: Scale Teletext to 4:3
mk: Скалирање на телетекстот во 4:3

# #23100
source: External Player Active
mk: Надворешен Плеер Активен

# #24005
source: Media sources
mk: Медија извори

# #24007
source: Movie information
mk: Податоци за филмот

# #24008
source: Screensaver
mk: Чувар на екран

# #24009
source: Script
mk: Скрипта

# #24012
source: Subtitles
mk: Титлови

# #24013
source: Lyrics
mk: Текстови на песни

# #24015
source: Music video information
mk: Информации за музичко видео

# #24016
source: Album information
mk: Податоци за албумот

# #24017
source: Artist information
mk: Информации за изведувач

# #24018
source: Services
mk: Избор на сервис

# #24020
source: Configure
mk: Конфигурирај

# #24021
source: Disable
mk: Оневозможи

# #24022
source: Enable
mk: Овозможи

# #24023
source: Disabled
mk: Оневозможено

# #24027
source: Weather
mk: Временска прогноза

# #24028
source: Weather.com (standard)
mk: Weather.com (стандардно)

# #24029
source: Service for weather information
mk: Сервис за временски информации

# #24051
source: Version:
mk: Верзија:

# #24064
source: Add-on enabled
mk: Додатокот е овозможен

# #24065
source: Add-on updated
mk: Додатокот е обновен

# #24068
source: Update available
mk: Достапно е ажурирање

# #24069
source: Update
mk: Ажурирај

# #24071
source: An unknown error has occurred.
mk: Се случи непозната грешка.

# #24072
source: Settings required
mk: Потребни се подесувања

# #24073
source: Could not connect
mk: Неможам да се поврзам

# #24074
source: Needs to restart
mk: Потребен е рестарт

# #24075
source: Disable
mk: Оневозможи

# #24076
source: Add-on Required
mk: Потребен е додадок

# #24097
source: Would you like to disable it on your system?
mk: Дали сакате да го исклучите во системот?

# #24098
source: Broken
mk: Неисправен

# #24099
source: Would you like to switch to this skin?
mk: Дали сакате да ја поставите оваа маска?

# #24121
source: Enter search string
mk: Внесите збор за пребарување

# #25000
source: Notifications
mk: Нотификации

# #25002
source: Select from all titles ...
mk: Одбери од сите наслови...

# #25005
source: Title: %d
mk: Наслов: %d

# #29801
source: QWERTY keyboard
mk: QWERTY тастатура

# #29802
source: Passthrough Audio in use
mk: Passthrough Аудио во употреба

# #33001
source: Trailer quality
mk: Квалитет на Трејлер

# #33003
source: Download
mk: Превземи

# #33004
source: Download & play
mk: Превземи и Репродуцирај

# #33005
source: Download & save
mk: Превземи и меморирај

# #33006
source: Today
mk: Денес

# #33007
source: Tomorrow
mk: Утре

# #33008
source: Saving
mk: Меморирам

# #33009
source: Copying
mk: Копирам

# #33010
source: Set download directory
mk: Постави директориум за превземање

# #33012
source: Short
mk: Кратко

# #33013
source: Long
mk: Долго

# #33016
source: Clips
mk: Клипови

# #33018
source: Tonight
mk: Вечерва

# #33019
source: Tomorrow Night
mk: Утре вечер

# #33021
source: Precipitation
mk: Врнежи

# #33030
source: Outlook
mk: Аутлук

# #33032
source: Translate text
mk: Преведи го текстот

# #33034
source: 36 Hour
mk: 36 часа

# #33035
source: Maps
mk: Мапи

# #33036
source: Hourly
mk: На час

# #33037
source: Weekend
mk: Викенд

# #33038
source: %s day
mk: %s ден

# #33049
source: Alert
mk: Тревога

# #33050
source: Alerts
mk: Тревоги

# #33052
source: Check
mk: Провери

# #33054
source: Seasons
mk: Сезони

# #33055
source: Use your
mk: Користи го твојот

# #33057
source: Listen to
mk: Слушај

# #33060
source: Power
mk: Моќ

# #33061
source: Menu
mk: Мени

# #33062
source: Play the
mk: Пушти го

# #33063
source: Options
mk: Опции

# #33067
source: Star rating
mk: Почни со рејтинг

# #33068
source: Background
mk: Позадина

# #33069
source: Backgrounds
mk: Поздаини
