Repository: xbmc/xbmc
Catalog: language/Macedonian/strings.po
Languages: mk

# #600
source: Rip audio CD
mk: Рипувај музички CD

# #601
source: Medium
mk: Средно

# #602
source: Standard
mk: Вообичаено

# #603
source: Extreme
mk: Екстремно

# #604
source: Constant bitrate
mk: Непроменлива брзина

# #605
source: Ripping...
mk: Рипување...

# #607
source: To:
mk: За:

# #608
source: Could not rip CD or track
mk: Не е можно рипување на CD или нумера

# #609
source: CDDARipPath is not set.
mk: CDDARipPath не е поставен.

# #610
source: Rip audio track
mk: Рипувај музичка нумера

# #611
source: Enter number
mk: Внесете број

# #620
source: Audio CDs
mk: Музички CD-иња

# #621
source: Encoder
mk: Кодер

# #622
source: Quality
mk: Квалитет

# #623
source: Bitrate
mk: Брзина на проток

# #624
source: Include track number
mk: Вклучи број на нумера

# #625
source: All songs of
mk: Сите песни од

# #629
source: View mode
mk: Режим на приказ

# #630
source: Normal
mk: Нормален

# #631
source: Zoom
mk: Зголемен

# #632
source: Stretch 4:3
mk: Развлечено 4:3

# #633
source: Wide Zoom
mk: Развлечено 14:9

# #634
source: Stretch 16:9
mk: Развлечено 16:9

# #635
source: Original Size
mk: Првобитна големина

# #636
source: Custom
mk: Прилагодено

# #639
source: Use track levels
mk: Користи на ниво на нумера

# #640
source: Use album levels
mk: Користи на ниво на албум

# #644
source: Crop black bars
mk: Исечи црни траки

# #645
source: Need to unpack a big file. Continue?
mk: Потребно е отпакување големи датотеке. Продолжи?

# #646
source: Remove from library
mk: Тргни од библиотека

# #647
source: Export video library
mk: Извези библиотека на филмови

# #648
source: Import video library
mk: Увези библиотека на филмови

# #649
source: Importing
mk: Увоз е во тек

# #650
source: Exporting
mk: Извоз е во тек

# #651
source: Browse for library
mk: Побарај библиотека

# #652
source: Years
mk: Година

# #653
source: Update library
mk: Ажурирај библиотека

# #654
source: Show debug info
mk: Прикажи под. за отст. греш.

# #655
source: Browse for executable
mk: Побарај извршни датотеки

# #656
source: Browse for playlist
mk: Побарај список за репродукција

# #657
source: Browse for folder
mk: Побарај папка

# #658
source: Song information
mk: Податоци за песна

# #659
source: Non-linear stretch
mk: Нелинеарно истегнување

# #660
source: Volume amplification
mk: Појачување на звук

# #661
source: Choose export folder
mk: Изаберете излезна папка

# #662
source: This file is no longer available.
mk: Оваа датотека веќе не е достапна.

# #663
source: Would you like to remove it from the library?
mk: Сакате ова да го тргнете од библиотека?

# #664
source: Browse for Script
mk: Побарај скрипта

# #665
source: Compression level
mk: Ниво на компресија

# #700
source: Cleaning up library
mk: Чистење библиотека

# #701
source: Removing old songs from the library
mk: Тргање стари песни од библиотека

# #702
source: This path has been scanned before
mk: Оваа патека е веќе анализирана

# #705
source: Network
mk: Мрежа

# #706
source: Server
mk: Сервер

# #708
source: Use an HTTP proxy server to access the internet
mk: Користи посреднички HTTP сервер за пристап на Интернет

# #711
source: Internet Protocol (IP)
mk: Интернет протокол (IP)

# #712
source: Invalid port specified. Value must be between 1 and 65535.
mk: Сте одбрале неисправен приклучок. Вредност помеѓу 1 и 65535.

# #713
source: HTTP proxy
mk: HTTP посредник

# #715
source: Assignment
mk: Задача

# #716
source: Automatic (DHCP)
mk: Автоматски (DHCP)

# #717
source: Manual (Static)
mk: Рачно (статичка)

# #719
source: IP address
mk: IP адреса

# #722
source: DNS server
mk: DNS сервер

# #723
source: Save & restart
mk: Сочувај и пак стартувај

# #724
source: Invalid address specified. Value must be AAA.BBB.CCC.DDD
mk: Сте одредиле неисправна адреса. Вредност мора ба биде AAA.BBB.CCC.DDD

# #725
source: with numbers between 0 and 255.
mk: со броеви помеѓу 0 и 255.

# #726
source: Changes not saved. Continue without saving?
mk: Промени не се сочувани. Продолжи без чувањеа?

# #727
source: Web server
mk: Web сервер

# #728
source: FTP server
mk: FTP сервер

# #730
source: Port
mk: Приклучок

# #732
source: Save & apply
mk: Сочувај и примени

# #733
source: Password
mk: Лозинка

# #734
source: No pass
mk: Без лозинка

# #735
source: Character set
mk: Собир на знаци

# #736
source: Style
mk: Стил

# #737
source: Colour
mk: Боја

# #738
source: Normal
mk: Нормален

# #739
source: Bold
mk: Здебелен

# #740
source: Italics
mk: Накривен

# #741
source: Bold italics
mk: Здебелен накривен

# #742
source: White
mk: Бела

# #743
source: Yellow
mk: Жолта

# #744
source: Files
mk: Датотеки

# #745
source: No scanned information for this view
mk: Нема анализирани податоци за овој приказ

# #746
source: Please turn off library mode
mk: Исклучете режим на библиотека

# #747
source: Error loading image
mk: Грешка при вчитување на слика

# #748
source: Edit path
mk: Уреди патека

# #749
source: Mirror image
mk: Копија на слика

# #750
source: Are you sure?
mk: Да ли сте сигурни?

# #751
source: Removing source
mk: Отстранување извор

# #754
source: Add program link
mk: Додади врска кон програмот

# #755
source: Edit program path
mk: Уреди патека на програмот

# #756
source: Edit program name
mk: Уреди име на програмот

# #757
source: Edit path depth
mk: Уреди длабочина на патака

# #759
source: View: Big list
mk: Приказ: Гол. список

# #760
source: Yellow
mk: Жолта

# #761
source: White
mk: Бела

# #762
source: Blue
mk: Сина

# #763
source: Bright green
mk: Светло зелена

# #764
source: Yellow green
mk: Жолтозелена

# #765
source: Cyan
mk: Азурно сина

# #766
source: Light grey
mk: Светло сива

# #767
source: Grey
mk: Сива

# #770
source: Error %i: share not available
mk: Грешка %i: делење не е достапно

# #772
source: Audio output
mk: Звучен излез

# #773
source: Seeking
mk: Позиционирање

# #774
source: Slideshow folder
mk: Папка репрод. слајдови

# #775
source: Network interface
mk: Мрежен интерфејс

# #776
source: Wireless network name (ESSID)
mk: Име на безжична мрежа (ESSID)

# #777
source: Wireless password
mk: Wireless лозинка

# #778
source: Wireless security
mk: Wireless безбедност

# #779
source: Save and apply network interface settings
mk: Сочувај и примени поставки на мрежен интрефејс

# #780
source: No encryption
mk: Без заштита

# #784
source: Applying network interface settings. Please wait.
mk: Применување поставки на мрежен интерфејс. Почекајте.

# #785
source: Network interface restarted successfully.
mk: Успешно је обавено поновно покренување на мрежен интерфејс.

# #786
source: Network interface did not start successfully.
mk: Неуспешно покренување на мрежен интерфејс.

# #787
source: Interface disabled
mk: Интерфејс е оневозможен

# #788
source: Network interface disabled successfully.
mk: Успешно оневозможен мрежен интерфејс.

# #789
source: Wireless network name (ESSID)
mk: Име на безжична мрежа (ESSID)

# #790
source: Remote control
mk: Далечински управувач

# #791
source: Allow programs on this system to control Kodi
mk: Дозволи на програми на овој систем да управуваат со Kodi

# #792
source: Port
mk: Приклучок

# #793
source: Port range
mk: Опсег на приклучок

# #794
source: Allow programs on other systems to control Kodi
mk: Дозволи на програми од други системи да управуваат со Kodi

# #795
source: Initial repeat delay (ms)
mk: Иницијално каснење на повторување (ms)

# #796
source: Continuous repeat delay (ms)
mk: Непрекидно каснење на повторување (ms)

# #797
source: Maximum number of clients
mk: Максимален број на клиенти

# #798
source: Internet access
mk: Пристап кон Интернет

# #799
source: Library Update
mk: Ажурирање Библиотека

# #850
source: Invalid port number entered
mk: Внесовте погрешен број на приклучоци

# #851
source: Valid port range is 1-65535
mk: Исправен опсег на приклучоци е од 1-65535

# #852
source: Valid port range is 1024-65535
mk: Исправен опсег на приклучоци е од 1024-65535

# #997
source: Add Pictures...
mk: Додај Фотограии..

# #998
source: Add Music...
mk: Додади Музика...

# #999
source: Add Videos...
mk: Додади Видеа...

# #1001
source: Unable to connect
mk: Не е можно поврзување

# #1002
source: Kodi was unable to connect to the network location.
mk: Kodi не успеа да се поврзе на мрежна локација.

# #1003
source: This could be due to the network not being connected.
mk: Разлог може да биде мрежата да не е поврзана.

# #1004
source: Would you like to add it anyway?
mk: Сеуште сакате да је додадете?

# #1006
source: IP address
mk: IP адреса

# #1007
source: Add network location
mk: Додади мрежна локација

# #1008
source: Protocol
mk: Протокол

# #1009
source: Server address
mk: Адреса на сервер

# #1010
source: Server name
mk: Име на сервер

# #1011
source: Remote path
mk: Одалечена патека

# #1012
source: Shared folder
mk: Споделена папка

# #1013
source: Port
mk: Приклучок

# #1014
source: Username
mk: Корисничко име

# #1015
source: Browse for network server
mk: Побарај мрежен сервер

# #1016
source: Enter the network address of the server
mk: Внесете мрежна адреса на сервер

# #1017
source: Enter the path on the server
mk: Внесете патека на сервер

# #1018
source: Enter the port number
mk: Внесете број на приклучоци

# #1019
source: Enter the username
mk: Внесете корисничко име

# #1020
source: Add %s source
mk: Додади %s извор

# #1021
source: Enter the paths or browse for the media locations.
mk: Внесете патека или побарајте локација на медиуми.

# #1022
source: Enter a name for this media Source.
mk: Внесете име за овај извор на медиуми.

# #1023
source: Browse for new share
mk: Потражи ново делење

# #1024
source: Browse
mk: Побарај

# #1025
source: Could not retrieve directory information.
mk: Не е можно преземање податоци за директориуми.

# #1026
source: Add source
mk: Додади извор

# #1027
source: Edit source
mk: Уреди извор

# #1028
source: Edit %s source
mk: Уреди %s извор

# #1029
source: Enter the new label
mk: Внеси нова ознака

# #1030
source: Browse for image
mk: Побарај слика

# #1031
source: Browse for image folder
mk: Побарај папка со слики

# #1032
source: Add network location...
mk: Додади мрежна локација...

# #1033
source: Browse for file
mk: Побарај датотека

# #1034
source: Submenu
mk: Подмени

# #1035
source: Enable submenu buttons
mk: Овозможи тастери на подмени

# #1036
source: Favourites
mk: Омилено

# #1037
source: Video Add-ons
mk: Додатоци за видео

# #1038
source: Music Add-ons
mk: Додатоци за музика

# #1039
source: Picture Add-ons
mk: Додатоци за слики

# #1040
source: Loading directory
mk: Вчитување директориуми

# #1041
source: Retrieved %i items
mk: Примено %i ставки

# #1042
source: Retrieved %i of %i items
mk: Примено %i од %i ставки

# #1043
source: Program Add-ons
mk: Додатоци за програм

# #1045
source: Add-on settings
mk: Поставки за додатки

# #1046
source: Access points
mk: Пристапна точка

# #1047
source: Other...
mk: Останато...

# #1048
source: Username
mk: Корисничко име

# #1049
source: Script settings
mk: Поставки за скрипти

# #1050
source: Singles
mk: Поединечни

# #1051
source: Enter web address
mk: Внесете интернет адреса

# #1200
source: SMB client
mk: SMB клиент

# #1202
source: Workgroup
mk: Работна група

# #1203
source: Default username
mk: Подразбирачко корисничко име

# #1204
source: Default password
mk: Подразбирачка лозинка

# #1207
source: WINS server
mk: WINS сервер

# #1208
source: Mount SMB shares
mk: Подигни SMB делења

# #1210
source: Remove
mk: Отстрани

# #1211
source: Music
mk: Музика

# #1212
source: Video
mk: Филмови

# #1213
source: Pictures
mk: Слики

# #1214
source: Files
mk: Датотеки

# #1215
source: Music & video
mk: Музика и филмови

# #1216
source: Music & pictures
mk: Музика и слики

# #1217
source: Music & files
mk: Музика и датотеки

# #1218
source: Video & pictures
mk: Филмови и слики

# #1219
source: Video & files
mk: Филмови и датотеки

# #1220
source: Pictures & files
mk: Слики и датотеки

# #1221
source: Music & video & pictures
mk: Музика, филмови и слики

# #1222
source: Music & video & pictures & files
mk: Музика, филмови, слики и датотеки

# #1223
source: Disabled
mk: Оневозможено

# #1226
source: Files & music & video
mk: Датотеки, музика и филмови

# #1227
source: Files & pictures & music
mk: Датотеки, слики и музика

# #1228
source: Files & pictures & video
mk: Датотеки, слики и филмови

# #1229
source: Music & programs
mk: Музика и програми

# #1230
source: Video & programs
mk: Филмови и програми

# #1231
source: Pictures & programs
mk: Слики и програми

# #1232
source: Music & video & pictures & programs
mk: Музика, филмови, слики и програми

# #1233
source: Programs & video & music
mk: Програми, филмови и музика

# #1234
source: Programs & pictures & music
mk: Програми, слики и музика

# #1235
source: Programs & pictures & video
mk: Програми, слики и филмови

# #1260
source: Announce these services to other systems via Zeroconf
mk: Огласи ги ове услуги на останатите системи преку Zeroconf

# #1270
source: Allow Kodi to receive AirPlay content
mk: Дозволи Kodi да прими AirPlay содржина

# #1271
source: Device name
mk: Име на уред

# #1300
source: Custom audio device
mk: Прилагоден звучен уред

# #1301
source: Custom passthrough device
mk: Прилагоден пролазен уред

# #1396
source: Drifting
mk: клизаво

# #1397
source: and
mk: и

# #1398
source: Freezing
mk: поледица

# #1399
source: Late
mk: закаснет

# #1400
source: Isolated
mk: изолован

# #1401
source: Thundershowers
mk: порој со грмотевица

# #1402
source: Thunder
mk: грмеж

# #1403
source: Sun
mk: сончево

# #1404
source: Heavy
mk: јак(а)

# #1405
source: in
mk: во

# #1407
source: Vicinity
mk: близина

# #1408
source: Ice
mk: лед

# #1409
source: Crystals
mk: кристали

# #1410
source: Calm
mk: благо

# #1411
source: with
mk: со

# #1412
source: windy
mk: ветровито

# #1413
source: Patches
mk: Парчиња

# #1414
source: Thunderstorm
mk: олуја

# #1415
source: Drizzle
mk: ситен дожд

# #1416
source: Foggy
mk: магловито

# #1417
source: Grains
mk: град

# #1418
source: Thunderstorms
mk: грмотевица

# #1419
source: Shallow
mk: Плитко

# #1420
source: Moderate
mk: умерена

# #1421
source: Very High
mk: Многу високо

# #1422
source: Windy
mk: ветровито

# #1423
source: Mist
mk: магла

# #1424
source: Overcast
mk: Облачно

# #1425
source: Pellets
mk: Ситен град

# #1426
source: Hail
mk: Град

# #1427
source: Smoke
mk: Чад

# #1428
source: Volcanic
mk: Вулкански

# #1429
source: Ash
mk: Пепел

# #1430
source: Widespread
mk: Распространето

# #1431
source: Dust
mk: Прав

# #1432
source: Sand
mk: Песок

# #1433
source: Spray
mk: Млаз

# #1434
source: Whirls
mk: Вртлози

# #1435
source: Sandstorm
mk: Песочна бура

# #1436
source: Blowing
mk: Дува

# #1437
source: Pellet
mk: Ситен град

# #1438
source: Small
mk: Мало

# #1439
source: and
mk: и

# #1440
source: Sleet
mk: Лапавица

# #1441
source: with
mk: со

# #1442
source: Chance
mk: можност

# #1443
source: of
mk: од

# #1444
source: Funnel
mk: инка

# #1445
source: Cloud
mk: Облак

# #1446
source: Unknown
mk: Непознато

# #1447
source: Squals
mk: систем од бури

# #1448
source: Precipitation
mk: Врнежи

# #1449
source: Partial
mk: Делумно

# #1450
source: Put display to sleep when idle
mk: Постави екран „на спиење“, кога се не користи

# #2050
source: Runtime
mk: Траеање

# #2080
source: Empty list
mk: Испразни ја листата

# #2081
source: Went back to parent list because the active list has been emptied
mk: Враќање ниво погоре зашто активната листа беше испразнета

# #2100
source: Script failed! : %s
mk: Скриптата „пукнала“! : %s

# #2101
source: Newer version needed - See log
mk: Потребна нова верзија - Погледни лог

# #10000
source: Home
mk: Почетна страна

# #10001
source: Programs
mk: Програми

# #10002
source: Pictures
mk: Упр. со датот.

# #10003
source: File manager
mk: Упр. со датот.

# #10004
source: Settings
mk: Поставки

# #10005
source: Music
mk: Музика

# #10006
source: Videos
mk: Филмови

# #10007
source: System information
mk: Податоци за системот

# #10008
source: Settings - General
mk: Поставки - Општи

# #10009
source: Settings - Screen
mk: Поставки - Екран

# #10010
source: Settings - Appearance - GUI Calibration
mk: Поставки - Изглед - GUI калибрација

# #10011
source: Settings - Videos - Screen Calibration
mk: Поставки - Филмови - Калибрација на екран

# #10012
source: Settings - Pictures
mk: Поставки - Слики

# #10013
source: Settings - Programs
mk: Поставки - Програми

# #10014
source: Settings - Weather
mk: Поставки - Временска прогноза

# #10015
source: Settings - Music
mk: Поставки - Музика

# #10016
source: Settings - System
mk: Поставки - Систем

# #10017
source: Settings - Videos
mk: Поставки - Филмови

# #10018
source: Settings - Network
mk: Поставки - Мрежа

# #10019
source: Settings - Appearance
mk: Поставки - Изглед

# #10020
source: Scripts
mk: Скрипти

# #10021
source: Web Browser
mk: Читач на интернет страни

# #10025
source: Videos
mk: Филмови

# #10028
source: Videos/Playlist
mk: Филмови/Список за реп.

# #10029
source: Login screen
mk: Екран за најава

# #10034
source: Settings - Profiles
mk: Поставки - Профили

# #10035
source: Reset
mk: Ресет

# #10037
source: Standard
mk: Вообичаено

# #10038
source: Advanced
mk: Напредно

# #10043
source: Help
mk: Помош

# #10131
source: Lock settings
mk: Заклучај ги поставките

# #10134
source: Favourites
mk: Омилено

# #10140
source: Add-on settings
mk: Поставки за додатки

# #10210
source: Looking for subtitles...
mk: Барање преводи...

# #10211
source: Looking for or caching subtitles...
mk: Барање или кеширање на преводи...

# #10212
source: terminating
mk: прекинување

# #10213
source: buffering
mk: предмеморирање

# #10214
source: Opening stream
mk: Отворање на записот

# #10500
source: Music/Playlist
mk: Музика/Список за репрод.

# #10501
source: Music/Files
mk: Музика/Датотеки

# #10502
source: Music/Library
mk: Музика/Библиотека

# #10503
source: Playlist editor
mk: Уредувач на список за репродукција

# #10504
source: Top 100 songs
mk: 100 најдобри песни

# #10505
source: Top 100 albums
mk: 100 најдобри албуми

# #10506
source: Programs
mk: Програми

# #10507
source: Configuration
mk: Конфигурација

# #10508
source: Weather forecast
mk: Временска прогноза

# #10509
source: Network gaming
mk: Мрежно играње

# #10510
source: Extensions
mk: Проширувања

# #10511
source: System info
mk: Податоци за системот

# #10516
source: Music - Library
mk: Музичка библиоте.

# #10517
source: Now Playing - Music
mk: Сегашна репродукција - Музика

# #10522
source: Now Playing - Videos
mk: Сегашна репродукција - Филм

# #10523
source: Album info
mk: Податоци за албумот

# #10524
source: Movie info
mk: Податоци за филмот

# #12001
source: Music/Info
mk: Музика/Податоци

# #12003
source: Videos/Info
mk: Филмови/Податоци

# #12004
source: Scripts/Info
mk: Скрипти/Податоци

# #12005
source: Fullscreen video
mk: Филм преку целиот екран

# #12009
source: Rebuild index...
mk: Реиндексирање...

# #12010
source: Return to music window
mk: Враќање на прозор со музиката

# #12011
source: Return to videos window
mk: Враќање на прозор со филмовите

# #12021
source: Start from beginning
mk: Почни од почеток

# #12022
source: Resume from %s
mk: Продолжи од %s

# #12320
source: c
mk: с

# #12321
source: Ok
mk: Во ред

# #12325
source: Locked! Enter code...
mk: Заклучено! Внесете кôд...

# #12326
source: Enter password
mk: Внесете лозинка

# #12327
source: Enter master code
mk: Внесете главен кôд

# #12328
source: Enter unlock code
mk: Внесете кôд за отклучување

# #12329
source: or press C to cancel
mk: или притиснете C за откажување

# #12330
source: Enter gamepad button combo and
mk: Внесете комбинација на тастери на управувач за игри

# #12331
source: press OK, or Back to cancel
mk: и притиснете ОК, или Назад за откажување

# #12332
source: Set lock
mk: Заклучи

# #12333
source: Unlock
mk: Отклучи

# #12334
source: Reset lock
mk: Поништи кôд

# #12335
source: Remove lock
mk: Тргни кôд

# #12337
source: Numeric password
mk: Нумеричка лозинка

# #12338
source: Gamepad button combo
mk: Комбинација на тастери за управувач за игри

# #12339
source: Full-text password
mk: Лозинка со сите знаци

# #12340
source: Enter new password
mk: Внесете нова лозинка

# #12341
source: Re-Enter new password
mk: Повторете внес на нове лозинка

# #12342
source: Incorrect password,
mk: Лозинката не е исправна,

# #12343
source: retries left
mk: обиди остануваат

# #12344
source: Passwords entered did not match.
mk: Внесените лозинки не се совпаѓаат.

# #12345
source: Access denied
mk: Пристап одбиен

# #12346
source: Password retry limit exceeded.
mk: Прекумерен број обиди за внес на лозинка.

# #12348
source: Item locked
mk: Ставката е заклучена

# #12349
source: Updating video library art
mk: Освежување на сликичките во видео библиотеката

# #12350
source: Processing %s
mk: Процецирање на %s

# #12351
source: The art cache in your video library needs updating.
mk: Кешот за сликички во вашата видео библиотека треба да се освежи.

# #12352
source: No downloading is needed.
mk: Не е потребно симнување.

# #12353
source: Reactivate lock
mk: Одново активирај кôд

# #12354
source: Would you like to update it now?
mk: Дали сакате да го освежите сега?

# #12356
source: Change lock
mk: Промени кôд

# #12357
source: Source lock
mk: Потекло на кôд

# #12358
source: Password entry was blank. Try again.
mk: Лозинка не може да е празна. Обидете се повторно.

# #12360
source: Master lock
mk: Главен кôд

# #12362
source: Shutdown system if Master Lock retries exceeded
mk: Исклучи го системот ако Главниот кôд повеќе пати биде грешно внесен

# #12367
source: Master code is not valid
mk: Главен кôд не е исправен

# #12368
source: Please enter a valid master code
mk: Внесете исправен главен кôд

# #12373
source: Settings & file manager
mk: Поставки и упр. со датот.

# #12376
source: Set as default for all videos
mk: Постави како почетно за сите видеа

# #12377
source: This will reset any previously saved values
mk: Ова ќе ги поништи претходно сочуваните вредности

# #12378
source: Amount of time to display each image
mk: Време на прикажување на секоја слика

# #12379
source: Use pan and zoom effects
mk: Користи ефект на помрднувања и зголемувања

# #12383
source: 12 hour clock
mk: 12 часовен приказ на време

# #12384
source: 24 hour clock
mk: 24 часовен приказ на време

# #12385
source: Day/Month
mk: Ден, па месец

# #12386
source: Month/Day
mk: Месец, па ден

# #12390
source: System uptime
mk: Системот е активен

# #12391
source: Minutes
mk: минути

# #12392
source: Hours
mk: часови

# #12393
source: Days
mk: денови

# #12394
source: Total uptime
mk: Вкупно време

# #12395
source: Battery level
mk: Ниво на батерија

# #12600
source: Weather
mk: Временска прогноза

# #12900
source: Screensaver
mk: Чувар на екран

# #12901
source: Fullscreen OSD
mk: OSD преку цел екран

# #13000
source: System
mk: Систем

# #13001
source: Immediate HD spindown
mk: Непосредно HD ротирање

# #13002
source: Video only
mk: Само филмови

# #13003
source: - Delay
mk: - Каснење

# #13004
source: - Minimum file duration
mk: - Минимално траање на датотека

# #13005
source: Shutdown
mk: Исклучи

# #13008
source: Shutdown function
mk: Акција при исклучување

# #13009
source: Quit
mk: Излези

# #13010
source: Hibernate
mk: Хибернација

# #13011
source: Suspend
mk: Состојба на спење

# #13012
source: Exit
mk: Излези од

# #13013
source: Reboot
mk: Одново Стартувај

# #13015
source: Power button action
mk: Акција на копчето за вклучување

# #13016
source: Power off System
mk: Исклучи го системот

# #13020
source: Is another session active, perhaps over ssh?
mk: Да ли другата сесија е активна, можеби преку ssh?

# #13021
source: Mounted removable harddrive
mk: Поставен пренослив хард диск

# #13022
source: Unsafe device removal
mk: Небезбедно исклучување на уред

# #13023
source: Successfully removed device
mk: Успешно исклучен уред

# #13024
source: Joystick plugged
mk: Вклучен џојстик
