Repository: xbmc/xbmc
Catalog: language/Macedonian/strings.po
Languages: mk

# #13025
source: Joystick unplugged
mk: Исклучен џојстик

# #13050
source: Running low on battery
mk: Снемува батерија

# #13100
source: Flicker filter
mk: Flicker филтер

# #13101
source: Let driver choose (requires restart)
mk: Препушти избор на драјвер (неопходно стартување одново)

# #13105
source: Vertical blank sync
mk: Растојание на вертикална синхронизација

# #13106
source: Disabled
mk: Оневозможено

# #13107
source: Enabled during video playback
mk: Овозможено во тек на репродукција на филм

# #13108
source: Always enabled
mk: Секогаш овозможено

# #13109
source: Test & apply resolution
mk: Испробај и примени резолуција

# #13110
source: Save resolution?
mk: Сочувај резолуција?

# #13112
source: High quality upscaling
mk: Висок квалитет на уред

# #13113
source: Disabled
mk: Оневозможено

# #13114
source: Enabled for SD content
mk: Овозможена SD содржина

# #13115
source: Always enabled
mk: Секогаш овозможен

# #13116
source: Upscaling method
mk: Начин на зголемување

# #13130
source: Blank other displays
mk: Зацрни ги останатите екрани

# #13131
source: Disabled
mk: Оневозможено

# #13132
source: Blank displays
mk: Зацрни ги екраните

# #13140
source: Active connections detected!
mk: Откриени се активни врски!

# #13141
source: If you proceed, you might not be able to control Kodi
mk: Доколку продолжите понатаму, можеби нема да можете да управуате со Kodi

# #13142
source: any longer. Are you sure you want to stop the Event server?
mk: со апликацијата. Сигурно сакате да го сопрете Серверот за настани?

# #13144
source: Change Apple Remote mode?
mk: Измени Apple Remote режим?

# #13145
source: If you are currently using the Apple Remote to control
mk: Доколку во моментов користите Apple Remote да управувате со

# #13146
source: Kodi, changing this setting might affect your ability
mk: Kodi апликацијата, со промена на оваа поставака може да ја смените

# #13147
source: to continue controlling it. Do you want to proceed?
mk: можноста за контролирање со апликацијата. Продолжувате?

# #13159
source: Subnet mask
mk: Мрежна подмаска

# #13160
source: Gateway
mk: Мрежен премин

# #13161
source: Primary DNS
mk: Примарен DNS

# #13170
source: Never
mk: Никогаш

# #13171
source: Immediately
mk: Веднаш

# #13172
source: After %i secs
mk: По %i сек.

# #13173
source: HDD install date:
mk: Датум на поставување на HDD:

# #13200
source: Profiles
mk: Профили

# #13201
source: Delete profile '%s'?
mk: Да се избрише „%s“ профил?

# #13204
source: Last loaded profile:
mk: Последно вчитан профил

# #13205
source: Unknown
mk: Непознато

# #13206
source: Overwrite
mk: Препиши

# #13208
source: Alarm clock
mk: Будилник

# #13209
source: Alarm clock interval (in minutes)
mk: Интервал за повторна активација на будилник (во мин.)

# #13210
source: Started, alarm in %im
mk: Стартувано, аларм за %im

# #13211
source: Alarm!
mk: Аларм!

# #13212
source: Cancelled with %im%is left
mk: Откажано со %im%is преостанати

# #13249
source: Search for subtitles in RARs
mk: Пребарај преводи во RAR-овите

# #13250
source: Browse for subtitle...
mk: Побарај превод...

# #13251
source: Move item
mk: Премести ставка

# #13252
source: Move item here
mk: Премести ја ставката овде

# #13253
source: Cancel move
mk: Откажи преместување

# #13270
source: Hardware:
mk: Хардвер:

# #13271
source: CPU Usage:
mk: Искористеност на процесорот:

# #13274
source: Connected, but no DNS is available.
mk: Поврзано, но DNS не е достапен.

# #13275
source: Hard Disk
mk: Цврст диск

# #13277
source: Storage
mk: Складишта

# #13278
source: Default
mk: Подразбирачко

# #13279
source: Network
mk: Мрежа

# #13280
source: Video
mk: Филмови

# #13281
source: Hardware
mk: Хардвер

# #13283
source: Operating system:
mk: Оперативен систем:

# #13284
source: CPU speed:
mk: Брзина на процесор:

# #13286
source: Video encoder:
mk: Видео кодер:

# #13287
source: Screen resolution:
mk: Резолуција на екран:

# #13292
source: A/V cable:
mk: A/V кабел:

# #13294
source: DVD region:
mk: DVD регион:

# #13295
source: Internet:
mk: Интернет:

# #13296
source: Connected
mk: Поврзано

# #13297
source: Not connected. Check network settings.
mk: Не е поврзано. Проверите ги мрежните поставки.

# #13299
source: Target temperature
mk: Посакувана температура

# #13300
source: Fan speed
mk: Брзина на вентилатор

# #13301
source: Auto temperature control
mk: Автомат. контролирање на темпер.

# #13302
source: Fan speed override
mk: Наметни брзина на вентилатор

# #13303
source: Fonts
mk: Фонтови

# #13304
source: Enable flipping bi-directional strings
mk: Овозможи вртење на би-дирекциони стрингови

# #13305
source: Show RSS news feeds
mk: Прикажи RSS вести

# #13306
source: Show parent folder items
mk: Прикажи ставки од родителските папки

# #13307
source: Track naming template
mk: Шаблон на именувањеа на нумери

# #13308
source: Do you wish to reboot your system
mk: Сакате ли да наново да стртувате

# #13309
source: instead of just Kodi?
mk: цел систем, а не само Kodi апликација?

# #13310
source: Zoom effect
mk: Ефект на зголемување

# #13311
source: Float effect
mk: Ефект плутање

# #13312
source: Black bar reduction
mk: Смалување на црни ленти

# #13313
source: Restart
mk: Одново стартувај

# #13314
source: Crossfade between songs
mk: Фин премин (преклопување) помеѓу песни

# #13315
source: Regenerate thumbnails
mk: Обнавување на сликички

# #13316
source: Recursive thumbnails
mk: Рекурзивни сликички

# #13317
source: View slideshow
mk: Прикажи репродук. слајдови

# #13318
source: Recursive slideshow
mk: Рекурзивна репрод. слајдови

# #13320
source: Stereo
mk: Стерео

# #13321
source: Left only
mk: Само лев

# #13322
source: Right only
mk: Само десен

# #13323
source: Enable karaoke support
mk: Овозможи подршка за караоке

# #13324
source: Background transparency
mk: Провидност на позадина

# #13325
source: Foreground transparency
mk: Провидност на преден план

# #13326
source: A/V delay
mk: A/V каснење

# #13327
source: Karaoke
mk: Караоке

# #13328
source: %s not found
mk: %s не е пронајден

# #13329
source: Error opening %s
mk: Грешка во тек на отворање на %s

# #13330
source: Unable to load %s
mk: Не е можно вчитување на %s

# #13331
source: Error: Out of memory
mk: Грешка: Недоволно меморија

# #13332
source: Move up
mk: Премести горе

# #13333
source: Move down
mk: Премести доле

# #13334
source: Edit label
mk: Уреди натпис

# #13335
source: Make default
mk: Пост. подразбирач.

# #13336
source: Remove button
mk: Тргни тастер

# #13340
source: Leave as is
mk: Остави како што е

# #13341
source: Green
mk: Зелена

# #13342
source: Orange
mk: Портокалова

# #13343
source: Red
mk: Црвена

# #13344
source: Cycle
mk: Циклус

# #13345
source: Switch LED off on playback
mk: Исклучи LED за време репродукција

# #13346
source: Movie information
mk: Податоци за филмот

# #13347
source: Queue item
mk: Стави во ред за репрод.

# #13348
source: Search IMDb...
mk: Пребарај IMDb...

# #13349
source: Scan for new content
mk: Побарај нова садржина

# #13350
source: Current playlist
mk: Сегашен список на реп.

# #13351
source: Album information
mk: Податоци за албумот

# #13352
source: Scan item to library
mk: Анализ. ставка во библиотека

# #13353
source: Stop scanning
mk: Сопри анализирање

# #13354
source: Render method
mk: Начин на представување

# #13355
source: Low quality pixel shader
mk: Низок квалитет на сенчење на пиксели

# #13356
source: Hardware overlays
mk: Хардверски преклопувања

# #13357
source: High quality pixel shader
mk: Висок квалитет на сенчење на пиксели

# #13358
source: Play item
mk: Репродуцирај ставка

# #13359
source: Set artist thumb
mk: Постави сликичка на изведувач

# #13360
source: Automatically generate thumbnails
mk: Автоматски направи сликички

# #13361
source: Enable voice
mk: Овозможи глас

# #13375
source: Enable device
mk: Овозможи уред

# #13376
source: Volume
mk: Јачина на звук

# #13377
source: Default view mode
mk: Подразбирачки режим на приказ

# #13378
source: Default brightness
mk: Подразбирачка светлина

# #13379
source: Default contrast
mk: Подразбирачки контраст

# #13380
source: Default gamma
mk: Подразбирачки опсег на бои

# #13381
source: Resume video
mk: Продолжи филм

# #13382
source: Voice mask - Port 1
mk: Гласовна маска - Приклучок 1

# #13383
source: Voice mask - Port 2
mk: Гласовна маска - Приклучок 2

# #13384
source: Voice mask - Port 3
mk: Гласовна маска - Приклучок 3

# #13385
source: Voice mask - Port 4
mk: Гласовна маска - Приклучок 4

# #13386
source: Use time based seeking
mk: Користи пребарување врз база на време

# #13387
source: Track naming template - right
mk: Шаблон на именувања на нумери - десно

# #13388
source: Preset
mk: Однапред зададено

# #13391
source: Eject/Load
mk: Исфрли/Уфрли

# #13393
source: Calculate size
mk: Израчунај големина

# #13394
source: Calculating folder size
mk: Пресметување на големина на папка

# #13395
source: Video settings
mk: Поставки на филмот

# #13396
source: Audio and subtitle settings
mk: Поставки на звук и превод

# #13397
source: Enable subtitles
mk: Овозможи преводи

# #13398
source: Shortcuts
mk: Кратенки

# #13399
source: Ignore articles when sorting (e.g. "the")
mk: Игнорирај ставки за време на сложување (нпр. „the“ и сл.)

# #13400
source: Crossfade between songs on the same album
mk: Фин премин помеѓу песни од ист албум

# #13401
source: Browse for %s
mk: Побарај %s

# #13402
source: Show track position
mk: Покажи позиција на нумера

# #13403
source: Clear default
mk: Исчисти подразбирачко

# #13404
source: Resume
mk: Продолжи

# #13405
source: Get thumb
mk: Превземи омот

# #13406
source: Picture information
mk: Податоци за слика

# #13407
source: %s presets
mk: %s однап. зад. поставки

# #13408
source: (IMDb user rating)
mk: (IMDb оцена на корисник)

# #13409
source: Top 250
mk: Најдобри 250

# #13410
source: Tune in on Last.fm
mk: Намести на Last.fm

# #13411
source: Minimum fan speed
mk: Минимална брзина на вентилатор

# #13412
source: Play from here
mk: Пушти од тука

# #13413
source: Downloading
mk: Превземање

# #13414
source: Include artists who appear only on compilations
mk: Вклучи изведувачи кои се појавуваат само на компилации

# #13415
source: Render method
mk: Начин на представување

# #13416
source: Auto detect
mk: Автом. откриј

# #13417
source: Basic shaders (ARB)
mk: Основни сенчења (ARB)

# #13418
source: Advanced shaders (GLSL)
mk: Напредни сенчења (GLSL)

# #13419
source: Software
mk: Софтвер

# #13420
source: Remove safely
mk: Безбедно тргни

# #13422
source: Start slideshow here
mk: Покрени реп. слајд. одовде

# #13423
source: Remember for this path
mk: Запомни ја оваа патека

# #13424
source: Use pixel buffer objects
mk: Користи пикселно предмеморирање на објекти

# #13425
source: Allow hardware acceleration (VDPAU)
mk: Дозволи хардверска акцелерација (VDPAU)

# #13426
source: Allow hardware acceleration (VAAPI)
mk: Дозволи хардверска акцелерација (VAAPI)

# #13427
source: Allow hardware acceleration (DXVA2)
mk: Дозволи хардверска акцелерација (DXVA2)

# #13428
source: Allow hardware acceleration (CrystalHD)
mk: Дозволи хардверска акцелерација (CrystalHD)

# #13429
source: Allow hardware acceleration (VDADecoder)
mk: Дозволи хардверска акцелерација (CrystalHD)

# #13430
source: Allow hardware acceleration (OpenMax)
mk: Дозволи хардверска акцелерација (CrystalHD)

# #13432
source: Allow hardware acceleration (VideoToolbox)
mk: Дозволи хардверска акцелерација (VideoToolbox)

# #13433
source: Play the next video automatically
mk: Пушти го автоматски следното видео

# #13434
source: Play only this
mk: пушти го само ова

# #13435
source: Enable HQ Scalers for scalings above
mk: Вклучи ги Високо квалитетни зголемувачи за горенаведените зголемувачи

# #13455
source: Software
mk: Софтвер

# #13500
source: A/V sync method
mk: A/V начин на синхрон.

# #13501
source: Audio clock
mk: Часовник на звукот

# #13502
source: Video clock (Drop/Dupe audio)
mk: Часовник на филмот (Drop/Dupe звук)

# #13503
source: Video clock (Resample audio)
mk: Часовник на филмот (Понов. одб. звук)

# #13505
source: Resample quality
mk: Квалитет понов. одб.

# #13506
source: Low(fast)
mk: Низок (брзо)

# #13507
source: Medium
mk: Средно

# #13508
source: High
mk: висок

# #13509
source: Really high(slow!)
mk: Навистина висок (споро!)

# #13510
source: Sync playback to display
mk: Синхронизирај репродукција према приказ

# #13511
source: Choose art
mk: одбери сликички

# #13512
source: Current art
mk: моментални сликички

# #13513
source: Remote art
mk: симнати сликички

# #13514
source: Local art
mk: локални сликички

# #13515
source: No art
mk: нема сликички

# #13516
source: Add art
mk: Додади слики

# #13550
source: Pause during refresh rate change
mk: Паузирај за време на промена на степенот на освежување

# #13551
source: Off
mk: Искл.

# #13552
source: %.1f Second
mk: %.1f Секунди

# #13553
source: %.1f Seconds
mk: %.1f Секунди

# #13600
source: Apple remote
mk: Apple далечински управувач

# #13602
source: Allow start of Kodi using the remote
mk: Дозволи стартување на Kodi аплик. со користење на далечинско

# #13603
source: Sequence delay time
mk: Време на каснење на секвенца

# #13610
source: Disabled
mk: Оневозможено

# #13611
source: Standard
mk: Вообичаено

# #13612
source: Universal Remote
mk: Универзален далечински

# #13613
source: Multi Remote (Harmony)
mk: Повеќекратен далечински (Сложно)

# #13620
source: Apple Remote Error
mk: Грешка на Apple далечинско управување

# #14000
source: Stack
mk: Постави на склад

# #14001
source: Unstack
mk: Тргни од склад

# #14003
source: Downloading playlist file...
mk: Превземање на датотеки списк. за реп...

# #14004
source: Downloading streams list...
mk: Превземање на список за проток на податоци...

# #14005
source: Parsing streams list...
mk: Разлучување (разлагање) на список за проток на податоци...

# #14006
source: Downloading streams list failed
mk: Не успешно превземање на список за проток на податоци

# #14007
source: Downloading playlist file failed
mk: Не успшно превземање на датотека со список за репродукција

# #14009
source: Games directory
mk: Каталог на игри

# #14010
source: Auto switch to thumbs based on
mk: Автом. префрли на сликички базирано врз

# #14011
source: Enable auto switching to thumbs view
mk: Овозможи автоматско префрлување на приказ на омот

# #14012
source: - Use large icons
mk: - Користи големи икони

# #14013
source: - Switch based on
mk: - Префрлување базирано врз

# #14014
source: - Percentage
mk: - Процент

# #14015
source: No files and at least one thumb
mk: Без датотеки и барем една сликичка

# #14016
source: At least one file and thumb
mk: Барем една датотека и сликичка

# #14017
source: Percentage of thumbs
mk: Процент на сликичка

# #14018
source: View options
mk: Прикажи опции

# #14019
source: Change area code 1
mk: Смени кôд на подрачје 1

# #14020
source: Change area code 2
mk: Смени кôд на подрачје 2

# #14021
source: Change area code 3
mk: Смени кôд на подрачје 3

# #14022
source: Library
mk: Библиотека

# #14023
source: No TV
mk: Без TV приемник

# #14024
source: Enter the nearest large town
mk: Внесете најблзок поголем град

# #14026
source: Video cache - DVD-ROM
mk: Видео кеш - DVD-ROM

# #14030
source: Audio cache - DVD-ROM
mk: Кеш на звук - DVD-ROM

# #14034
source: DVD cache - DVD-ROM
mk: DVD кеш - DVD-ROM

# #14035
source: Local Network
mk: Локална мрежа

# #14036
source: Services
mk: Избор на сервис

# #14038
source: Network settings changed
mk: Променети се мрежни поставки

# #14039
source: Kodi requires to restart to change your
mk: Kodi треба одново да се покрене поради промени

# #14040
source: network setup. Would you like to restart now?
mk: на мрежни поставки. Сакате ли веднашодново покренување?

# #14041
source: Internet connection bandwidth limitation
mk: Дополнителна обработка

# #14043
source: - Shutdown while playing
mk: Исклучи додека се репродуцира

# #14044
source: %i min
mk: %i мин.

# #14045
source: %i sec
mk: %i сек.

# #14051
source: Time format
mk: Приказ на време

# #14052
source: Date format
mk: Приказ на датум

# #14053
source: GUI filters
mk: GUI филтери

# #14055
source: Use background scanning
mk: Користи анализирање во позадина

# #14056
source: Stop scan
mk: Сопри анализирање

# #14057
source: Not possible while scanning for media info
mk: Не е можно додека е во тек анализирање на податоци за медиум

# #14058
source: Film grain effect
mk: Зрнест ефект на приказ

# #14059
source: Search for thumbnails on remote shares
mk: Побарај сликички на споделени локации

# #14060
source: Unknown type cache - Internet
mk: Непознат вид на кеш - Интернет

# #14061
source: Auto
mk: Автом.

# #14062
source: Enter username for
mk: Внесете корисничко име за

# #14063
source: Date & time
mk: Датум и време

# #14064
source: Set date
mk: Постави датум

# #14065
source: Set time
mk: Постави време

# #14066
source: Enter the time in 24 hour HH:MM format
mk: Внесете време во облик на 24 часа; ЧЧ:ММ

# #14067
source: Enter the date in DD/MM/YYYY format
mk: Внесете датум во облик ДД/ММ/ГГГГ

# #14068
source: Enter the IP address
mk: Внесете IP адреса

# #14069
source: Apply these settings now?
mk: Веднаш применете ги поставките

# #14070
source: Apply changes now
mk: Веднаш применете ги промените

# #14071
source: Allow file renaming and deletion
mk: Дозволи преименување и бришење на датотеки

# #14074
source: Set timezone
mk: Постави временска зона

# #14075
source: Use daylight saving time
mk: Користи летно сметање на време

# #14076
source: Add to favourites
mk: Додади во омилено

# #14077
source: Remove from favourites
mk: Отстрани од омилено

# #14078
source: Colours
mk: Боји

# #14079
source: Timezone country
mk: Земја на временска зона

# #14080
source: Timezone
mk: Временска зона

# #14081
source: File lists
mk: Списоци на датотеки

# #14082
source: Show EXIF picture information
mk: Прикажи EXIF спецификација на слика

# #14083
source: Use a fullscreen window rather than true fullscreen
mk: Подобро користи приказ на цел екран во прозор

# #14084
source: Queue songs on selection
mk: Стави ја песната во ред за време на избор

# #14086
source: Playback
mk: Репродукција

# #14087
source: DVDs
mk: DVD-ња

# #14088
source: Play DVDs automatically
mk: Автоматски репродуцирај DVD-ња

# #14089
source: Font to use for text subtitles
mk: Изглед на букви за преводи

# #14090
source: International
mk: Меѓународно

# #14091
source: Character set
mk: Собир на знаци

# #14092
source: Debugging
mk: Барање грешки

# #14093
source: Security
mk: Безбедност

# #14094
source: Input devices
mk: Влезни уреди

# #14095
source: Power saving
mk: Заштеда на енергија

# #14096
source: Rip
mk: Рип

# #14097
source: Audio CD Insert Action
mk: Внесување на аудио CD

# #14098
source: Play
mk: Репродуцирај

# #14099
source: Eject disc when CD ripping is complete
mk: Исфрли го дискот кога рипувањето на CD-то ќе заврши

# #14100
source: Stop ripping CD
mk: Прекини со симнувањето на песни од ЦД

# #15015
source: Remove
mk: Отстрани

# #15016
source: Games
mk: Игри

# #15019
source: Add
mk: Додади

# #15052
source: Password
mk: Лозинка

# #15100
source: Library
mk: Библиотека

# #15101
source: Database
mk: База на податоци

# #15102
source: * All albums
mk: * Сите албуми

# #15103
source: * All artists
mk: * Сите изведувачи

# #15104
source: * All songs
mk: * Сите песни

# #15105
source: * All genres
mk: * Сите жанрови

# #15107
source: Buffering...
mk: Предмеморирање...

# #15108
source: Navigation sounds
mk: Навигациони звуци

# #15109
source: Skin default
mk: Подразбирачка маска

# #15111
source: Theme
mk: Тема

# #15112
source: Default theme
mk: Подразбирачка тема

# #15207
source: Connected
mk: Поврзано

# #15208
source: Not connected
mk: Не е поврзано

# #15213
source: Play using...
mk: Репродуцирај со помош на...

# #15215
source: Hide file names in thumbs view
mk: Сокриј ги имињата на датотеките за време на приказ на омоти

# #15216
source: Play in party mode
mk: Репродуцирај во режим на журка

# #15300
source: Path not found or invalid
mk: Патека не е пронајдена или е неважечка

# #15301
source: Could not connect to network server
mk: Не е можно поврзување са мрежен сервер

# #15302
source: No servers found
mk: Ни еден сервер не е пронајден

# #15303
source: Workgroup not found
mk: Работна група не е пронајдена

# #15310
source: Opening multi-path source
mk: Отворање на извори од вашата патека

# #15311
source: Path:
mk: Патека:

# #16000
source: General
mk: Општо

# #16002
source: Internet lookup
mk: Пребарување на интернет

# #16003
source: Player
mk: Уред за репродукција

# #16004
source: Play media from disc
mk: Репродуцирај медиум од диск

# #16008
source: Enter new title
mk: Внесете нов наслов

# #16009
source: Enter the movie name
mk: Внесите име на филм

# #16010
source: Enter the profile name
mk: Внесете име на профил

# #16011
source: Enter the album name
mk: Внесите име на албум

# #16012
source: Enter the playlist name
mk: Внесите име на список за реп.

# #16013
source: Enter new filename
mk: Внесете ново име на датотека

# #16014
source: Enter folder name
mk: Внесите име на папка

# #16015
source: Enter directory
mk: Внесете папка

# #16016
source: Available options: %A, %T, %N, %B, %D, %G, %Y, %F, %S
mk: Доступни опции: %A, %T, %N, %B, %D, %G, %Y, %F, %S

# #16017
source: Enter search string
mk: Внесите збор за пребарување

# #16018
source: None
mk: Ништо

# #16019
source: Auto select
mk: Автоматски избор

# #16020
source: De-interlace
mk: Отстрани преплетување на слики

# #16022
source: Bob (inverted)
mk: Bob (обратно)

# #16024
source: Cancelling...
mk: Откажување...

# #16025
source: Enter the artist name
mk: Внеси име на изведувач

# #16026
source: Playback failed
mk: Неуспешна репродукција

# #16027
source: One or more items failed to play.
mk: Една или повеќе ставки не е можно да се репродуцираат.

# #16028
source: Enter value
mk: Внесете вредност

# #16029
source: Check the log file for details.
mk: Проверете ја датотеката за евиденција за детали.

# #16030
source: Party mode aborted.
mk: Покренат режим на журка.

# #16031
source: No matching songs in the library.
mk: Нема совпаѓачки песни во библиотеката.

# #16033
source: Could not open database.
mk: Не е можно отворање на база на податоци.

# #16034
source: Could not get songs from database.
mk: Не е можно превземање песни од база на податоци.

# #16035
source: Party mode playlist
mk: Список за реп. во режим на журка

# #16039
source: Off
mk: Искл.

# #16040
source: Auto
mk: Автом.

# #16041
source: On
mk: Вкл.

# #16100
source: All Videos
mk: Сите филмови

# #16101
source: Unwatched
mk: неодгледани

# #16102
source: Watched
mk: одгледани

# #16103
source: Mark as watched
mk: Обележи како одгледано

# #16104
source: Mark as unwatched
mk: Обележи као неодгледано

# #16105
source: Edit title
mk: Уреди наслов

# #16200
source: Operation was aborted
mk: Операција е прекината

# #16201
source: Copy failed
mk: Копирање не успеало

# #16202
source: Failed to copy at least one file
mk: Не успеало копирање барем на една датотека

# #16203
source: Move failed
mk: Преместување не успеало

# #16204
source: Failed to move at least one file
mk: Не успеало преместување барем на една датотека

# #16205
source: Delete failed
mk: Бришање не успеало

# #16206
source: Failed to delete at least one file
mk: Не успеало бришење барем на една датотека

# #16300
source: Video scaling method
mk: Режим на видео размер

# #16301
source: Nearest neighbour
mk: Најблизок комшија

# #16307
source: Bicubic (software)
mk: Bicubic (софтверски)

# #16308
source: Lanczos (software)
mk: Lanczos (софтверски)

# #16309
source: Sinc (software)
mk: Sinc (софтверски)

# #16310
source: Temporal
mk: Временски

# #16311
source: Temporal/Spatial
mk: Временски/просторни

# #16312
source: (VDPAU)Noise Reduction
mk: (VDPAU) Смалување на шум

# #16313
source: (VDPAU)Sharpness
mk: (VDPAU) Оштрина
