Repository: xbmc/xbmc
Catalog: language/Macedonian/strings.po
Languages: mk

# #0
source: Programs
mk: Програми

# #1
source: Pictures
mk: Слики

# #2
source: Music
mk: Музика

# #3
source: Videos
mk: Филмови

# #4
source: TV-Guide
mk: ТВ Водич

# #5
source: Settings
mk: Поставки

# #7
source: File manager
mk: Упр. со датот.

# #8
source: Weather
mk: Време

# #9
source: Kodi media center
mk: Kodi медија центар

# #11
source: Monday
mk: Понеделник

# #12
source: Tuesday
mk: Вторник

# #13
source: Wednesday
mk: Среда

# #14
source: Thursday
mk: Четврток

# #15
source: Friday
mk: Петок

# #16
source: Saturday
mk: Сабота

# #17
source: Sunday
mk: Недела

# #21
source: January
mk: јануари

# #22
source: February
mk: вефруари

# #23
source: March
mk: март

# #24
source: April
mk: април

# #25
source: May
mk: мај

# #26
source: June
mk: јуни

# #27
source: July
mk: јули

# #28
source: August
mk: август

# #29
source: September
mk: септември

# #30
source: October
mk: октомври

# #31
source: November
mk: ноември

# #32
source: December
mk: декември

# #41
source: Mon
mk: пон

# #42
source: Tue
mk: вто

# #43
source: Wed
mk: сре

# #44
source: Thu
mk: чет

# #45
source: Fri
mk: пет

# #46
source: Sat
mk: саб

# #47
source: Sun
mk: нед

# #51
source: Jan
mk: јан

# #52
source: Feb
mk: феб

# #53
source: Mar
mk: мар

# #54
source: Apr
mk: апр

# #55
source: May
mk: мај

# #56
source: Jun
mk: јун

# #57
source: Jul
mk: јул

# #58
source: Aug
mk: авг

# #59
source: Sep
mk: сеп

# #60
source: Oct
mk: окт

# #61
source: Nov
mk: ное

# #62
source: Dec
mk: дек

# #71
source: N
mk: С

# #72
source: NNE
mk: ССИ

# #73
source: NE
mk: СИ

# #74
source: ENE
mk: ИСИ

# #75
source: E
mk: И

# #76
source: ESE
mk: ИЈИ

# #77
source: SE
mk: ЈИ

# #78
source: SSE
mk: ЈЈИ

# #79
source: S
mk: Ј

# #80
source: SSW
mk: ЈЈЗ

# #81
source: SW
mk: ЈЗ

# #82
source: WSW
mk: ЗЈЗ

# #83
source: W
mk: З

# #84
source: WNW
mk: ЗСЗ

# #85
source: NW
mk: СЗ

# #86
source: NNW
mk: ССЗ

# #87
source: VAR
mk: ВАР

# #88
source: South
mk: Југ

# #89
source: North
mk: Север

# #90
source: West
mk: Запад

# #91
source: East
mk: Исток

# #92
source: Variable
mk: Променлив

# #98
source: View: Auto
mk: Приказ: Автом.

# #99
source: View: Auto big
mk: Приказ: Автом. големо

# #100
source: View: Icons
mk: Приказ: Икони

# #101
source: View: List
mk: Приказ: Список

# #102
source: Scan
mk: Анализирај

# #103
source: Sort by: Name
mk: Подреди по: Име

# #104
source: Sort by: Date
mk: Подреди по: Датум

# #105
source: Sort by: Size
mk: Подреди по: Голе.

# #106
source: No
mk: Не

# #107
source: Yes
mk: Да

# #108
source: Slideshow
mk: Слајдшоу

# #109
source: Create thumbs
mk: Направи омоти

# #110
source: Create thumbnails
mk: Направи сликички

# #111
source: Shortcuts
mk: Кратенки

# #112
source: Paused
mk: Паузирано

# #113
source: Update failed
mk: Неуспешно ажурирање

# #114
source: Installation failed
mk: Неуспешна инсталација

# #115
source: Copy
mk: Копирај

# #116
source: Move
mk: Премести

# #117
source: Delete
mk: Избриши

# #118
source: Rename
mk: Преименувај

# #119
source: New folder
mk: Нова папка

# #120
source: Confirm file copy
mk: Потврди копирање

# #121
source: Confirm file move
mk: Потврди преместување

# #123
source: Copy these files?
mk: Копирање на овие датотеки?

# #124
source: Move these files?
mk: Преместување на овие датотеки?

# #125
source: Delete these files? - Deleting files cannot be undone!
mk: Бришење на овие датотеки? - По бришење, датотеки неможе да се вратат!

# #126
source: Status
mk: Состојба

# #127
source: Objects
mk: Објекти

# #128
source: General
mk: Општо

# #129
source: Slideshow
mk: Проекција на слајдови

# #130
source: System info
mk: Податоци за систем

# #131
source: Display
mk: Приказ

# #132
source: Albums
mk: Албуми

# #133
source: Artists
mk: Изведувачи

# #134
source: Songs
mk: Нумери

# #135
source: Genres
mk: Жанрови

# #136
source: Playlists
mk: Списоци за репро.

# #137
source: Search
mk: Пребарај

# #138
source: System Information
mk: Податоци за систем

# #139
source: Temperatures:
mk: Температури:

# #140
source: CPU:
mk: Централен процесор:

# #141
source: GPU:
mk: Графички процесор:

# #142
source: Time:
mk: Време:

# #143
source: Current:
mk: Сегашно:

# #144
source: Build:
mk: Издание:

# #145
source: Network:
mk: Мрежа:

# #146
source: Type:
mk: Вид:

# #147
source: Static
mk: Статички

# #149
source: MAC address
mk: MAC адреса

# #150
source: IP address
mk: IP адреса

# #151
source: Link:
mk: Врска:

# #152
source: Half duplex
mk: Полу дуплекс

# #153
source: Full duplex
mk: Полн дуплекс

# #154
source: Storage
mk: Складишта

# #155
source: Drive
mk: Уред

# #156
source: Free
mk: Слободно

# #157
source: Video
mk: Видео

# #158
source: Free memory
mk: Слободна меморија

# #159
source: No link
mk: не е воспоставена

# #160
source: Free
mk: слободно

# #161
source: Unavailable
mk: Недостапно

# #162
source: Tray open
mk: Врата отворена

# #163
source: Reading
mk: Читање

# #164
source: No disc
mk: Диск не е вметнат

# #165
source: Disc present
mk: Дискот е препознаен

# #166
source: Skin
mk: Маска

# #167
source: Cancel file operations
mk: Откажи ги операциите со датотеки

# #169
source: Resolution
mk: Резолуција

# #170
source: Adjust display refresh rate to match video
mk: Прилагоди брзина на освежување кон мониторот

# #172
source: Release date
mk: Датум на издавање

# #173
source: Display 4:3 videos as
mk: Прикажи 4:3 видео материјал како

# #175
source: Moods
mk: Расположенија

# #176
source: Styles
mk: Стилови

# #179
source: Song
mk: Песна

# #180
source: Duration
mk: Траење

# #181
source: Select album
mk: Изаберете албум

# #182
source: Tracks
mk: Нумери

# #183
source: Review
mk: Преглед

# #184
source: Refresh
mk: Освежи

# #185
source: Searching album
mk: Пребарување албуми

# #186
source: OK
mk: Во ред

# #187
source: No albums found!
mk: Ни еден албум не е пронајден!

# #188
source: Select all
mk: Избери се

# #189
source: Scanning media info
mk: Анализирање на информации

# #190
source: Save
mk: Сочувај

# #191
source: Shuffle
mk: Случаен избор

# #192
source: Clear
mk: Поништи

# #193
source: Scan
mk: Анализирај

# #194
source: Searching...
mk: Пребарување...

# #195
source: No info found!
mk: Информаци не се најдени!

# #196
source: Select movie:
mk: Изберете филм:

# #197
source: Querying %s info
mk: Барање податоци за %s

# #198
source: Loading movie details
mk: Вчитување податоци за филмот

# #199
source: Web interface
mk: Веб интерфејс

# #203
source: Plot outline
mk: Краток опис

# #205
source: Votes
mk: Гласови

# #206
source: Cast
mk: Улоги

# #207
source: Plot
mk: Опис

# #208
source: Play
mk: Репродуцирај

# #209
source: Next
mk: Следно

# #210
source: Previous
mk: Претходно

# #213
source: Calibrate user interface...
mk: Прилагодете корисничко опкружување...

# #214
source: Video calibration...
mk: Калибрација на слика...

# #215
source: Soften
mk: Омекнато

# #216
source: Zoom amount
mk: Ниво на зголемување

# #217
source: Pixel ratio
mk: Однос на пикселизација

# #218
source: DVD drive
mk: DVD уред

# #219
source: Please insert disc
mk: Молам, вметнете диск

# #220
source: Remote share
mk: Далечинско делење

# #221
source: Network is not connected
mk: Мрежа нее поврзана

# #222
source: Cancel
mk: Откажи

# #224
source: Speed
mk: Брзина

# #225
source: Vertical Shift
mk: Вертикално поместување

# #226
source: Test patterns...
mk: Пробај шаблон...

# #227
source: Lookup audio CD track names from freedb.org
mk: Барај име на нумера, од музичко CD, на freedb.org

# #228
source: Shuffle playlist on load
mk: Измешај список при вчитување

# #229
source: HDD spindown time
mk: Време на успорување на HDD

# #230
source: Video filters
mk: Видео филтери

# #231
source: None
mk: Ништо

# #232
source: Point
mk: Точка

# #233
source: Linear
mk: Линеарно

# #234
source: Anisotropic
mk: Анизотропија

# #237
source: Minification
mk: Намалување

# #238
source: Magnification
mk: Зголемување

# #239
source: Clear playlist on finish
mk: Поништи список по завршување

# #240
source: Display Mode
mk: Мод на дисплеј

# #241
source: Full Screen #%d
mk: Полн екран #%d

# #242
source: Windowed
mk: Во прозорец

# #243
source: Refresh Rate
mk: Освежување

# #244
source: Full screen
mk: Полн екран

# #245
source: Sizing: (%i,%i)->(%i,%i) (Zoom x%2.2f) AR:%2.2f:1 (Pixels: %2.2f:1) (VShift: %2.2f)
mk: Димензии: (%i,%i)->(%i,%i) (Zoom x%2.2f) AR:%2.2f:1 (Pixels: %2.2f:1) (VShift: %2.2f)

# #247
source: Scripts
mk: Скрипти

# #248
source: Language
mk: Јазик

# #249
source: Music
mk: Музика

# #251
source: Select destination directory
mk: Изаберете целна папка

# #253
source: Number of channels
mk: Број на канали

# #254
source: DTS capable receiver
mk: DTS способен приемник

# #256
source: Fetching CD information
mk: Превземање CD информации

# #257
source: Error
mk: Грешка

# #258
source: Enable tag reading
mk: Овозможи читање на ознаки

# #259
source: Opening
mk: Отворање

# #260
source: Shoutcast
mk: Интернет радио

# #261
source: Waiting for start...
mk: Чекање на започнување...

# #262
source: Scripts output
mk: Излезни скрипти

# #263
source: Allow control of Kodi via HTTP
mk: Дозволи контрола на Kodi апликација преку HTTP протокол

# #264
source: Record
mk: Сними

# #265
source: Stop Rec.
mk: Прекини сним.

# #266
source: Sort by: Track
mk: Подреди по: Нумера

# #267
source: Sort by: Time
mk: Подреди по: Време

# #268
source: Sort by: Title
mk: Подреди по: Наслов

# #269
source: Sort by: Artist
mk: Подреди по: Изведувач

# #270
source: Sort by: Album
mk: Подреди по: Албум

# #271
source: Top 100
mk: Најдобри 100

# #272
source: Top-Left overscan compensation
mk: Горна лева ивица на екран

# #273
source: Bottom-Right overscan compensation
mk: Долна десна ивица на екран

# #274
source: Subtitle positioning
mk: Позиционирање на титл

# #275
source: Pixel ratio adjustment
mk: Прилагодување на однос на страни

# #276
source: Adjust the arrow to change the amount of overscan
mk: Помрднувај ја стрелката за промена на големина на екран

# #277
source: Adjust the bar to change the subtitles position
mk: Помрднувај линија за промена на позиција на титлови

# #278
source: Adjust the rectangle so it is perfectly square
mk: Обликувајте правоаголник тако да добиете совршени квадрат

# #279
source: Unable to load settings
mk: Нее можно вчитување поставки

# #280
source: Using default settings
mk: Користење подразбирачки поставки

# #281
source: Please check the XML files
mk: Проверите ги XML датотеките

# #282
source: Found %i items
mk: Пронајдено %i ставки

# #283
source: Search results
mk: Резултати на пребарување

# #284
source: No results found
mk: Без резултати

# #285
source: Preferred audio language
mk: Посакуван јазик на аудио

# #286
source: Preferred subtitle language
mk: Посакуван јазик на превод

# #287
source: Subtitles
mk: Титлови

# #288
source: Font
mk: Букви

# #289
source: Size
mk: Голем.

# #290
source: Dynamic range compression
mk: Динамички опсег на компресија

# #291
source: Video
mk: Видео

# #292
source: Audio
mk: Звук

# #293
source: Browse for subtitles
mk: Побарај титлови

# #294
source: Create bookmark
mk: Направи обележ.

# #296
source: Clear bookmarks
mk: Поништи обележ.

# #297
source: Audio offset
mk: Помрдн. звук во време

# #298
source: Bookmarks
mk: Обележувачи

# #300
source: MP1 capable receiver
mk: MP1 способен приемник

# #303
source: Delay
mk: Каснење

# #304
source: Language
mk: Јазик

# #305
source: Enabled
mk: Овозможено

# #306
source: Non-interleaved
mk: Нестандардни

# #308
source: Original stream's language
mk: Оригинален јазик

# #312
source: (0=auto)
mk: (0=аутом.)

# #313
source: Cleaning database
mk: Чистење база

# #314
source: Preparing...
mk: Припремање...

# #315
source: Database error
mk: Грешка на база на податоци

# #316
source: Searching songs...
mk: Пребарување песни...

# #317
source: Cleaned database successfully
mk: База на податоци успешно исчистена

# #318
source: Cleaning songs...
mk: Чистење песни...

# #319
source: Error cleaning songs
mk: Грешка при чистење песни

# #320
source: Cleaning artists...
mk: Чистење изведувачи...

# #321
source: Error cleaning artists
mk: Грешка при чистење изведувачи

# #322
source: Cleaning genres...
mk: Чистење на жанрови...

# #323
source: Error cleaning genres
mk: Грешка при чистење жанрови

# #324
source: Cleaning paths...
mk: Чистење патеки...

# #325
source: Error cleaning paths
mk: Грешка при чистење патеки

# #326
source: Cleaning albums...
mk: Чистење албуми...

# #327
source: Error cleaning albums
mk: Грешка при чистење албуми

# #328
source: Writing changes...
mk: Впишување промени...

# #329
source: Error writing changes
mk: Грешка при впишување промени

# #330
source: This may take some time...
mk: Ова може да потрае некое време...

# #331
source: Compressing database...
mk: Компримирање на база на податоци...

# #332
source: Error compressing database
mk: Грешка при компримирање на базе на податоци

# #333
source: Do you want to clean the library?
mk: Сакате да ја исчистите библиотеката?

# #334
source: Clean library...
mk: Чистење на библиотека...

# #335
source: Start
mk: Стартувај

# #336
source: Framerate conversion
mk: Конверзија на брзина на слики

# #338
source: Fixed
mk: Фиксирано

# #340
source: Various artists
mk: Различни изведувачи

# #341
source: Play disc
mk: Репродуцирај диск

# #342
source: Movies
mk: Филмови

# #343
source: Adjust framerate
mk: Прилагоди ја брзината на сликите

# #344
source: Actors
mk: Глумци

# #345
source: Year
mk: Година

# #347
source: DTS-HD capable receiver
mk: DTS-HD способен приемник

# #350
source: Programs
mk: Програми

# #351
source: Off
mk: Искл.

# #352
source: Dim
mk: Затемни

# #353
source: Black
mk: Црно

# #354
source: Matrix trails
mk: Matrix траги

# #355
source: Screensaver time
mk: Време на старт на чувар на екран

# #356
source: Screensaver mode
mk: Режим на чувар на екран

# #357
source: Shutdown function timer
mk: Функционирање на тајмер на исклучување

# #358
source: All albums
mk: Сите албуми

# #359
source: Recently added albums
mk: Неодамна додадени албуми

# #360
source: Screensaver
mk: Чувар на екран

# #361
source: R. Slideshow
mk: Случајни слајдови

# #362
source: Screensaver dim level
mk: Ниво на затамнување на чувар на екран

# #363
source: Sort by: File
mk: Подреди по: Дато.

# #365
source: Sort by: Name
mk: Подреди по: Име

# #366
source: Sort by: Year
mk: Подреди по: Година

# #367
source: Sort by: Rating
mk: Подреди по: Популарност

# #369
source: Title
mk: Назив

# #370
source: Thunderstorms
mk: грмотевица

# #371
source: Partly
mk: делумно

# #372
source: Mostly
mk: воглавно

# #373
source: Sunny
mk: сончано

# #374
source: Cloudy
mk: облачно

# #375
source: Snow
mk: снег

# #376
source: Rain
mk: дожд

# #377
source: Light
mk: слаб(а)

# #378
source: AM
mk: наутро

# #379
source: PM
mk: попладне

# #380
source: Showers
mk: порој

# #381
source: Few
mk: неколку

# #382
source: Scattered
mk: местимично

# #383
source: Wind
mk: ветровито

# #384
source: Strong
mk: исклучително

# #385
source: Fair
mk: умерено

# #386
source: Clear
mk: ведро

# #387
source: Clouds
mk: облачно

# #388
source: Early
mk: ран

# #389
source: Shower
mk: пљусок

# #390
source: Flurries
mk: Снег

# #391
source: Low
mk: низок

# #392
source: Medium
mk: умерен

# #393
source: High
mk: висок

# #394
source: Fog
mk: магла

# #395
source: Haze
mk: измаглица

# #396
source: Select location
mk: Избор на локација

# #397
source: Refresh time
mk: Зачестеност на освежавање

# #398
source: Temperature units
mk: Единици за температура

# #399
source: Speed units
mk: Единици за брзина

# #400
source: Weather
mk: Време

# #401
source: Temp
mk: Темпер.

# #402
source: Feels like
mk: Како да е

# #403
source: UV index
mk: UV индекс

# #404
source: Wind
mk: Ветер

# #405
source: Dew point
mk: Точка на роса

# #406
source: Humidity
mk: Влажност

# #409
source: Defaults
mk: Подразбирачко

# #410
source: Accessing weather service
mk: Пристапување кон услуга на врем. прог.

# #411
source: Getting weather for:
mk: Превземање на прогноза за:

# #412
source: Unable to get weather data
mk: Нее можно превземање податоци за прогноза

# #413
source: Manual
mk: Рачно

# #414
source: No review for this album
mk: Не постои рецензија за овој албум

# #415
source: Downloading thumbnail...
mk: Превземање...

# #416
source: Not available
mk: Нее достапно

# #417
source: View: Big icons
mk: Приказ: Големи икони

# #418
source: Low
mk: Мин.

# #419
source: High
mk: Макс.

# #422
source: Delete album info
mk: Избриши податоци за албум

# #423
source: Delete CD information
mk: Избриши CD податоци

# #424
source: Select
mk: Избери

# #425
source: No album information found
mk: Не се пронајдени податоци за албумот

# #426
source: No CD information found
mk: Не се пронајдени CD податоци

# #427
source: Disc
mk: Диск

# #428
source: Insert correct CD/DVD
mk: Вметнете исправен CD/DVD

# #429
source: Please insert the following disc:
mk: Вметните следен CD/DVD

# #430
source: Sort by: DVD#
mk: Подреди по: DVD#

# #431
source: No cache
mk: Без кеш

# #432
source: Remove movie from library
mk: Тргни филм од библиотека

# #433
source: Really remove '%s'?
mk: Навистина сакате да го тргнете „%s“?

# #434
source: From %s at %i %s
mk: Од %s при %i %s

# #437
source: Removable disk
mk: Пренослив диск

# #438
source: Opening file
mk: Отворање датотека

# #439
source: Cache
mk: Кеш

# #442
source: Local network
mk: Локална мрежа

# #443
source: Internet
mk: Интернет

# #444
source: Video
mk: Видео

# #445
source: Audio
mk: Звук

# #447
source: Autorun media
mk: Автом. репрод. на медии

# #449
source: Enabled
mk: Овозможено

# #450
source: Columns
mk: Колони

# #451
source: Row 1 address
mk: 1. ред адреса

# #452
source: Row 2 address
mk: 2. ред адреса

# #453
source: Row 3 address
mk: 3. ред адреса

# #454
source: Row 4 address
mk: 4. ред адреса

# #455
source: Rows
mk: Редови

# #456
source: Mode
mk: Режим

# #457
source: Switch view
mk: Измени приказ

# #459
source: Subs
mk: Титлови

# #460
source: Audio stream
mk: Звучен запис

# #461
source: [active]
mk: [активно]

# #462
source: Subtitle
mk: Титл

# #463
source: Backlight
mk: Позадинско осветлување

# #464
source: Brightness
mk: Светлина

# #465
source: Contrast
mk: Контраст

# #466
source: Gamma
mk: Опсег на бои

# #467
source: Type
mk: Тип

# #468
source: Move the bar to change the OSD position
mk: Мрдајте ја линијата за да смените OSD позиција

# #469
source: OSD position
mk: OSD позиција

# #470
source: Credits
mk: Заслуги

# #474
source: Off
mk: Искл.

# #475
source: Music only
mk: Само музика

# #476
source: Music & video
mk: Музика и видео

# #477
source: Unable to load playlist
mk: Нее можно вчитување на список за репродукција

# #479
source: Skin & language
mk: Маска и јазик

# #480
source: Appearance
mk: Прикажување

# #481
source: Audio options
mk: Опции на звук

# #482
source: About Kodi
mk: За Kodi системот

# #485
source: Delete album
mk: Избриши албум

# #486
source: Repeat
mk: Повтори

# #487
source: Repeat one
mk: Повтори еднаш

# #488
source: Repeat folder
mk: Повтори папка

# #489
source: Play the next song automatically
mk: Автоматски репродуцирај ја следната песна

# #491
source: - Use big icons
mk: - Користи големи икони

# #492
source: Resize VobSubs
mk: Промени големина за VobSubs

# #493
source: Advanced options (Experts Only!)
mk: Напредни опции (само за стручњаци!)

# #494
source: Overall audio headroom
mk: Сеопфатен звучен слободен простор

# #495
source: Upsample videos to GUI resolution
mk: Поистовети видео и GUI резолуција

# #496
source: Calibration
mk: Калибрација

# #497
source: Show file extensions
mk: Прикажи видови датотеки

# #498
source: Sort by: Type
mk: Подреди по: Тип

# #499
source: Unable to connect to online lookup service
mk: Не е можно поврзување и пребарување на мрежни услуги

# #500
source: Downloading album information failed
mk: Неуспешно превземање податоци за албумот

# #501
source: Looking for album names...
mk: Барање назив на албум...

# #502
source: Open
mk: Отвори

# #503
source: Busy
mk: Зафатено

# #504
source: Empty
mk: Празно

# #505
source: Loading media info from files...
mk: Вчитување податоци за медиум од датотека...

# #507
source: Sort by: Usage
mk: Подреди по: Употреба

# #511
source: Enable video mode switching
mk: Овозможи промена на режим на видео

# #512
source: Startup window
mk: Почетен екран

# #513
source: Home window
mk: Почетен екран

# #514
source: Manual settings
mk: Рачни поставки

# #515
source: Genre
mk: Жанр

# #517
source: Recently played albums
mk: Неодамна репродуцирани албуми

# #518
source: Launch
mk: Стартувај

# #519
source: Launch in...
mk: Стартувај во...

# #521
source: Compilations
mk: Компилации

# #522
source: Remove source
mk: Отстрани извор

# #523
source: Switch media
mk: Промени медиум

# #524
source: Select playlist
mk: Изберете список за репродукција

# #525
source: New playlist...
mk: Нов список за репродукција...

# #526
source: Add to playlist
mk: Додади во список за репродукција

# #527
source: Manually add to library
mk: Рачно додадете во библиотека

# #528
source: Enter title
mk: Внесете наслов

# #529
source: Error: Duplicate title
mk: Грешка: Дуплиран наслов

# #530
source: Select genre
mk: Изаберете жанр

# #531
source: New genre
mk: Нов жанр

# #532
source: Manual addition
mk: Рачно додавање

# #533
source: Enter genre
mk: Внесите жанр

# #534
source: View: %s
mk: Приказ: %s

# #535
source: List
mk: Список

# #536
source: Icons
mk: Икони

# #537
source: Big list
mk: Гол. спис.

# #538
source: Big icons
mk: Гол. икони

# #539
source: Wide
mk: Широки

# #540
source: Big wide
mk: Многу широки

# #541
source: Album icons
mk: Икони на албум

# #542
source: DVD icons
mk: DVD икони

# #544
source: Media info
mk: Податоци за медиум

# #545
source: Audio output device
mk: Звучени излезен уред

# #546
source: Passthrough output device
mk: Пролазен излазен уред

# #547
source: No biography for this artist
mk: Овој изведувач нема пополнета биографија

# #548
source: Downmix multichannel audio to stereo
mk: Претвори повеќеканален звук во стерео

# #550
source: Sort by: %s
mk: Подреди по: %s

# #551
source: Name
mk: Име

# #552
source: Date
mk: Датум

# #553
source: Size
mk: Голем.

# #554
source: Track
mk: Нумера

# #555
source: Time
mk: Траење

# #556
source: Title
mk: Наслов

# #557
source: Artist
mk: Изведувач

# #558
source: Album
mk: Албум

# #559
source: Playlist
mk: Список за реп.

# #561
source: File
mk: Датоте.

# #562
source: Year
mk: Година

# #563
source: Rating
mk: Оценка

# #564
source: Type
mk: Тип

# #565
source: Usage
mk: Корис.

# #566
source: Album artist
mk: Изведувач на албумот

# #567
source: Play count
mk: Број на репродукции

# #568
source: Last played
mk: Последна репродукција

# #569
source: Comment
mk: Коментар

# #570
source: Date added
mk: Дата на додавање

# #571
source: Default
mk: Подразбирачко

# #572
source: Studio
mk: Студио

# #573
source: Path
mk: Патека

# #574
source: Country
mk: Држава

# #575
source: In progress
mk: Во прогрес

# #576
source: Times played
mk: Пати пуштена

# #577
source: Date Taken
mk: Снимено на датум

# #580
source: Sort direction
mk: Насока на сложување

# #581
source: Sort method
mk: Начин на сложување

# #582
source: View mode
mk: Режим на приказ

# #583
source: Remember views for different folders
mk: Запомни прикази на различни папки

# #584
source: Ascending
mk: Влезно

# #585
source: Descending
mk: Симнувачко

# #586
source: Edit playlist
mk: Уреди список за реп.

# #587
source: Filter
mk: Филтер

# #588
source: Cancel party mode
mk: Откажи режим на журка

# #589
source: Party mode
mk: Режим на журка

# #590
source: Random
mk: Случајно

# #591
source: Off
mk: Искл.

# #592
source: One
mk: Еднаш

# #593
source: All
mk: Се

# #594
source: Off
mk: Искл.

# #595
source: Repeat: Off
mk: Повтори: Искл.

# #596
source: Repeat: One
mk: Повтори: Еднаш

# #597
source: Repeat: All
mk: Повтори: Се
