Repository: xbmc/xbmc
Catalog: addons/weather.wunderground/resources/language/Hebrew/strings.po
Languages: he

# #32101
source: Location setup
he: הגדרות מיקום

# #32102
source: Advanced options
he: אפשרויות מתקדמות

# #32111
source: Location 1
he: מיקום ראשון

# #32112
source: Location 2
he: מיקום שני

# #32113
source: Location 3
he: מיקום שלישי

# #32114
source: Location 1 display name
he: שם תצוגה מיקום ראשון

# #32115
source: Location 2 display name
he: שם תצוגה מיקום שני

# #32116
source: Location 3 display name
he: שם תצוגה מיקום שלישי

# #32117
source: Location 1 id
he: מזהה מיקום ראשון

# #32118
source: Location 2 id
he: מזהה מיקום שני

# #32119
source: Location 3 id
he: מזהה מיקום שלישי

# #32120
source: Enable logging
he: אפשר יומן רישום

# #32121
source: Weekend
he: סוף שבוע

# #32122
source: Saturday/Sunday
he: שבת/ראשון

# #32123
source: Friday/Saturday
he: שישי/שבת

# #32124
source: Thursday/Friday
he: חמישי/שישי

# #32125
source: Map zoom level
he: רמת תקריב של מפה

# #32126
source: Animated map
he: מפה מונפשת

# #32501
source: New Moon
he: ירח חדש

# #32502
source: Waxing Crescent
he: לקראת ירח מלא

# #32503
source: First Quarter
he: רבעון ראשון

# #32504
source: Waxing Gibbous
he: ירח כמעט מלא

# #32505
source: Full Moon
he: ירח מלא

# #32506
source: Waning Gibbous
he: ירח גורע

# #32507
source: Last Quarter
he: רבע אחרון של ירח

# #32508
source: Waning Crescent
he: ירח כמעט גורע לגמרי

# #32510
source: Warning
he: אזהרה

# #32511
source: Watch
he: שעון

# #32512
source: Advisory
he: מומלץ

# #32513
source: Statement
he: תחזית

# #32514
source: Outlook
he: השקפה

# #32515
source: Forecast
he: תחזית

# #32516
source: Synopsis
he: תקציר מזג אויר
