Repository: xbmc/xbmc
Catalog: addons/metadata.artists.universal/resources/language/resource.language.*/strings.po
Languages: be_by, bs_ba, es_es, he_il, is_is, pl_pl, tr_tr, uk_ua, zh_tw

# Addon Summary
source: Universal Scraper for Artists
be_by: Універсальны сродак атрымання звестак пра выканаўцаў
bs_ba: Univerzalna strugalica za umjetnike
es_es: Scraper universal para artistas
he_il: Universa סקרייפר אמנים
is_is: Almenn skafa fyrir flytjendur
pl_pl: Uniwersalny ekstraktor informacji o wykonawcach muzycznych
tr_tr: Sanatçılar için Genel Bilgi Sağlayıcı
uk_ua: Універсальний екстрактор для виконавців
zh_tw: 通用演出者訊息搜括器

# Addon Description
source: This scraper collects information from the following supported sites: TheAudioDb.com, MusicBrainz, last.fm, and allmusic.com, while grabs artwork from: fanart.tv, htbackdrops.com, last.fm and allmusic.com. It can be set field by field that from which site you want that specific information.[CR][CR]The initial search is always done on MusicBrainz. In case allmusic link is not added on the MusicBrainz site fields from allmusic.com cannot be fetched (very easy to add those missing links though).
be_by: Гэты сканер збірае інфармацыю з наступных сайтаў: TheAudioDb.com, MusicBrainz, last.fm, allmusic.com, і бярэ вокладкі з: fanart.tv, htbackdrops.com, last.fm і allmusic.com. Кожнае поле можна наладзіць, каб атрымліваць інфармацыю з патрэбных вам крыніц.[CR][CR]Спачатку пошук выконваецца на MusicBrainz. Калі на сайце MusicBrainz не дададзеная спасылка на allmusic, то палі з allmusic.com не будуць запаўняцца (спасылку вельмі лёгка дадаць).
bs_ba: Ovaj strugač prikuplja informacije sa sljedećih podržanih stranica: TheAudioDb.com, MusicBrainz, last.fm i allmusic.com, dok umjetnička djela preuzima sa: fanart.tv, htbackdrops.com, last.fm i allmusic.com. Može se postaviti polje po polje sa koje stranice želite dobiti te specifične informacije.[CR][CR]Početna pretraga se uvijek vrši na MusicBrainz-u. U slučaju da link za allmusic nije dodan na stranicu MusicBrainz, polja sa allmusic.com ne mogu se preuzeti (vrlo je lako dodati te nedostajuće linkove).
es_es: Este scraper recopila información de las siguientes webs: TheAudioDb.com, MusicBrainz, last.fm y allmusic.com, mientras obtiene las imágenes de fanart.tv, htbackdrops.com, last.fm y allmusic.com. Permite especificar de qué web se quiere obtener la información específica. ⏎ ⏎ La búsqueda inicial se realiza siempre en MusicBrainz. En caso de que los enlaces a allmusic no estén añadidos en la web de MusicBrainz, no se podrán obtener los campos de información de este sitio (aunque es muy fácil añadir esos enlaces que faltan).
he_il: סקרייפר זה אוסף מידע מהתארים הנתמכים הבאים: TheAudioDb.com, MusicBrainz, last.fm, and allmusic.com, בעוד שמשיכת גרפיקה נעשית דרך: fanart.tv, htbackdrops.com, last.fm and allmusic.com. יש אפשרות להגדיר את זאת שדה אחר שדה מאיזה אתר ברצונך למשוך את המידע הספציפי.⏎ ⏎ החיפוש הפנימי נעשה תמיד דרך MusicBrainz. במקרה שקישור allmusic לא התווסף באתר MusicBrainz, השדות מאת allmusic.com אינן יכולות להימשך (למרות שזה מאוד קל להוסיף את הקישורים הריקים).
is_is: Þessi skafa safnar sama upplýsingum frá eftirfarandi studdum stöðum: TheAudioDb.com, MusicBrainz, last.fm, og allmusic.com, og á meðan nær hún í myndir frá: fanart.tv, htbackdrops.com, last.fm og allmusic.com. Hægt er að stilla reit fyrir reit hvaðan upplýsingarnar koma.[CR][CR]Leitin byrjar alltaf á MusicBrainz. Ef allmusic tenglar eru ekki á MusicBrainz veitunni, næst ekki í upplýsingarnar frá allmusic.com (mjög auðvelt að bæta tenglunum við samt).
pl_pl: Ten ekstraktor pobiera informacje z następujących stron: TheAudioDb.com, MusicBrainz, last.fm, and allmusic.com, a grafiki pobiera z: fanart.tv, htbackdrops.com, last.fm i allmusic.com. Dla każdego pola z informacjami można wybrać osobną stronę.[CR][CR]Początkowe wyszukiwanie jest zawsze wykonywane w serwisie MusicBrainz. Gdy wyszukiwanie nie jest wskazane na stronę MusicBrainz, następuje przeszukiwanie serwisu allmusic.com (brakujące linki można łatwo dodać później).
tr_tr: Bu bilgi sağlayıcı aşağıdaki desteklenen sitelerden bilgi toplar: TheAudioDb.com, MusicBrainz, last.fm ve allmusic.com; albüm resimlerini ise fanart.tv, htbackdrops.com, last.fm ve allmusic.com sitelerinden alır. Hangi siteden hangi bilgiyi almak istediğinizi ilgili alanda belirtebilirsiniz.[CR][CR]İlk arama her zaman MusicBrainz'de yapılır. allmusic bağlantısının MusicBrainz site alanlarına eklenmediği durumlarda allmusic.com'dan veri getirimi yapılamaz (eksik bağlantılar kolaylıkla eklenebilir).
uk_ua: Цей екстрактор витягує загальну інформацію з веб-сайтів TheAudioDb.com, MusicBrainz, last.fm та allmusic.com, а зображення — з fanart.tv, htbackdrops.com, last.fm та allmusic.com. Для кожного поля можна вказати з якого веб-сайту потрібно брати інформацію.[CR][CR]Початковий пошук завжди робиться на MusicBrainz. Якщо на веб-сайті MusicBrainz не додано посилання на allmusic, тоді поля з allmusic.com неможливо отримати (проте ці пропущені посилання дуже легко додати).
zh_tw: 本搜刮器支援從以下網站取得資訊：TheAudioDb.com、MusicBrainz、last.fm 和 allmusic.com，並從以下網站取得專輯圖片：fanart.tv、htbackdrops.com、last.fm 和 allmusic.com。您可以指定每一項內容的來源網站。[CR][CR]初始搜尋結果總是先從 MusicBrainz 取得，如果 MusicBrainz 網站未加入到 allmusic 的外部連結，則無法取得 allmusic.com 的資訊 (當然您能很輕易地加入遺失的連結)。

# #30000
source: Enable Artist Fanarts from HTBackdrops.com
be_by: Атрымліваць ілюстрацыі выканаўцаў з HTBackdrops.com
bs_ba: Omogućite umjetničke fanartove sa HTBacdrops.com
es_es: Activar fanarts de artista de HTBackdrops.com
he_il: הפעל פאנארט אמנים מ-HTBackdrops.com
is_is: Virkja aðdáendamyndir flytjenda frá HTBackdrops.com
pl_pl: Włącz fototapety wykonawcy z HTBackdrops.com
tr_tr: HTBackdrops.com Sanatçı Fanartlarını etkinleştir
uk_ua: Отримати обкладинки виконавця з HTBackdrops.com
zh_tw: 啟用 HTBackdrops.com 藝人美術圖

# #30001
source: Enable Artist Thumbs from allmusic.com
be_by: Атрымліваць мініяцюры выканаўцаў з allmusic.com
bs_ba: Omogućite sličice izvođača sa allmusic.com
es_es: Activar miniaturas de artista de allmusic.com
he_il: הפעלת תמונות אמנים מ־allmusic.com
is_is: Virkja smámyndir flytjenda frá allmusic.com
pl_pl: Włącz miniatury wykonawcy z allmusic.com
tr_tr: allmusic.com Sanatçı Küçük Resimlerini etkinleştir
uk_ua: Включити ескізи виконавця з allmusic.com
zh_tw: 啟用 allmusic.com 藝人縮圖

# #30002
source: Enable Artist Thumbs from last.fm
be_by: Атрымліваць мініяцюры выканаўцаў з last.fm
bs_ba: Omogući sličice izvođača sa last.fm-a
es_es: Activar miniaturas de artista de last.fm
he_il: הפעלת תמונות אמנים מ־last.fm
is_is: Virkja smámyndir flytjenda frá last.fm
pl_pl: Włącz miniatury wykonawcy z Last.fm
tr_tr: last.fm Sanatçı Küçük Resimlerini etkinleştir
uk_ua: Включити ескізи виконавця з last.fm
zh_tw: 啟用 last.fm 藝人縮圖

# #30003
source: Enable Artist Thumbs from HTBackdrops.com
be_by: Атрымліваць мініяцюры выканаўцаў з HTBackdrops.com
bs_ba: Omogućite sličice umjetnika sa HTBacdrops.com
es_es: Activar miniaturas de artista de HTBackdrops.com
he_il: הפעלת תמונות אמנים מ־HTBackdrops.com
is_is: Virkja smámyndir flytjenda frá HTBackdrops.com
pl_pl: Włącz miniatury wykonawcy z HTBackdrops.com
tr_tr: HTBackdrops.com Sanatçı Küçük Resimlerini etkinleştir
uk_ua: Включити ескізи виконавця з HTBackdrops.com
zh_tw: 啟用 HTBackdrops.com 藝人縮圖

# #30004
source: Enable Artist Fanarts from fanart.tv
be_by: Атрымліваць ілюстрацыі выканаўцаў з fanart.tv
bs_ba: Omogućite umjetničke fanartove sa fanart.tv
es_es: Activar fanarts de artista de fanart.tv
he_il: הפעלת פאנארט אמנים מ־fanart.tv
is_is: Virkja aðdáendamyndir flytjenda frá fanart.tv
pl_pl: Włącz fototapety wykonawcy z fanart.tv
tr_tr: fanart.tv Sanatçı Fanartlarını etkinleştir
uk_ua: Отримати обкладинки виконавця з fanart.tv
zh_tw: 啟用 fanart.tv 藝人美術圖

# #30005
source: Enable Artist Thumbs from fanart.tv
be_by: Атрымліваць мініяцюры выканаўцаў з fanart.tv
bs_ba: Omogući sličice umjetnika sa fanart.tv
es_es: Activar miniaturas de artista de fanart.tv
he_il: הפעלת תמונות אמנים מ־fanart.tv
is_is: Virkja smámyndir flytjenda frá fanart.tv
pl_pl: Włącz miniatury wykonawcy z fanart.tv
tr_tr: fanart.tv Sanatçı Küçük Resimlerini etkinleştir
uk_ua: Включити ескізи виконавця з fanart.tv
zh_tw: 啟用 fanart.tv 藝人縮圖

# #30006
source: Get Artist Biography from
be_by: Атрымліваць біяграфіі выканаўцаў з
bs_ba: Preuzmite biografiju umjetnika sa
es_es: Obtener biografía del artista de
he_il: משיכת ביוגרפיית אומן מתוך
is_is: Fá æviágrip flytjenda frá
pl_pl: Pobierz biografię wykonawcy z
tr_tr: Sanatçı biyografisini şuradan al:
uk_ua: Отримати біографію виконавця з
zh_tw: 藝人簡介資料來自

# #30007
source: Artwork
be_by: Вокладка
bs_ba: Umjetničko djelo
he_il: גרפיקה
is_is: Myndskreytingar
pl_pl: Grafika
tr_tr: Resim
uk_ua: Обкладинка
zh_tw: 圖片

# #30008
source: Get Artist Discography from
be_by: Атрымліваць дыскаграфіі выканаўцаў з
bs_ba: Preuzmite diskografiju izvođača sa
es_es: Obtener discografía del artista de
he_il: משיכת דיסקוגרפיית אומן מתוך
is_is: Fá yfirlit yfir útgáfur flytjenda frá
pl_pl: Pobierz dyskografię wykonawcy z
tr_tr: Sanatçı diskografisini şuradan al:
uk_ua: Отримати дискографію виконавця з
zh_tw: 藝人專輯目錄資料來自

# #30009
source: Get Artist Genres from
be_by: Атрымліваць жанры выканаўцаў з
bs_ba: Preuzmite žanrove izvođača sa
es_es: Obtener géneros del artista de
he_il: משיכת ז׳אנר אומן מתוך
is_is: Fá flokkun flytjenda frá
pl_pl: Pobierz gatunki muzyczne wykonawcy z
tr_tr: Sanatçı tarzlarını şuradan al:
uk_ua: Отримати жанри виконавця з
zh_tw: 藝人類型資料來自

# #30010
source: Get Artist Styles from
be_by: Атрымліваць стылі выканаўцаў з
bs_ba: Preuzmite stilove umjetnika sa
es_es: Obtener estilos del artista de
he_il: משיכת סגנונות אומן מתוך
is_is: Fá stíl flytjenda frá
pl_pl: Pobierz style wykonawcy z
tr_tr: Sanatçı stillerini şuradan al:
uk_ua: Отримати стилі виконавця з
zh_tw: 藝人風格資料來自

# #30011
source: Get Artist Life-Span from
be_by: Атрымліваць узрост выканаўцы з
bs_ba: Preuzmite životni vijek umjetnika sa
es_es: Obtener fecha de debut del artista de
he_il: משיכת אורך חיי אומן מתוך
is_is: Fá líftíma flytjenda frá
pl_pl: Pobierz lata twórczości wykonawcy z
tr_tr: Sanatçı yaşam süresini şuradan al:
uk_ua: Отримувати вік виконавця з
zh_tw: 藝人生平資料來自

# #30012
source: Get Artist Moods from
be_by: Атрымліваць настроі выканаўцы з
bs_ba: Preuzmite raspoloženja umjetnika sa
es_es: Obtener estados de ánimo del artista de
he_il: משיכת מצבי רוח אומן מתוך
is_is: Ná í hughrif flytjenda frá
pl_pl: Pobierz nastroje wykonawcy z
tr_tr: Sanatçı ruh hallerini şuradan al:
uk_ua: Отримати настрої виконавця з
zh_tw: 藝人氛圍資料來自

# #30014
source: Get Artist Years Active from
be_by: Атрымліваць перыяд творчасці выканаўцы з
bs_ba: Preuzmite godine aktivnog izvođača sa
es_es: Obtener años en activo del artista de
he_il: משיכת שנות פעילות אומן מתוך
is_is: Fá árafjölda sem flytjendur hafa verið virkir frá
pl_pl: Pobierz okres twórczości wykonawcy z
tr_tr: Sanatçının etkin olduğu yılları şuradan al:
uk_ua: Отримати роки активності виконавця з
zh_tw: 藝人活躍的年代資料來自

# #30015
source: Preferred Language
be_by: Пераважная мова
bs_ba: Preferirani jezik
es_es: Idioma preferido
he_il: שפה מועדפת
is_is: Umbeðið tungumál
pl_pl: Preferowany język
tr_tr: Tercih Edilen Dil
uk_ua: Бажана мова
zh_tw: 偏好的語言

# #30016
source: Fallback to Artist Biography from
be_by: Спасылка на біяграфію выканаўцы
bs_ba: Povratak na biografiju umjetnika sa
es_es: Alternativa a la biografía del artista de
he_il: נסיגה לביוגרפיות אומן מתוך
is_is: Til vara fá æviágrip flytjenda frá
pl_pl: Cofnij do biografii wykonawcy z
tr_tr: Sanatçı biyografisi yedek kaynağı:
uk_ua: Посилатись до біографії виконавця з
zh_tw: 備用藝人簡介資料來自

# #30017
source: Fallback to Artist Discography from
be_by: Спасылка на дыскаграфію выканаўцы
bs_ba: Povratak na diskografiju izvođača sa
es_es: Alternativa a la discografía del artista de
he_il: חזר לדיסקוגרפית אומן מתוך
is_is: Til vara fá yfirlit yfir útgáfur flytjenda frá
pl_pl: Cofnij do dyskografii wykonawcy z
tr_tr: Sanatçı diskografisi yedek kaynağı:
uk_ua: Посилатись до дискографії виконавця з
zh_tw: 備用藝人專輯目錄資料來自

# #30018
source: Fallback to Artist Genres from
be_by: Спасылка на жанры выканаўцы
bs_ba: Povratak na žanrove izvođača sa
es_es: Alternativa al género del artista de
he_il: חזר לסגנונות אומן מ
is_is: Til vara fá flokkun flytjenda frá
pl_pl: Cofnij do gatunków wykonawcy z
tr_tr: Sanatçı tarzları yedek kaynağı:
uk_ua: Посилатись до жанрів виконавця з
zh_tw: 備用藝人類型資料來自

# #30019
source: Fallback to Artist Styles from
be_by: Спасылка на стылі выканаўцы
bs_ba: Povratak na stilove umjetnika sa
es_es: Alternativa a estilos del artista de
he_il: נסיגה לסגנונות אומן מתוך
is_is: Til vara fá stíl flytjenda frá
pl_pl: Cofnij do stylów wykonawcy z
tr_tr: Sanatçı stilleri yedek kaynağı:
uk_ua: Посилатись до стилів виконавця з
zh_tw: 備用藝人風格資料來自

# #30020
source: Fallback to Artist Life-Span from
be_by: Спасылка на ўзрост выканаўцы
bs_ba: Povratak na životni vijek umjetnika sa
es_es: Alternativa a la fecha de debut del artista de
he_il: חזור לתוחלת חיי אומן מ
is_is: Til vara fá líftíma flytjenda frá
pl_pl: Cofnij do lat twórczości wykonawcy z
tr_tr: Sanatçı yaşam süresi yedek kaynağı:
uk_ua: Посилатись до віку виконавця з
zh_tw: 備用藝人生平資訊來自

# #30021
source: Fallbacks
be_by: Спасылкі
bs_ba: Rezervne opcije
es_es: Alternativas
he_il: נסיגות
is_is: Til vara
pl_pl: Rezerwy
tr_tr: Yedek kaynaklar
uk_ua: Посилання
zh_tw: 備用

# #30022
source: Enable Artist Thumbs from theaudiodb.com
be_by: Атрымліваць мініяцюры выканаўцаў з theaudiodb.com
bs_ba: Omogućite sličice izvođača sa theaudiodb.com
es_es: Activar miniaturas de artista de theaudiodb.com
he_il: הפעלת תמונות אומן מ־theaudiodb.com
is_is: Virkja smámyndir flytjenda frá theaudiodb.com
pl_pl: Włącz miniatury wykonawcy z theaudiodb.com
tr_tr: theaudiodb.com Sanatçı Küçük Resimlerini etkinleştir
uk_ua: Включити ескізи виконавця з theaudiodb.com
zh_tw: 啟用 theaudiaodb.com 藝人縮圖

# #30023
source: Enable Artist Fanarts from theaudiodb.com
be_by: Атрымліваць ілюстрацыі выканаўцаў з theaudiodb.com
bs_ba: Omogućite umjetničke crteže obožavatelja sa theaudiodb.com
es_es: Activar fanarts de artista de theaudiodb.com
he_il: הפעלת פאנארט אומן מ־theaudiodb.com
is_is: Virkja aðdáendamyndir flytjenda frá theaudiodb.com
pl_pl: Włącz fototapety wykonawcy z theaudiodb.com
tr_tr: theaudiodb.com Sanatçı Fanartlarını etkinleştir
uk_ua: Отримати обкладинки виконавця з theaudiodb.com
zh_tw: 啟用 theaudiaodb.com 藝人美術圖

# #30024
source: Fallback to Artist Moods from
be_by: Спасылка на настроі выканаўцы
bs_ba: Povratak na raspoloženja umjetnika sa
es_es: Alternativa a los estados de ánimo del artista de
he_il: נסיגה למצב רוח אומן מתוך
is_is: Til vara fá hughrif flytjenda frá
pl_pl: Cofnij do nastrojów wykonawcy z
tr_tr: Sanatçı ruh halleri yedek kaynağı:
uk_ua: Посилатись до настроїв виконавця з
zh_tw: 獲取備用藝人氛圍資料從

# #30025
source: MB Mirror
be_by: Люстэрка MB
bs_ba: MB ogledalo
es_es: Espejo MB
he_il: אתר מראה של MB
is_is: MB-spegill
pl_pl: Serwer lustrzany MB
tr_tr: MB Yansısı
uk_ua: Дзеркало MB
zh_tw: MB備援站

# #30026
source: MusicBrainz Mirror
be_by: Люстэрка MusicBrainz
bs_ba: MusicBrainz ogledalo
es_es: Espejo MusicBrainz
he_il: אתר מראה של MusicBrainz
is_is: MusicBrainz-spegill
pl_pl: Serwer lustrzany MusicBrainz
tr_tr: MusicBrainz Yansısı
uk_ua: Дзеркало сайта MusicBrainz
zh_tw: MusicBrainz 備援站

# #30027
source: Enable Artist Clearlogo from fanart.tv
be_by: Атрымліваць лагатыпы выканаўцаў з fanart.tv
bs_ba: Omogućite Clearlogo umjetnika sa fanart.tv
es_es: Activar clearlogo de artista de fanart.tv
is_is: Virkja Clearlogo-myndir flytjenda frá fanart.tv
pl_pl: Włącz clearlogo wykonawcy z fanart.tv
tr_tr: fanart.tv Sanatçı Logolarını etkinleştir
uk_ua: Увімкнути чистий логотип виконавця з fanart.tv
zh_tw: 啟用 fanart.tv 藝人圖標

# #30028
source: Enable Artist Banner from fanart.tv
be_by: Атрымліваць банеры выканаўцаў з fanart.tv
bs_ba: Omogući baner umjetnika sa fanart.tv
es_es: Activar banner de artista de fanart.tv
is_is: Virkja borða flytjenda frá fanart.tv
pl_pl: Włącz baner wykonawcy z fanart.tv
tr_tr: fanart.tv Sanatçı Afişini etkinleştir
uk_ua: Увімкнути банер виконавця з fanart.tv
zh_tw: 啟用 fanart.tv 藝人橫幅圖

# #30029
source: Enable Artist Clearlogo from theaudiodb.com
be_by: Атрымліваць лагатыпы выканаўцаў з theaudiodb.com
bs_ba: Omogućite opciju Clearlogo izvođača sa stranice theaudiodb.com
es_es: Activar clearlogo de artista de theaudiodb.com
is_is: Virkja Clearlogo-myndir flytjenda frá theaudiodb.com
pl_pl: Włącz clearlogo wykonawcy z theaudiodb.com
tr_tr: theaudiodb.com Sanatçı Logosunu etkinleştir
uk_ua: Увімкнути чистий логотип виконавця з theaudiodb.com
zh_tw: 啟用 theaudiodb.com 藝人圖標

# #30030
source: Enable Artist Clearart from theaudiodb.com
be_by: Атрымліваць ілюстрацыі выканаўцаў з theaudiodb.com
bs_ba: Omogućite Clearart izvođača sa theaudiodb.com
es_es: Activar clearart de artista de theaudiodb.com
is_is: Virkja Clearart-myndir flytjenda frá theaudiodb.com
pl_pl: Włącz clearart wykonawcy z theaudiodb.com
tr_tr: theaudiodb.com Sanatçı Clearartını etkinleştir
uk_ua: Увімкнути чисте зображення виконавця з theaudiodb.com
zh_tw: 啟用 theaudiodb.com 藝人透明底美術圖

# #30031
source: Enable Artist Landscape from theaudiodb.com
be_by: Атрымліваць ілюстрацыі выканаўцаў альбомнага фармату з theaudiodb.com
bs_ba: Omogućite umjetnički pejzaž sa theaudiodb.com
es_es: Activar landscape de artista de theaudiodb.com
is_is: Virkja landslagsmyndir flytjenda frá theaudiodb.com
pl_pl: Włącz krajobraz wykonawcy z theaudiodb.com
tr_tr: theaudiodb.com Sanatçı Manzarasını etkinleştir
uk_ua: Увімкнути пейзаж виконавця з theaudiodb.com
zh_tw: 啟用 theaudiodb.com 藝人橫幅圖

# #30032
source: Enable Artist Banner from theaudiodb.com
be_by: Атрымліваць банеры выканаўцаў з theaudiodb.com
bs_ba: Omogućite baner izvođača sa theaudiodb.com
es_es: Activar banner de artista de theaudiodb.com
is_is: Virkja borða flytjenda frá theaudiodb.com
pl_pl: Włącz baner wykonawcy z theaudiodb.com
tr_tr: theaudiodb.com Sanatçı Afişini etkinleştir
uk_ua: Увімкнути банер виконавця з theaudiodb.com
zh_tw: 啟用 theaudiodb.com 藝人橫幅圖
