Repository: xbmc/xbmc
Catalog: lib/libiconv/po/*.po
Languages: de

source: Usage: iconv [-c] [-s] [-f fromcode] [-t tocode] [file ...]
de: Aufruf: iconv [-c] [-s] [-f AUSGANGS-KODIERUNG] [-t ZIEL-KODIERUNG] [DATEI ...]

source: or: iconv -l
de: oder: iconv -l

source: Try `%s --help' for more information.
de: »%s --help« gibt weitere Informationen.

source: Usage: %s [OPTION...] [-f ENCODING] [-t ENCODING] [INPUTFILE...]
de: Aufruf: %s [OPTION...] [-f KODIERUNG] [-t KODIERUNG] [EINBABEDATEI...]

source: or: %s -l
de: oder: %s -l

source: Converts text from one encoding to another encoding.
de: Wandelt Text von einer Kodierung in eine andere Kodierung um.

source: Options controlling the input and output format:
de: Optionen für das Ein- und Ausgabeformat:

source: -f ENCODING, --from-code=ENCODING the encoding of the input
de: -f KODIERUNG, --from-code=KODIERUNG die Kodierung der Eingabe

source: -t ENCODING, --to-code=ENCODING the encoding of the output
de: -t KODIERUNG, --to-code=KODIERUNG die Kodierung der Ausgabe

source: Options controlling conversion problems:
de: Optionen für die Behandlung von Umwandlungsproblemen:

source: -c discard unconvertible characters
de: -c Zeichen, die nicht umgewandelt werden können, wegwerfen

source: --unicode-subst=FORMATSTRING substitution for unconvertible Unicode characters
de: --unicode-subst=FORMATZEICHENKETTE Ersatz für Unicode-Zeichen, die nicht umgewandelt werden können

source: --byte-subst=FORMATSTRING substitution for unconvertible bytes
de: --byte-subst=FORMATZEICHENKETTE Ersatz für Bytes, die nicht umgewandelt werden können

source: --widechar-subst=FORMATSTRING substitution for unconvertible wide characters
de: --widechar-subst=FORMATZEICHENKETTE Ersatz für »wide«-Zeichen, die nicht umgewandelt werden können

source: Options controlling error output:
de: Optionen für die Ausgabe von Fehlern:

source: -s, --silent suppress error messages about conversion problems
de: -s, --silent Fehlermeldungen über Probleme bei der Umwandlung unterdrücken

source: Informative output:
de: Informative Ausgabe:

source: -l, --list list the supported encodings
de: -l, --list die unterstützten Kodierungen anzeigen

source: --help display this help and exit
de: --help diese Hilfe anzeigen und beenden

source: --version output version information and exit
de: --version Versionsinformation anzeigen und beenden

source: Report bugs to <bug-gnu-libiconv@gnu.org>.
de: Fehler bitte (auf Englisch, mit LC_ALL=C) an <bug-gnu-libiconv@gnu.org> melden. Für die deutsche Übersetzung ist die Mailingliste <translation-team-de@lists.sourceforge.net> zuständig.

source: Written by %s.
de: Geschrieben von %s.

source: %s argument: A format directive with a variable width is not allowed here.
de: »%s«-Argument: Eine Formatierungsanweisung mit variabler Breite ist hier nicht erlaubt.

source: %s argument: A format directive with a variable precision is not allowed here.
de: »%s«-Argument: Eine Formatierungsanweisung mit variabler Genauigkeit ist hier nicht erlaubt.

source: %s argument: A format directive with a size is not allowed here.
de: »%s«-Argument: Eine Formatierungsanweisung mit Größenangabe ist hier nicht erlaubt.

source: %s argument: The string ends in the middle of a directive.
de: »%s«-Argument: Die Zeichenkette endet mitten in einer Anweisung.

source: %s argument: The character '%c' is not a valid conversion specifier.
de: »%s«-Argument: Das Zeichen »%c« bezeichnet keine gültige Umwandlung.

source: %s argument: The character that terminates the format directive is not a valid conversion specifier.
de: »%s«-Argument: Das Zeichen am Ende der Formatierungsanweisung bezeichnet keine gültige Umwandlung.

source: %s argument: The format string consumes more than one argument: %u argument.
de: »%s«-Argument: Die Formatzeichenkette verbraucht mehr als ein Argument: %u Argument.

source: cannot convert byte substitution to Unicode: %s
de: Kann Byte-Ersatz nicht nach Unicode umwandeln: %s

source: cannot convert unicode substitution to target encoding: %s
de: Kann Unicode-Zeichen-Ersatz nicht in die Zielkodierung umwandeln: %s

source: cannot convert byte substitution to wide string: %s
de: Kann Byte-Ersatz nicht in eine »wide«-Zeichenkette umwandeln: %s

source: cannot convert widechar substitution to target encoding: %s
de: Kann den »wide«-Zeichen-Ersatz nicht in die Zielkodierung umwandeln: %s

source: cannot convert byte substitution to target encoding: %s
de: Kann den Byte-Ersatz nicht in die Zielkodierung umwandeln: %s

source: %s:%u:%u: cannot convert
de: %s:%u:%u: Kann nicht umwandeln.

source: %s:%u:%u: incomplete character or shift sequence
de: %s:%u:%u: unvollständiges Zeichen oder unvollständige Umschaltfolge

source: %s: I/O error
de: %s: Ein-/Ausgabefehler

source: conversion from %s unsupported
de: Umwandlung ausgehend von %s ist nicht unterstützt.

source: conversion to %s unsupported
de: Umwandlung nach %s ist nicht unterstützt.

source: conversion from %s to %s unsupported
de: Umwandlung von %s nach %s ist nicht unterstützt.

source: try '%s -l' to get the list of supported encodings
de: Versuchen Sie »%s -l«, um eine Liste aller unterstützten Kodierungen zu erhalten.

source: (stdin)
de: (Standard-Eingabe)

source: I/O error
de: Ein-/Ausgabefehler
