Repository: xbmc/xbmc
Catalog: addons/weather.wunderground/resources/language/Slovenian/strings.po
Languages: sl

# #32101
source: Location setup
sl: Nastavitev kraja

# #32102
source: Advanced options
sl: Napredne nastavitve

# #32111
source: Location 1
sl: Kraj 1

# #32112
source: Location 2
sl: Kraj 2

# #32113
source: Location 3
sl: Kraj 3

# #32114
source: Location 1 display name
sl: Prikaz kraja 1

# #32115
source: Location 2 display name
sl: Prikaz kraja 2

# #32116
source: Location 3 display name
sl: Prikaz kraja 3

# #32117
source: Location 1 id
sl: Id kraja 1

# #32118
source: Location 2 id
sl: Id kraja 2

# #32119
source: Location 3 id
sl: Id kraja 3

# #32120
source: Enable logging
sl: Vključi zapisnik

# #32121
source: Weekend
sl: Vikend

# #32122
source: Saturday/Sunday
sl: Sobota/Nedelja

# #32123
source: Friday/Saturday
sl: Petek/Sobota

# #32124
source: Thursday/Friday
sl: Četrtek/Petek

# #32125
source: Map zoom level
sl: Povečava kart

# #32126
source: Animated map
sl: Animirane karte

# #32501
source: New Moon
sl: Mlaj

# #32502
source: Waxing Crescent
sl: Prva četrtina

# #32503
source: First Quarter
sl: Prvi krajec

# #32504
source: Waxing Gibbous
sl: Prva polovica

# #32505
source: Full Moon
sl: Polna luna

# #32506
source: Waning Gibbous
sl: Druga polovica

# #32507
source: Last Quarter
sl: Zadnji krajec

# #32508
source: Waning Crescent
sl: Zadnja četrtina

# #32510
source: Warning
sl: Opozorilo

# #32511
source: Watch
sl: Pozor

# #32512
source: Advisory
sl: Nasvet

# #32513
source: Statement
sl: Trditev

# #32514
source: Outlook
sl: Izgled

# #32515
source: Forecast
sl: Napoved

# #32516
source: Synopsis
sl: Obnova
