Repository: xbmc/xbmc
Catalog: addons/weather.wunderground/resources/language/Welsh/strings.po
Languages: cy

# #32101
source: Location setup
cy: Gosod y lleoliad

# #32102
source: Advanced options
cy: Dewisiadau uwch

# #32111
source: Location 1
cy: Lleoliad 1

# #32112
source: Location 2
cy: Lleoliad 2

# #32113
source: Location 3
cy: Lleoliad 3

# #32114
source: Location 1 display name
cy: Enw Dangos Lleoliad 1

# #32115
source: Location 2 display name
cy: Enw Dangos Lleoliad 2

# #32116
source: Location 3 display name
cy: Enw Dangos Lleoliad 3

# #32117
source: Location 1 id
cy: Dynodiad Lleoliad 1

# #32118
source: Location 2 id
cy: Dynodiad Lleoliad 2

# #32119
source: Location 3 id
cy: Dynodiad Lleoliad 3

# #32120
source: Enable logging
cy: Galluogi cofnodi

# #32121
source: Weekend
cy: Penwythnos

# #32122
source: Saturday/Sunday
cy: Sadwrn/Sul

# #32123
source: Friday/Saturday
cy: Gwener/Sadwrn

# #32124
source: Thursday/Friday
cy: Iau/Gwener

# #32125
source: Map zoom level
cy: Lefel chwyddo map

# #32126
source: Animated map
cy: Map wedi ei animeiddio

# #32501
source: New Moon
cy: Lleuad Newydd

# #32502
source: Waxing Crescent
cy: Lleuad ar ei Chynnydd

# #32503
source: First Quarter
cy: Chwarter Cyntaf

# #32504
source: Waxing Gibbous
cy: Cynnydd Lleuad Amgrwn

# #32505
source: Full Moon
cy: Lleuad Llawn

# #32506
source: Waning Gibbous
cy: Ciliad Lleuad Amgrwn

# #32507
source: Last Quarter
cy: Chwarter Olaf

# #32508
source: Waning Crescent
cy: Ciliad Cilgant Lleuad

# #32510
source: Warning
cy: Rhybudd

# #32511
source: Watch
cy: Gwylio

# #32512
source: Advisory
cy: Awgrymiad

# #32513
source: Statement
cy: Datganiad

# #32514
source: Outlook
cy: Rhagolygon

# #32515
source: Forecast
cy: Rhagolygon

# #32516
source: Synopsis
cy: Crynodeb
