Repository: xbmc/xbmc
Catalog: addons/weather.wunderground/resources/language/Burmese/strings.po
Languages: my

# #32101
source: Location setup
my: တည်နေရာ setup

# #32111
source: Location 1
my: တည်နေရာ ၁

# #32112
source: Location 2
my: တည်နေရာ ၂

# #32113
source: Location 3
my: တည်နေရာ ၃

# #32114
source: Location 1 display name
my: တည်နေရာ ၁ ဖော်ပြထားသောအမည်

# #32115
source: Location 2 display name
my: တည်နေရာ ၂ ဖော်ပြထားသောအမည်

# #32116
source: Location 3 display name
my: တည်နေရာ ၃ ဖော်ပြထားသောအမည်

# #32117
source: Location 1 id
my: တည်နေရာ ၁ id

# #32118
source: Location 2 id
my: တည်နေရာ ၂ id

# #32119
source: Location 3 id
my: တည်နေရာ ၃ id

# #32121
source: Weekend
my: စနေနှင့်တနင်္ဂနွေ

# #32122
source: Saturday/Sunday
my: စနေ၊တနင်္ဂနွေ

# #32123
source: Friday/Saturday
my: သောကြာ၊စနေ

# #32124
source: Thursday/Friday
my: ကြာသပတေး၊သောကြာ

# #32501
source: New Moon
my: လ အသစ်

# #32505
source: Full Moon
my: လပြည့်

# #32510
source: Warning
my: သတိပေးချက်

# #32511
source: Watch
my: စောင့်ကြည့်မည်

# #32513
source: Statement
my: ဖော်ပြချက်

# #32515
source: Forecast
my: ခန့်မှန်းချက်
