Repository: xbmc/xbmc
Catalog: addons/weather.wunderground/resources/language/Thai/strings.po
Languages: th

# #32101
source: Location setup
th: ตั้งค่า ตำแหน่งพื้นที่

# #32102
source: Advanced options
th: ตัวเลือก ขั้นสูง

# #32111
source: Location 1
th: ตำแหน่งพื้นที่ 1

# #32112
source: Location 2
th: ตำแหน่งพื้นที่ 2

# #32113
source: Location 3
th: ตำแหน่งพื้นที่ 3

# #32114
source: Location 1 display name
th: ตำแหน่งพื้นที่ 1 ชื่อที่แสดง

# #32115
source: Location 2 display name
th: ตำแหน่งพื้นที่ 2 ชื่อที่แสดง

# #32116
source: Location 3 display name
th: ตำแหน่งพื้นที่ 3 ชื่อที่แสดง

# #32117
source: Location 1 id
th: ตำแหน่งพื้นที่ 1 id

# #32118
source: Location 2 id
th: ตำแหน่งพื้นที่ 2 id

# #32119
source: Location 3 id
th: ตำแหน่งพื้นที่ 3 id

# #32120
source: Enable logging
th: เปิดใช้งาน logging

# #32121
source: Weekend
th: สุดสัปดาห์

# #32122
source: Saturday/Sunday
th: วันเสาร์/วันอาทิตย์

# #32123
source: Friday/Saturday
th: วันศุกร์/วันเสาร์

# #32124
source: Thursday/Friday
th: วันพฤหัสบดี/วันศุกร์

# #32125
source: Map zoom level
th: ระดับการซูมแผนที่

# #32126
source: Animated map
th: เคลื่อนไหว แผนที่

# #32501
source: New Moon
th: ดวงจันทร์ใหม่

# #32502
source: Waxing Crescent
th: ข้างขึ้นเดือนเสี้ยว

# #32503
source: First Quarter
th: ไตรมาสแรก

# #32504
source: Waxing Gibbous
th: ข้างขึ้นเดือนเต็ม

# #32505
source: Full Moon
th: จันทร์เต็มดวง

# #32506
source: Waning Gibbous
th: ข้างแรมเดือนเต็ม

# #32507
source: Last Quarter
th: ไตรมาสสุดท้าย

# #32508
source: Waning Crescent
th: ข้างแรมเดือนเสี้ยว

# #32510
source: Warning
th: คำเตือน

# #32511
source: Watch
th: เฝ้าดู

# #32512
source: Advisory
th: คำแนะนำ

# #32513
source: Statement
th: รายงาน

# #32515
source: Forecast
th: พยากรณ์

# #32516
source: Synopsis
th: สรุป
