Repository: xbmc/xbmc
Catalog: language/Arabic/strings.po
Languages: ar

# #20076
source: Ask for master lock code on startup
ar: اطلب رمز القفل الرئيسي عند بداية التشغيل

# #20077
source: Skin settings
ar: إعدادات الغلاف

# #20078
source: - no link set -
ar: - لم يتم تعيين الارتباط -

# #20079
source: Enable animations
ar: تمكين الصور المتحركة

# #20080
source: Disable RSS during music
ar: أثناء الموسيقى RSS إيقاف الموسيقى

# #20081
source: Enable shortcut buttons
ar: تمكين اختصارات الأزرار

# #20082
source: Show programs in main menu
ar: عرض البرامج في القائمة الرئيسية

# #20083
source: Show music info
ar: عرض معلومات الموسيقى

# #20084
source: Show weather info
ar: عرض معلومات الطقس

# #20085
source: Show system info
ar: عرض نظام عرض المعلومات

# #20086
source: Show available disc space C: E: F:
ar: C : E : F : عرض المساحة الحرة على الأقراص

# #20087
source: Show available disc space E: F: G:
ar: E : F : G : عرض المساحة الحرة على الأقراص

# #20088
source: Weather info
ar: معلومات الطقس

# #20089
source: Drive space free
ar: مساحة القرص الحرة

# #20090
source: Enter the name of an existing share
ar: أدخل اسم لمشاركة موجودة

# #20091
source: Lock code
ar: رمز القفل

# #20092
source: Load profile
ar: تحميل الملف الشخصي

# #20093
source: Profile name
ar: اسم الملف الشخصي

# #20094
source: Media sources
ar: مصادر الوسائط

# #20095
source: Enter profile lock code
ar: إدخال رمز قفل الملف الشخصي

# #20096
source: Login screen
ar: شاشة الدخول

# #20097
source: Fetching album info
ar: الحصول على معلومات الألبوم

# #20098
source: Fetching info for album
ar: الحصول على معلومات عن الألبوم

# #20099
source: Can't rip CD or track while playing from CD
ar: لا يمكن نسخ القرص أو المسار أثناء القراءة من القرص

# #20100
source: Master lock code and settings
ar: رمز القفل الرئيسي والإعدادت

# #20101
source: Entering master lock code always enables master mode
ar: إدخال رمز القفل الرئيسي يسمح الوضع الرئيسي دائما

# #20102
source: or copy from default?
ar: أو نسخ افتراضيا؟

# #20103
source: Save changes to profile?
ar: حفظ التغييرات إلى ملف الشخصي؟

# #20104
source: Old settings found.
ar: .الإعدادات القديمة وجدت

# #20105
source: Do you want to use them?
ar: هل تريد استخدامها؟

# #20106
source: Old media sources found.
ar: مصادر وسائط قديمة وجدت

# #20107
source: Separate (locked)
ar: فصل (مقفلة)

# #20108
source: Root
ar: الجذر

# #20109
source: - Zoom
ar: التكبير

# #20110
source: UPnP settings
ar: UPnP إعدادات

# #20111
source: Autostart UPnP client
ar: تلقائي UPnP تشغيل عميل

# #20112
source: Last login: %s
ar: %s :آخر تسجيل دخول

# #20113
source: Never logged on
ar: لم يتم تسجيل دخول

# #20114
source: Profile %i / %i
ar: %i / %i الملف الشخصي

# #20115
source: User login / Select a profile
ar: تسجيل دخول مستخدم / اختيار ملف شخصي

# #20116
source: Use lock on login screen
ar: استخدام القفل على شاشة تسجيل الدخول

# #20117
source: Invalid lock code.
ar: رمز القفل غير صحيح

# #20118
source: This requires the master lock to be set.
ar: هذا يتطلب رمز القفل الرئيسي لتمكين التعيين

# #20119
source: Would you like to set it now?
ar: هل تريد تعيينها الآن؟

# #20120
source: Loading program information
ar: تحميل معلومات البرنامج

# #20121
source: Party on!
ar: ! الطرف

# #20122
source: True
ar: صحيح

# #20123
source: Mixing drinks
ar: خلط المشروبات

# #20124
source: Filling glasses
ar: ملء الأكواب

# #20125
source: Logged on as
ar: تسجيل الدخو بإسم

# #20126
source: Log off
ar: تسجيل الخروج

# #20128
source: Go to root
ar: اذهب الى الجذر

# #20129
source: Weave
ar: نسج

# #20130
source: Weave (inverted)
ar: نسج (مقلوب)

# #20131
source: Blend
ar: توليف

# #20132
source: Restart video
ar: إعادة تشغيل الفيديو

# #20133
source: Edit network location
ar: تحرير موقع الشبكة

# #20134
source: Remove network location
ar: إزالة موقع الشبكة

# #20135
source: Do you want to scan the folder?
ar: هل تريد أن تفحص المجلد؟

# #20136
source: Memory unit
ar: وحدة ذاكرة

# #20137
source: Memory unit mounted
ar: وحدة الذاكرة جاهزة للاستخدام

# #20138
source: Unable to mount memory unit
ar: غير قادر على تحميل وحدة الذاكرة

# #20139
source: In port %i, slot %i
ar: %i الفتحة ,%i في المنفذ

# #20140
source: Lock screensaver
ar: قفل الشاشة المؤقتة

# #20141
source: Set
ar: تعيين

# #20142
source: Username
ar: اسم المستخدم

# #20143
source: Enter password for
ar: أدخل كلمة المرور لـ

# #20144
source: Shutdown timer
ar: مؤقت الإغلاق

# #20145
source: Shutdown interval (in minutes)
ar: إغلاق (في دقائق)

# #20146
source: Started, shutdown in %im
ar: %im بدأت, أغلقت في

# #20147
source: Shutdown in 30 minutes
ar: إيقاف في 30 دقيقة

# #20148
source: Shutdown in 60 minutes
ar: إيقاف في 60 دقيقة

# #20149
source: Shutdown in 120 minutes
ar: إيقاف في 120 دقيقة

# #20150
source: Custom shutdown timer
ar: مؤقت إغلاق مخصص

# #20151
source: Cancel shutdown timer
ar: إلغاء مؤقت الإغلاق

# #20152
source: Lock preferences for %s
ar: %s قفل التفضيلات لـ

# #20153
source: Browse...
ar: استعراض...

# #20154
source: Summary information
ar: معلومات الملخص

# #20155
source: Storage information
ar: معلومات التخزين

# #20156
source: Hard disk information
ar: معلومات القرص الصلب

# #20157
source: DVD-ROM information
ar: DVD-ROM معلومات محرك الأقراص

# #20158
source: Network information
ar: معلومات الشبكة

# #20159
source: Video information
ar: معلومات الفيديو

# #20160
source: Hardware information
ar: معلومات الجهاز

# #20161
source: Total
ar: المجموع

# #20162
source: Used
ar: المستخدمة

# #20163
source: of
ar: من

# #20164
source: Locking not supported
ar: القفل غير معتمد

# #20165
source: Not locked
ar: غير مقفل

# #20166
source: Locked
ar: مقفل

# #20167
source: Frozen
ar: مجمدة

# #20168
source: Requires reset
ar: يتطلب إعادة

# #20169
source: Week
ar: الاسبوع

# #20170
source: Line
ar: الصف

# #20171
source: Windows network (SMB)
ar: (SMB) شبكة النوافذ

# #20172
source: XBMSP server
ar: XBMSP خادم

# #20173
source: FTP server
ar: FTP خادم

# #20174
source: iTunes music share (DAAP)
ar: (DAAP) مشاركة موسيقى الايتونز

# #20175
source: UPnP server
ar: خادم UPnP

# #20176
source: Show video info
ar: عرض معلومات الفيديو

# #20177
source: Done
ar: إنهاء

# #20178
source: Shift
ar: تغير

# #20179
source: Caps Lock
ar: أحرف كبيرة

# #20180
source: Symbols
ar: الرموز

# #20181
source: Backspace
ar: مسافة للخلف

# #20182
source: Space
ar: مسافة

# #20183
source: Reload skin
ar: إعادة تحميل الغلاف

# #20184
source: Rotate pictures using EXIF information
ar: EXIF استدارة الصور باستخدام معلومات ​​

# #20185
source: Use poster view styles for TV shows
ar: استخدام أنماط عرض الملصقات للبرامج التلفزيونية

# #20186
source: Please wait
ar: الرجاء الانتظار

# #20189
source: Enable auto scrolling for plot & review
ar: تمكين التمرير التلقائي للحوار والمراجعة

# #20190
source: Custom
ar: مخصص

# #20191
source: Enable debug logging
ar: تمكين تسجيل التصحيح

# #20192
source: Download additional information during updates
ar: تنزيل معلومات إضافية اثناء التحديثات

# #20193
source: Default service for album information
ar: الخدمة الافتراضية لمعلومات الألبوم

# #20194
source: Default service for artist information
ar: الخدمة الافتراضية لمعلومات الفنان

# #20195
source: Change scraper
ar: تغير المكشطه

# #20196
source: Export music library
ar: تصدير مكتبة الموسيقى...

# #20197
source: Import music library
ar: استيراد مكتبة الموسيقى...

# #20198
source: No artist found!
ar: !لم يتم العثور على الفنان

# #20199
source: Downloading artist info failed
ar: فشل تحميل معلومات الفنان

# #20240
source: Android music
ar: موسيقى أندرويد

# #20241
source: Android videos
ar: فيديوهات أندرويد

# #20242
source: Android pictures
ar: صور أندرويد

# #20243
source: Android photos
ar: صور أندرويد

# #20244
source: Android Apps
ar: تطبيقات أندرويد

# #20250
source: Party on! (videos)
ar: هناك طرفا! (فيديو)

# #20251
source: Mixing drinks (videos)
ar: خلط المشروبات (فيديو)

# #20252
source: Filling glasses (videos)
ar: ملء أكواب (فيديو)

# #20253
source: WebDAV server (HTTP)
ar: WebDAV مخدم(HTTP)

# #20254
source: WebDAV server (HTTPS)
ar: WebDAV مخدم(HTTPS)

# #20255
source: First logon, edit your profile
ar: الدخول الأول, حرر ملفك الشخصي

# #20256
source: HTS Tvheadend client
ar: HTS Tv العميل الأخير

# #20257
source: VDR Streamdev client
ar: VDR Streamdev عميل

# #20258
source: MythTV client
ar: MythTV عميل

# #20259
source: Network Filesystem (NFS)
ar: ملفات نظام الشبكة (NFS)

# #20260
source: Secure Shell (SSH/SFTP)
ar: هيكل امن (SSH/SFTP)

# #20261
source: Apple Filing Protocol (AFP)
ar: بروتوكول إيداع ابل (AFP)

# #20300
source: Web server directory (HTTP)
ar: (HTTP) دليل خادم الويب

# #20301
source: Web server directory (HTTPS)
ar: (HTTPS) دليل خادم الويب

# #20302
source: Unable to write to folder:
ar: :لايمكن الكتابة إلى المجلد

# #20303
source: Do you want to skip and proceed?
ar: هل تريد أن تتخطى وتذهب؟

# #20304
source: RSS Feed
ar: تعليق RSS

# #20308
source: DHCP server:
ar: :DHCP خادم

# #20309
source: Make new folder
ar: انشأ مجلد جديد

# #20310
source: Dim LCD on playback
ar: عند التشغيل LCD تبهيت

# #20311
source: Unknown or onboard (protected)
ar: غير معروف أو على لوحة (محمية)

# #20312
source: Dim LCD on paused
ar: عند التوقف LCD تبهيت

# #20314
source: Videos - Library
ar: الفيديو - المكتبة

# #20316
source: Sort by: ID
ar: ترتيب بواسطة: اسم المستخدم

# #20324
source: Play part...
ar: تشغيل جزء...

# #20325
source: Calibration reset
ar: إعادة المعايرة

# #20326
source: This will reset the calibration values for %s
ar: %s هذا سوف يعين معايرة القيم لـ

# #20327
source: to it's default values.
ar: القيم الافتراضية الخاصة به

# #20328
source: Browse for destination
ar: استعراض للموقع

# #20329
source: Movies are in separate folders that match the movie title
ar: الأفلام موجودة في مجلدات منفصلة التي تتطابق مع عنوان الفيلم

# #20330
source: Use folder names for lookups
ar: استخدام أسماء المجلد للبحث

# #20331
source: File
ar: المجلد

# #20332
source: Use file or folder names in lookups?
ar: استخدام أسماء ملف أو مجلد؟

# #20333
source: Set content
ar: تعيين المحتوى

# #20334
source: Folder
ar: مجلد

# #20335
source: Look for content recursively?
ar: بحث المحتوى المتكرر؟

# #20336
source: Unlock sources
ar: فتح مصادر

# #20337
source: Actor
ar: الممثل

# #20338
source: Movie
ar: الفيلم

# #20339
source: Director
ar: المخرج

# #20340
source: Do you want to remove all items within
ar: هل تريد إزالة كافة المعلومات الموجودة في

# #20341
source: this path from the XBMC library?
ar: ؟XBMC هذا المسار من مكتبة

# #20342
source: Movies
ar: الأفلام

# #20343
source: TV shows
ar: البرامج التلفزيونية

# #20344
source: This directory contains
ar: هذا الدليل يحتوي

# #20345
source: Run automated scan
ar: تشغيل الفحص الآلي

# #20346
source: Scan recursively
ar: فحص متكرر

# #20347
source: as
ar: مثل

# #20348
source: Directors
ar: المخرجين

# #20349
source: No video files found in this path!
ar: !لاتوجد ملفات فيديو في هذا المسار

# #20350
source: votes
ar: الأصوات

# #20351
source: TV show information
ar: معلومات البرامج التلفزيونية

# #20352
source: Episode information
ar: معلومات الحلقة

# #20353
source: Loading TV show details
ar: تحميل تفاصيل البرنامج التلفزيوني

# #20354
source: Fetching episode guide
ar: استيراد دليل الحلقة

# #20355
source: Loading info for episodes in directory
ar: تحميل معلومات الحلقة في الدليل

# #20356
source: Select TV show:
ar: :اختر البرنامج التلفزيوني

# #20357
source: Enter the TV show name
ar: إدراج اسم البرنامج التلفزيوني

# #20358
source: Season %i
ar: %i الفصل

# #20359
source: Episode
ar: الحلقة

# #20360
source: Episodes
ar: الحلقات

# #20361
source: Loading episode details
ar: تحميل تفاصيل الحلقة

# #20362
source: Remove episode from library
ar: إزالة الحلقة من المكتبة

# #20363
source: Remove TV show from library
ar: إزالة البرنامج التلفزيوني من المكتبة

# #20364
source: TV show
ar: البرنامج التلفزيوني

# #20365
source: Episode plot
ar: محور الحلقة

# #20366
source: * All seasons
ar: * جميع الفصول

# #20367
source: Hide watched
ar: إخفاء المشاهدات

# #20368
source: Prod code
ar: رمز الانتاج

# #20369
source: Show plot for unwatched items
ar: اظهار حوار العناصر الغير مشاهدة

# #20370
source: * Hidden to prevent spoilers *
ar: *مخفية لمنع المتطفلين*

# #20371
source: Set season thumb
ar: تعيين مصغرة للفصل

# #20372
source: Season image
ar: صورة الفصل

# #20373
source: Season
ar: الفصل

# #20374
source: Downloading movie information
ar: تحميل معلومات الفيلم

# #20375
source: Unassign content
ar: محتوى غير مخصص

# #20376
source: Original title
ar: العنوان الأصلي

# #20377
source: Refresh TV show information
ar: تحديث معلومات البرنامج تلفزيوني

# #20378
source: Refresh info for all episodes?
ar: تحديث المعلومات لجميع الحلقات؟

# #20379
source: Selected folder contains a single TV show
ar: المجلد المحدد يحتوي على برنامج تلفزيوني واحد

# #20380
source: Exclude selected folder from scans
ar: استبعاد المجلد المحدد من الفحص

# #20381
source: Specials
ar: العروض الخاصة

# #20382
source: Automatically grab season thumbs
ar: تحميل مصغرات الفصل تلقائي

# #20383
source: Selected folder contains a single video
ar: المجلد المحدد يحتوي على فيديو واحد

# #20384
source: Link to TV show
ar: ربط إلى البرنامج التلفزيوني

# #20385
source: Remove link to TV show
ar: إزالة الربط من البرنامج التلفزيوني

# #20386
source: Recently added movies
ar: أفلام أضيفت مؤخراً

# #20387
source: Recently added episodes
ar: حلقات أضيفت مؤخراً

# #20388
source: Studios
ar: استوديوهات

# #20389
source: Music videos
ar: االفيديو كليب

# #20390
source: Recently added music videos
ar: اغاني فيديو كليب أضيفت مؤخراً

# #20391
source: Music video
ar: الفيديو كليب

# #20392
source: Remove music video from library
ar: إزالة اغاني الفيديو من المكتبة

# #20393
source: Music video information
ar: معلومات الفيديو كليب

# #20394
source: Loading music video information
ar: تحميل معلومات الفيديو كليب

# #20395
source: Mixed
ar: مختلطة

# #20396
source: Go to albums by artist
ar: اذهب لألبومات الفنانين

# #20397
source: Go to album
ar: للألبومات

# #20398
source: Play song
ar: تشغيل الأغنية

# #20399
source: Go to music videos from album
ar: اذهب لألبومات الفيديو الكليب

# #20400
source: Go to music videos by artist
ar: اذهب إلى الفيديو كليب حسب الفنان

# #20401
source: Play music video
ar: تشغيل الفيديو كليب

# #20402
source: Download actor thumbnails when adding to library
ar: تحميل صور مصغرة للممثل عند الإضافة إلى المكتبة

# #20403
source: Set actor thumb
ar: تعيين صورة مصغرة للمثل

# #20405
source: Remove episode bookmark
ar: إزالة علامة الحلقه

# #20406
source: Set episode bookmark
ar: تعيين علامة الحلقه

# #20407
source: Scraper settings
ar: إعدادات المكشطة

# #20408
source: Downloading music video information
ar: تحميل معلومات الفيديو كليب

# #20409
source: Downloading TV show information
ar: تنزيل معلومات البرنامج التلفزيوني

# #20410
source: Trailer
ar: فيلم قصير

# #20411
source: Flatten
ar: فلاتن

# #20412
source: Flatten TV shows
ar: برامج تلفزيونية فلاتن

# #20413
source: Get fanart
ar: احصل Fanart

# #20414
source: Show Fanart in video and music libraries
ar: في مكتبات الفيديو والموسيقى Fanart إظهار

# #20415
source: Scanning for new content
ar: فحص عن محتوى جديد

# #20416
source: First aired
ar: البث الأول

# #20417
source: Writer
ar: الكاتب

# #20419
source: Replace file names with library titles
ar: إظهار بيانات التعريف في عرض الملفات

# #20420
source: Never
ar: أبداً

# #20421
source: If only one season
ar: إذا فصل واحد فقط

# #20422
source: Always
ar: دائما

# #20423
source: Has trailer
ar: فلم قصير

# #20424
source: False
ar: خطأ

# #20425
source: Fanart slideshow
ar: Fanart عرض شرائح

# #20426
source: Export to a single file or separate
ar: تصدير إلى ملف واحد أو معزول

# #20427
source: files per entry?
ar: مدخل الملفات؟

# #20428
source: Single file
ar: ملف واحد

# #20429
source: Separate
ar: مفصول

# #20430
source: Export thumbnails and fanart?
ar: تصدير المصغرات و Fanart?

# #20431
source: Overwrite old files?
ar: الكتابة فوق الملفات القديمة؟

# #20432
source: Exclude path from library updates
ar: استبعاد المسار من تحديثات المكتبة

# #20433
source: Extract thumbnails and video information
ar: استخراج معلومات المصغرات والفيديو

# #20434
source: Sets
ar: تعيينات

# #20435
source: Set movieset thumb
ar: تعيين مصغرات الفيديو

# #20436
source: Export actor thumbs?
ar: تصدير مصغرات الفنانين؟

# #20437
source: Choose fanart
ar: اختر الخلفية

# #20438
source: Local fanart
ar: الخلفية المحلية

# #20439
source: No fanart
ar: لاتوجد خلفية

# #20440
source: Current fanart
ar: الخلفية الحالية

# #20441
source: Remote fanart
ar: الخلفية البعيدة

# #20442
source: Change content
ar: تغيير المحتوى

# #20443
source: Do you want to refresh info for all
ar: هل تريد تحديث كافة البيانات؟

# #20444
source: items within this path?
ar: العناصر في هذا المسار؟

# #20446
source: Locally stored information found.
ar: .العثور على معلومات محلية

# #20447
source: Ignore and refresh from internet?
ar: تجاهل وحدث من الإنترنت؟

# #20448
source: Could not download information
ar: لايمكن تحميل المعلومات

# #20449
source: Unable to connect to remote server
ar: غير قادر على الاتصال بالخادم البعيد

# #20450
source: Would you like to continue scanning?
ar: هل تريد الاستمرار في الفحص؟

# #20451
source: Countries
ar: الدول

# #20452
source: episode
ar: الحلقة

# #20453
source: episodes
ar: الحلقات

# #20454
source: Listener
ar: المستمع

# #20455
source: Listeners
ar: المستمعين

# #20456
source: Set movieset fanart
ar: تعيين خلفية الفلم Fanart

# #20457
source: Movie set
ar: تعيين الفلم

# #20458
source: Group movies in sets
ar: ضع الأفلام في مجموعات

# #20459
source: Tags
ar: علامات

# #20460
source: Add %s
ar: إضافة %s

# #20461
source: Remove %s
ar: إزالة %s

# #20462
source: New tag...
ar: علامة جديدة

# #20463
source: A tag with the name '%s' already exists.
ar: علامة بالاسم '%s' موجود أصلا.

# #20464
source: Select %s
ar: تحديد %s

# #21330
source: Show hidden files and directories
ar: إظهار الملفات المخفية والدلائل

# #21331
source: TuxBox client
ar: TuxBox عميل

# #21332
source: WARNING: Target TuxBox device is in recording-mode!
ar: ليس في وضع التسجيل TuxBox تحذير: جهاز

# #21333
source: The stream will be stopped!
ar: !سيتم إيقاف البث

# #21334
source: Zap to channel: %s failed!
ar: !فشل %s :الانتقال الى القناة

# #21335
source: Are you sure to start the stream?
ar: هل أنت متأكد لبدأ البث؟

# #21336
source: Connecting to: %s
ar: %s :يتصل الى

# #21337
source: TuxBox device
ar: TuxBox جهاز

# #21359
source: Add media share...
ar: إضافة مشاركة الوسائط...

# #21360
source: Share video and music libraries through UPnP
ar: UPnP مشاركة الفيديو والموسيقى عبر

# #21364
source: Edit media share
ar: تحرير مشاركة الوسائط

# #21365
source: Remove media share
ar: إزالة مشاركة الوسائط

# #21366
source: Subtitle folder
ar: مجلد الترجمة

# #21367
source: Movie & alternate subtitle directory
ar: دليل ترجمة الفيديو البديل

# #21368
source: Override ASS/SSA subtitles fonts
ar: ASS / SSA تجاوز خطوط الترجمات

# #21369
source: Enable mouse and Touch Screen support
ar: تمكين دعم الفأره وشاشة اللمس

# #21370
source: Play navigation sounds during media playback
ar: تشغيل أصوات التنقل أثناء تشغيل الوسائط

# #21371
source: Thumbnail
ar: المصغرة

# #21372
source: Forced DVD player region
ar: تحديد منطقة مشغل الدي في دي

# #21373
source: Video output
ar: مخرج الفيديو

# #21374
source: Video aspect
ar: حجم الفيديو

# #21375
source: Normal
ar: عادي

# #21376
source: Letterbox
ar: الرسائل

# #21377
source: Widescreen
ar: شاشة عريضة

# #21378
source: Enable 480p
ar: 480P تمكين

# #21379
source: Enable 720p
ar: 7200P تمكين

# #21380
source: Enable 1080i
ar: 1080i تمكين

# #21381
source: Enter name of new playlist
ar: أدخل اسم قائمة تشغيل الجديدة

# #21382
source: Show "Add source" buttons in file lists
ar: إظهار أزرار"إضافة مصدر" في قوائم الملفات

# #21383
source: Enable scrollbars
ar: تكمين أشرطة التمرير

# #21385
source: Open
ar: فتح

# #21386
source: Acoustic management level
ar: مستوى الإدارة الصوتية

# #21387
source: Fast
ar: سريع

# #21388
source: Quiet
ar: هادئة

# #21389
source: Enable custom background
ar: تمكين خلفية مخصصة

# #21390
source: Power management level
ar: إدارة مستوى الطاقة

# #21391
source: High power
ar: طاقة عالية

# #21392
source: Low power
ar: طاقة منخفضة

# #21393
source: High standby
ar: احتياطية عالية

# #21394
source: Low standby
ar: احتياطية منخفضة

# #21395
source: Unable to cache files bigger than 4GB
ar: لا يمكن تخزين مؤقت لملفات أكبر من 4 غيغابايت

# #21396
source: Chapter
ar: الفصل

# #21397
source: High quality pixel shader v2
ar: مظلل البيكسل بجودة علية v2

# #21398
source: Enable playlist at startup
ar: مضلل بكسل عالي الجودة

# #21399
source: Use tween animations
ar: استخدام الرسوم المتحركة

# #21400
source: contains
ar: يحتوي على

# #21401
source: does not contain
ar: لا يحتوي على

# #21402
source: is
ar: انه

# #21403
source: is not
ar: ليس

# #21404
source: starts with
ar: يبدأ

# #21405
source: ends with
ar: ينتهي

# #21406
source: greater than
ar: أكبر من

# #21407
source: less than
ar: أقل من

# #21408
source: after
ar: بعد

# #21409
source: before
ar: قبل

# #21410
source: in the last
ar: الاخير

# #21411
source: not in the last
ar: لم يدم

# #21412
source: Scrapers
ar: الكاشطات

# #21413
source: Default movie scraper
ar: كاشط الفيلم الافتراضي

# #21414
source: Default tvshow scraper
ar: كاشط البرنامج التلفزيوني الافتراضي

# #21415
source: Default music video scraper
ar: كاشط الموسيقى الافتراضي

# #21417
source: - Settings
ar: الإعدادت

# #21418
source: Multilingual
ar: متعددة اللغات

# #21419
source: No scrapers present
ar: لاتوجد مكشطة حالية

# #21420
source: Value to match
ar: تعديل قيمة

# #21421
source: Smart playlist rule
ar: قاعدة الأغاني الذكية

# #21422
source: Match items where
ar: ضبط العناصر في

# #21423
source: New rule...
ar: قانون جديد...

# #21424
source: Items must match
ar: يجب مطابقة العناصر

# #21425
source: all of the rules
ar: جميع القوانين

# #21426
source: one or more of the rules
ar: قانون واحد أو أكثر

# #21427
source: Limit to
ar: محدود

# #21428
source: No limit
ar: لايوجد حدود

# #21429
source: Order by
ar: ترتيب

# #21430
source: ascending
ar: تصاعدي

# #21431
source: descending
ar: تنازلي

# #21432
source: Edit smart playlist
ar: تحرير قائمة التشغيل الذكية

# #21433
source: Name of the playlist
ar: اسم قائمة التشغيل

# #21434
source: Find items where
ar: البحث عن العناصر في

# #21435
source: Edit
ar: - تعديل

# #21436
source: %i items
ar: %i عناصر

# #21437
source: New smart playlist...
ar: قائمة ذكية للأغاني الجديد...

# #21438
source: %c Drive
ar: %c محرك

# #21439
source: Edit party mode rules
ar: تحرير قوانين وضع الطرف

# #21440
source: Home folder
ar: المجلد الرئيسي

# #21441
source: Watched count
ar: حساب اللتي شوهدت

# #21442
source: Episode title
ar: عنوان الحلقة

# #21443
source: Video resolution
ar: دقة الفيديو

# #21444
source: Audio channels
ar: القنوات السمعية

# #21445
source: Video codec
ar: ترميز الفيديو

# #21446
source: Audio codec
ar: ترميز الصوت

# #21447
source: Audio language
ar: لغة الصوت

# #21448
source: Subtitle language
ar: لغة الترجمة

# #21449
source: Remote control sends keyboard presses
ar: التحكم عن بعد لإرسال قيم لوحة المفاتيح

# #21450
source: - Edit
ar: تعديل

# #21451
source: Internet connection required.
ar: .يتطلب اتصال بالإنترنت

# #21452
source: Get More...
ar: احصل على المزيد من...

# #21453
source: Root filesystem
ar: جذر ملف نظام

# #21454
source: Cache full
ar: ذاكرة التخزين المؤقت ممتلئة

# #21455
source: Cache filled before reaching required amount for continous playback
ar: امتلاء الذاكرة الؤقتة قبل الوصول لحجم التشغيل المطلوب

# #21456
source: External storage
ar: تخزين خارجي

# #21460
source: Subtitle location
ar: موقع الترجمة

# #21461
source: Fixed
ar: صالح

# #21462
source: Bottom of video
ar: أسفل الفيديو

# #21463
source: Below video
ar: تحت الفيديو

# #21464
source: Top of video
ar: أعلى الفيديو

# #21465
source: Above video
ar: أعلا الفيديو

# #21800
source: File name
ar: اسم الملف

# #21801
source: File path
ar: مسار الملف

# #21802
source: File size
ar: حجم الملف

# #21803
source: File date/time
ar: تاريخ/وقت الملف

# #21804
source: Slide index
ar: مؤشر شريحة
