Repository: xbmc/xbmc
Catalog: language/Arabic/strings.po
Languages: ar

# #13204
source: Last loaded profile:
ar: آخر ملف شخصي تم تحميله:

# #13205
source: Unknown
ar: غير معروف

# #13206
source: Overwrite
ar: الكتابة فوق

# #13208
source: Alarm clock
ar: المنبه

# #13209
source: Alarm clock interval (in minutes)
ar: فاصل المنبه الزمني (بالدقائق)

# #13210
source: Started, alarm in %im
ar: بدأ, المنبه في %im

# #13211
source: Alarm!
ar: المنبه!

# #13212
source: Canceled with %im%is left
ar: ألغي مع %im%is متبقيه

# #13249
source: Search for subtitles in RARs
ar: بحث الترجمات في RARs

# #13250
source: Browse for subtitle...
ar: تصفح الترجمات...

# #13251
source: Move item
ar: تحريك عنصر

# #13252
source: Move item here
ar: تحريك عنصر هنا

# #13253
source: Cancel move
ar: التراجع عن نقل

# #13270
source: Hardware:
ar: الأجهزة:

# #13271
source: CPU Usage:
ar: سرعة وحدة المعالجة المركزية:

# #13274
source: Connected, but no DNS is available.
ar: متصلة بالشبكة بدون إعدادات DNS

# #13275
source: Hard Disk
ar: القرص الثابت

# #13277
source: Storage
ar: التخزين

# #13278
source: Default
ar: الافتراضية

# #13279
source: Network
ar: الشبكة

# #13280
source: Video
ar: الفيديو

# #13281
source: Hardware
ar: الأجهزة

# #13283
source: Operating system:
ar: نظام التشغيل:

# #13284
source: CPU speed:
ar: :سرعة وحدة المعالجة المركزية

# #13286
source: Video encoder:
ar: :ترميز الفيديو

# #13287
source: Screen resolution:
ar: دقة الشاشة:

# #13292
source: A/V cable:
ar: A/V كيبل

# #13294
source: DVD region:
ar: DVD منطقة:

# #13295
source: Internet:
ar: الانترنت:

# #13296
source: Connected
ar: متصل

# #13297
source: Not connected. Check network settings.
ar: غير متصل. تحقق من إعدادات الشبكة.

# #13299
source: Target temperature
ar: درجة الحرارة المستهدفة

# #13300
source: Fan speed
ar: :سرعة المروحة

# #13301
source: Auto temperature control
ar: التحكم في درجة الحرارة تلقائيا

# #13302
source: Fan speed override
ar: السيطرة على سرعة المروحة

# #13303
source: - Fonts
ar: الخطوط

# #13304
source: Enable flipping bi-directional strings
ar: مكن جعل الأحرف

# #13305
source: Show RSS news feeds
ar: RSS إظهار أخبار

# #13306
source: Show parent folder items
ar: عرض عناصر المجلد الأصلي

# #13307
source: Track naming template
ar: إخفاء أرقام المسار

# #13308
source: Do you wish to reboot your system
ar: هل تريد إعادة تشغيل النظام الخاص بك

# #13309
source: instead of just XBMC?
ar: بدلا من مجرد XBMC?

# #13310
source: Zoom effect
ar: تأثير التكبير

# #13311
source: Float effect
ar: الأثر المتوقع

# #13312
source: Black bar reduction
ar: تخفيض الخطوط سوداء

# #13313
source: Restart
ar: إعادة تشغيل

# #13314
source: Crossfade between songs
ar: التداخل في الانتقال بين الأغاني

# #13315
source: Regenerate thumbnails
ar: تجديد المصغرات

# #13316
source: Recursive thumbnails
ar: تكرير المصغرات

# #13317
source: View slideshow
ar: مشاهدة صور العرض

# #13318
source: Recursive slideshow
ar: تكرير المصغرات

# #13319
source: Randomize
ar: عشوائي

# #13320
source: Stereo
ar: ستيريو

# #13321
source: Left only
ar: اليسار فقط

# #13322
source: Right only
ar: اليمين فقط

# #13323
source: Enable karaoke support
ar: تمكين دعم الكاريوكي

# #13324
source: Background transparency
ar: شفافية الخلفية

# #13325
source: Foreground transparency
ar: شفافية المقدمة

# #13326
source: A/V delay
ar: تأخير A/V

# #13327
source: Karaoke
ar: كاريوكي

# #13328
source: %s not found
ar: %s لم يتم العثور على.

# #13329
source: Error opening %s
ar: خطأ في فتح %s

# #13330
source: Unable to load %s
ar: غير قادر على تحميل %s

# #13331
source: Error: Out of memory
ar: خطأ : الذاكرة ممتلئة

# #13332
source: Move up
ar: تحريك لأعلى

# #13333
source: Move down
ar: تحريك لأسفل

# #13334
source: Edit label
ar: تحرير العلامة

# #13335
source: Make default
ar: تعيين كافتراضي

# #13336
source: Remove button
ar: إزالة زر

# #13340
source: Leave as is
ar: دون تغيير

# #13341
source: Green
ar: الخضراء

# #13342
source: Orange
ar: البرتقالي

# #13343
source: Red
ar: الحمراء

# #13344
source: Cycle
ar: متغير

# #13345
source: Switch LED off on playback
ar: تبديل ضوء الصمام على القراءة

# #13346
source: Movie information
ar: معلومات الفيلم

# #13347
source: Queue item
ar: انتظار عنصر

# #13348
source: Search IMDb...
ar: تصفح نوع الفيلم...

# #13349
source: Scan for new content
ar: تفحص محتوى جديد

# #13350
source: Now playing...
ar: يعرض الان...

# #13351
source: Album information
ar: معلومات الألبوم

# #13352
source: Scan item to library
ar: فحص العناصر الى المكتبة

# #13353
source: Stop scanning
ar: إيقاف التفحص

# #13354
source: Render method
ar: طريقة التقديم

# #13355
source: Low quality pixel shader
ar: مضلل بكسل ذات جودة منخفضه

# #13356
source: Hardware overlays
ar: تراكيب الأجهزة

# #13357
source: High quality pixel shader
ar: مضلل بكسل ذات جودة عالية

# #13358
source: Play item
ar: تشغيل عنصر

# #13359
source: Set artist thumb
ar: تعيين مصغرات للفنان

# #13360
source: Automatically generate thumbnails
ar: إنشاء مصغرات الصور تلقائياً

# #13361
source: Enable voice
ar: تمكين صوت

# #13375
source: Enable device
ar: تمكين جهاز

# #13376
source: Volume
ar: مقدار الصوت

# #13377
source: Default view mode
ar: وضع العرض الافتراضي

# #13378
source: Default brightness
ar: السطوع الافتراضي

# #13379
source: Default contrast
ar: التباين الافتراضي

# #13380
source: Default gamma
ar: غاما الافتراضي

# #13381
source: Resume video
ar: استئناف الفيديو

# #13382
source: Voice mask - Port 1
ar: قناع الصوت - منفذ 1

# #13383
source: Voice mask - Port 2
ar: قناع الصوت - منفذ 2

# #13384
source: Voice mask - Port 3
ar: قناع الصوت - منفذ 3

# #13385
source: Voice mask - Port 4
ar: قناع الصوت - منفذ 4

# #13386
source: Use time based seeking
ar: استخدام الوقت على أساس البحث

# #13387
source: Track naming template - right
ar: تنسيق أسماء المسار - يمين

# #13388
source: Preset
ar: مسبق

# #13389
source: There are no presets available for this visualization
ar: لا توجد قيم مسبقة متاحة لهذا التصور

# #13390
source: There are no settings available for this visualization
ar: لا توجد إعدادات متاحة لهذا التصور

# #13391
source: Eject/Load
ar: إخراج/تحميل

# #13392
source: Use visualization if playing audio
ar: استخدام التصور في حالة تشغيل الصوت

# #13393
source: Calculate size
ar: حساب الحجم

# #13394
source: Calculating folder size
ar: حساب حجم المجلد

# #13395
source: Video settings
ar: إعدادات الفيديو

# #13396
source: Audio and subtitle settings
ar: إعدادات الصوت والترجمة

# #13397
source: Enable subtitles
ar: تمكين الترجمات

# #13398
source: Shortcuts
ar: الاختصارات

# #13399
source: Ignore articles when sorting (e.g. "the")
ar: تجاهل المقالات عند الفرز ("The")

# #13400
source: Crossfade between songs on the same album
ar: التداخل بين الأغاني في الألبوم نفسه

# #13401
source: Browse for %s
ar: %s تصفح لـ

# #13402
source: Show track position
ar: إظهار موضع المسار

# #13403
source: Clear default
ar: إزالة الافتراضيات

# #13404
source: Resume
ar: استئناف

# #13405
source: Get thumb
ar: احصل عل مصغرة

# #13406
source: Picture information
ar: معلومات الصورة

# #13407
source: %s presets
ar: %sالنسب المئوية المسبقة

# #13408
source: (IMDb user rating)
ar: (IMDB تصنيف المستخدم)

# #13409
source: Top 250
ar: أفضل 250

# #13410
source: Tune in on Last.fm
ar: السماع إلى LAST.FM

# #13411
source: Minimum fan speed
ar: سرعة المروحة الدنيا

# #13412
source: Play from here
ar: شغل من هنا

# #13413
source: Downloading
ar: تحميل

# #13414
source: Include artists who appear only on compilations
ar: يشمل مجموعات الفنانين فقط

# #13415
source: Render method
ar: طريقة التقديم

# #13416
source: Auto detect
ar: كشف تلقائيا

# #13417
source: Basic shaders (ARB)
ar: (ARB) تظليل أساسي

# #13418
source: Advanced shaders (GLSL)
ar: (GLSL) تظليل متقدم

# #13419
source: Software
ar: برنامج

# #13420
source: Remove safely
ar: إزالة بأمان

# #13422
source: Start slideshow here
ar: ابدأ عرض شرائح من هنا

# #13423
source: Remember for this path
ar: تذكر هذا المسار

# #13424
source: Use pixel buffer objects
ar: استخدم مواضيع البكسل العازلة

# #13425
source: Allow hardware acceleration (VDPAU)
ar: تمكين تسارع (VDPAU)

# #13426
source: Allow hardware acceleration (VAAPI)
ar: تمكين تسارع (VAAPI)

# #13427
source: Allow hardware acceleration (DXVA2)
ar: تمكين تسارع (DXVA2)

# #13428
source: Allow hardware acceleration (CrystalHD)
ar: تمكين تسارع (CrystalHD)

# #13429
source: Allow hardware acceleration (VDADecoder)
ar: تمكين تسارع (VDADecoder)

# #13430
source: Allow hardware acceleration (OpenMax)
ar: تمكين تسارع (OpenMax)

# #13431
source: Pixel Shaders
ar: مظلل البيكسل

# #13432
source: Allow hardware acceleration (VideoToolbox)
ar: تمكين تسارع (VideoToolbox)

# #13500
source: A/V sync method
ar: تزامن أسلوب تشغيل الشاشة

# #13501
source: Audio clock
ar: ساعة الصوت

# #13502
source: Video clock (Drop/Dupe audio)
ar: ساعة الفيديو(صوت سقوط/خداع)

# #13503
source: Video clock (Resample audio)
ar: ساعة الفيديو(إعادة تشكيل الصوت)

# #13504
source: Maximum resample amount (%)
ar: أقصى كمية إعادة التشكيل (%)

# #13505
source: Resample quality
ar: إعادة تشكيل الجودة

# #13506
source: Low(fast)
ar: منخفض (سريع)

# #13507
source: Medium
ar: متوسط

# #13508
source: High
ar: مرتفع

# #13509
source: Really high(slow!)
ar: مرتفع جداً (slow!)

# #13510
source: Sync playback to display
ar: مزامنة التشغيل إلى الشاشة

# #13550
source: Pause during refresh rate change
ar: وقف عند تغيير معدل التحديث

# #13551
source: Off
ar: معطلة

# #13552
source: %.1f Second
ar: %.if ثانية

# #13553
source: %.1f Seconds
ar: %.if ثواني

# #13600
source: Apple remote
ar: Apple ريموت

# #13602
source: Allow start of XBMC using the remote
ar: تمكين تشغيل XBMC بواسطة الريموت

# #13603
source: Sequence delay time
ar: تسلسل تأخير الوقت

# #13610
source: Disabled
ar: معطلة

# #13611
source: Standard
ar: قياسي

# #13612
source: Universal Remote
ar: ريموت شامل

# #13613
source: Multi Remote (Harmony)
ar: ريموت متعدد (متوافق)

# #13620
source: Apple Remote Error
ar: خطأ ريموت أبل

# #13621
source: Apple Remote support could be enabled.
ar: تحكمابل عن بعد قد يكون مفعل

# #14000
source: Stack
ar: مكدس

# #14001
source: Unstack
ar: غير مكدس

# #14003
source: Downloading playlist file...
ar: تحميل ملف قائمة التشغيل...

# #14004
source: Downloading streams list...
ar: تحميل قائمة البث...

# #14005
source: Parsing streams list...
ar: تحليل قائمة البث...

# #14006
source: Downloading streams list failed
ar: فشل تحميل قائمة البث

# #14007
source: Downloading playlist file failed
ar: فشل تحميل ملف قائمة التشغيل

# #14009
source: Games directory
ar: دليل الألعاب

# #14010
source: Auto switch to thumbs based on
ar: تنقل آلي للمصغرات استنادا على

# #14011
source: Enable auto switching to thumbs view
ar: تمكين التنقل الى عرض المصغرات تلقائيا

# #14012
source: - Use large icons
ar: - استخدام رموز كبيرة

# #14013
source: - Switch based on
ar: - تغيير استنادا على

# #14014
source: - Percentage
ar: - في المئة

# #14015
source: No files and at least one thumb
ar: لا توجد ملفات وعلى الأقل صورة مصغرة واحدة

# #14016
source: At least one file and thumb
ar: ​​على الأقل ملف واحد وصورة مصغرة

# #14017
source: Percentage of thumbs
ar: نسبة المصغرات

# #14018
source: View options
ar: عرض الخيارات

# #14019
source: Change area code 1
ar: تغيير منطقة الرمز 1

# #14020
source: Change area code 2
ar: تغيير منطقة الرمز 2

# #14021
source: Change area code 3
ar: تتغيير منطقة الرمز 3

# #14022
source: Library
ar: المكتبة

# #14023
source: No TV
ar: لا يوجد تلفزيون

# #14024
source: Enter the nearest large town
ar: أدخل أقرب مدينة كبيرة

# #14025
source: Video/Audio/DVD cache - Harddisk
ar: التخزين المؤقت للفيديو/الصوت/دي في دي - القرص الصلب

# #14026
source: Video cache - DVD-ROM
ar: التخزين المؤقت للفيديو - DVD-ROM

# #14027
source: - Local Network
ar: - الشبكة المحلية

# #14028
source: - Internet
ar: - الإنترنت

# #14030
source: Audio cache - DVD-ROM
ar: التخزين المؤقت للصوت - DVD-ROM

# #14031
source: - Local Network
ar: - الشبكة المحلية

# #14032
source: - Internet
ar: - الإنترنت

# #14034
source: DVD cache - DVD-ROM
ar: DVD التخزين المؤقت لـ - DVD-ROM

# #14035
source: - Local Network
ar: - الشبكة المحلية

# #14036
source: Services
ar: الخدمات

# #14038
source: Network settings changed
ar: تم ضبط إعدادات الشبكة

# #14039
source: XBMC requires to restart to change your
ar: XBMC يتطلب إعادة تشغيل لتغيير

# #14040
source: network setup. Would you like to restart now?
ar: ضبط الشبكة. هل ترغب في إعادة التشغيل الآن؟

# #14041
source: Internet connection bandwidth limitation
ar: نطاق الاتصال بالانترنت محدود

# #14043
source: - Shutdown while playing
ar: - إغلاق أثناء التشغيل

# #14044
source: %i min
ar: %i دقيقة

# #14045
source: %i sec
ar: %i ثانية

# #14051
source: Time format
ar: تهيئة الوقت

# #14052
source: Date format
ar: تهيئة التاريخ

# #14053
source: GUI filters
ar: فلاتر واجهة المستخدم الرسومية

# #14055
source: Use background scanning
ar: استخدام فحص الخلفية

# #14056
source: Stop scan
ar: إيقاف الفحص

# #14057
source: Not possible while scanning for media info
ar: غير ممكن أثناء الفحص على معلومات الوسائط

# #14058
source: Film grain effect
ar: تأثير طبعة الفلم

# #14059
source: Search for thumbnails on remote shares
ar: البحث عن المصغرات في المشاركات البعيدة

# #14060
source: Unknown type cache - Internet
ar: التخزين المؤقت لأنواع غير معروفة - الانترنت

# #14061
source: Auto
ar: التلقائية

# #14062
source: Enter username for
ar: أدخل اسم المستخدم لـ

# #14063
source: Date & time
ar: التاريخ والوقت

# #14064
source: Set date
ar: تعيين التاريخ

# #14065
source: Set time
ar: تعيين الوقت

# #14066
source: Enter the time in 24 hour HH:MM format
ar: HH : MM تنسيق دخول الوقت 24 ساعة

# #14067
source: Enter the date in DD/MM/YYYY format
ar: DD / MM / YYYY تنسيق دخول التاريخ

# #14068
source: Enter the IP address
ar: IP أدخل عنوان

# #14069
source: Apply these settings now?
ar: تغيير الإعدادات الآن؟

# #14070
source: Apply changes now
ar: إجراء التغييرات الآن

# #14071
source: Allow file renaming and deletion
ar: سماح تسمية وحذف الملف

# #14074
source: Set timezone
ar: تعيين التوقيت

# #14075
source: Use daylight saving time
ar: استخدام التوقيت الصيفي

# #14076
source: Add to favourites
ar: أضف إلى المفضلة

# #14077
source: Remove from favourites
ar: إزالة من المفضلة

# #14078
source: - Colours
ar: الألوان

# #14079
source: Timezone country
ar: دولة المنطقة الزمنية

# #14080
source: Timezone
ar: المنطقة الزمنية

# #14081
source: File lists
ar: قوائم الملف

# #14082
source: Show EXIF picture information
ar: عرض معلومات صور EXIF

# #14083
source: Use a fullscreen window rather than true fullscreen
ar: استخدام نافذة الشاشة الكاملة بدلا من ملء الشاشة الحقيقية

# #14084
source: Queue songs on selection
ar: انتظار الأغاني المختارة

# #14086
source: Playback
ar: توليف

# #14088
source: Play DVDs automatically
ar: تشغيل الدي في دي تلقائياً

# #14089
source: Font to use for text subtitles
ar: استخدام الخط في ترجمات النص

# #14090
source: International
ar: دولي

# #14091
source: Character set
ar: تعيين الأحرف

# #14092
source: Debugging
ar: التصحيح

# #14093
source: Security
ar: الأمن

# #14094
source: Input devices
ar: أجهزة الإدخال

# #14095
source: Power saving
ar: توفير الطاقة

# #14096
source: Rip
ar: مزق

# #14097
source: Audio CD Insert Action
ar: إدراج قرص صوتي

# #14098
source: Play
ar: تشغيل

# #14099
source: Eject disc when CD ripping is complete
ar: إخراج القرص المدمج عند الإنتهاء من النسخ

# #15015
source: Remove
ar: إزالة

# #15016
source: Games
ar: ​​الألعاب

# #15019
source: Add
ar: إضافة

# #15052
source: Password
ar: كلمة المرور

# #15100
source: Library
ar: المكتبة

# #15101
source: Database
ar: قاعدة البيانات

# #15102
source: * All albums
ar: * جميع الألبومات

# #15103
source: * All artists
ar: * جميع الفنانين

# #15104
source: * All songs
ar: * جميع الأغاني

# #15105
source: * All genres
ar: * جميع الأنواع

# #15107
source: Buffering...
ar: تخزين ...

# #15108
source: Navigation sounds
ar: أصوات التنقل

# #15109
source: Skin default
ar: الغلاف الافتراضي

# #15111
source: - Theme
ar: السمات

# #15112
source: Default theme
ar: السمة الافتراضية

# #15201
source: Submit songs to Last.fm
ar: Last.fm إرسال الأغاني إلى

# #15202
source: Last.fm username
ar: Last.fm اسم مستخدم

# #15203
source: Last.fm password
ar: Last.fm كلمة مرور

# #15204
source: Unable to handshake: sleeping...
ar: يستعد :غير قادر للتبادل...

# #15205
source: Please update XBMC
ar: XBMC يرجى تحديث

# #15206
source: Bad authorization: Check username and password
ar: ترخيص سيئ: تحقق من اسم المستخدم وكلمة السر

# #15207
source: Connected
ar: متصل

# #15208
source: Not connected
ar: غير متصل

# #15209
source: Submit interval %i
ar: %i إرسال التأخير

# #15210
source: Cached %i songs
ar: الأغاني %i المخزنة مؤقتا

# #15211
source: Submitting...
ar: إرسال...

# #15212
source: Submitting in %i secs
ar: ثواني %i إرسال في

# #15213
source: Play using...
ar: التشغيل باستخدام...

# #15214
source: Use smoothed A/V synchronization
ar: ممهدة A/V استخدام مزامنة

# #15215
source: Hide file names in thumbs view
ar: إخفاء أسماء الملف في عرض المصغرات

# #15216
source: Play in party mode
ar: تشغيل في وضع الطرف

# #15217
source: Submit songs to Libre.fm
ar: Libre.fm إرسال الأغاني إلى

# #15218
source: Libre.fm username
ar: Libre.fm اسم مستخدم

# #15219
source: Libre.fm password
ar: Libre.fm كلمة مرور

# #15221
source: Song submission
ar: إرسال الأغاني...

# #15250
source: Submit Last.fm radio to Last.fm
ar: ...Last.fm إلى إذاعة Last.fm إرسال

# #15251
source: Connecting to Last.fm...
ar: Last.fm يتصل...

# #15252
source: Selecting station...
ar: اختيار المحطة...

# #15253
source: Search similar artists...
ar: البحث عن فنانين مماثلين...

# #15254
source: Search similar tags...
ar: البحث عن شعارات مماثلة...

# #15255
source: Your profile (%name%)
ar: (%name%) ملفك الشخصي

# #15256
source: Overall top tags
ar: المراكز الأولى

# #15257
source: Top artists for tag %name%
ar: %name% علامة أفضل المغنين

# #15258
source: Top albums for tag %name%
ar: %name% علامة أفضل الألبومات

# #15259
source: Top tracks for tag %name%
ar: %name% علامة أفضل المسارات

# #15260
source: Listen to tag %name% Last.fm radio
ar: Last.fm في اذاعة %name% استمع الى علامة

# #15261
source: Similar artists as %name%
ar: %name% فنانين ممثالين مثل

# #15262
source: Top %name% albums
ar: البومات %name% أفضل

# #15263
source: Top %name% tracks
ar: مسارات %name% أفضل

# #15264
source: Top %name% tags
ar: شعارات %name% أفضل

# #15265
source: Biggest fans of %name%
ar: %name% أكبر المعجبين من

# #15266
source: Listen to %name% fans Last.fm radio
ar: Last.fm المعجبين في اذاعة %name% استمع الى

# #15267
source: Listen to %name% similar artists Last.fm radio
ar: Last.fm فنانين مماثلين في اذاعة %name% استمع الى

# #15268
source: Top artists for user %name%
ar: %name% أفضل الفنانين للمستخدم

# #15269
source: Top albums for user %name%
ar: %name% أفضل الألبومات

# #15270
source: Top tracks for user %name%
ar: %name% أفضل المسارات للمستخدم

# #15271
source: Friends of user %name%
ar: %name% أصدقاء للمستخدم

# #15272
source: Neighbours of user %name%
ar: %name% جيران للمستخدم

# #15273
source: Weekly artist chart for %name%
ar: %name% خريطة الفنان الاسبوعية

# #15274
source: Weekly album chart for %name%
ar: %name% خريطة الألبوم الاسبوعية

# #15275
source: Weekly track chart for %name%
ar: %name% خريطة المسار الاسبوعية

# #15276
source: Listen to %name%'s neighbours Last.fm radio
ar: Last.fm الجيران في اذاعة %name%'s استمع الى

# #15277
source: Listen to %name%'s personal Last.fm radio
ar: Last.fm الشخصية في اذاعة %name%'s استمع الى

# #15278
source: Listen to %name%'s mix Last.fm radio
ar: Last.fm ميكس في اذاعة %name%'s استمع الى

# #15279
source: Retrieving list from Last.fm...
ar: Last.fm حصول القائمة من...

# #15280
source: Can't retrieve list from Last.fm...
ar: Last.fm لا يمكن حصول القائمة من...

# #15281
source: Enter an artist name to find related ones
ar: إدخال اسم فنان للعثورعلى افنانين مماثلين

# #15282
source: Enter a tag name to find similar ones
ar: إدخال علامة للعثور على أغاني مشابهة

# #15283
source: Tracks recently listened by %name%
ar: %name% اخر المسارات استمعت بواسطة

# #15284
source: Listen to %name%'s recommendations Last.fm radio
ar: Last.fm التوصيات في اذاعة %name%'s استمع الى

# #15285
source: Top tags for user %name%
ar: أعلى كلمات دلالية للمستخدم %name%

# #15287
source: Do you want to add the current track to your loved tracks?
ar: هل تريد إضافة القائمة الحالية للمسارات المفضلة؟

# #15288
source: Do you want to ban the current track?
ar: هل تريد مقاطعة الأغنية الحالية؟

# #15289
source: Added to your loved tracks: '%s'.
ar: .'%s' أضيفت الى الأغاني المفضلة

# #15290
source: Could not add '%s' to your loved tracks.
ar: .لمساراتك المفضلة '%s' لا يمكن إضافة

# #15291
source: Banned: '%s'.
ar: '%s' :حظر

# #15292
source: Could not ban '%s'.
ar: .'%s' لا يمكن حظر

# #15293
source: Tracks recently loved by %name%
ar: %name% اخر المسارات مفضلة بواسطة

# #15294
source: Tracks recently banned by %name%
ar: %name% اخر المسارات حظرت بواسطة

# #15295
source: Remove from loved tracks
ar: ازالة مة المسارات المفضلة

# #15296
source: Un-ban
ar: الغاء الحظر

# #15297
source: Do you want to remove this track from your loved tracks?
ar: هل تريد إزالة المسار من الأغاني المفضلة لديك؟

# #15298
source: Do you want to un-ban this track?
ar: هل تريد إلغاء حظر الأغنية؟

# #15300
source: Path not found or invalid
ar: لم يتم العثور على المسار أو غير صالح

# #15301
source: Could not connect to network server
ar: لم يتم العثور على خادم

# #15302
source: No servers found
ar: لم يتم العثور على الملقم

# #15303
source: Workgroup not found
ar: لم يتم العثورعلى مجموعة العمل

# #15310
source: Opening multi-path source
ar: جاري فتح مصدر متعدد المسارات

# #15311
source: Path:
ar: :المسار

# #16000
source: General
ar: عام

# #16002
source: Internet lookup
ar: بحث الويب

# #16003
source: Player
ar: المشغل

# #16004
source: Play media from disc
ar: تشغيل الوسائط من القرص

# #16008
source: Enter new title
ar: إدخال عنوان جديد

# #16009
source: Enter the movie name
ar: أدخل اسم الفلم

# #16010
source: Enter the profile name
ar: أدخل لسم ملفك الشخصي

# #16011
source: Enter the album name
ar: أدخل اسم الألبوم

# #16012
source: Enter the playlist name
ar: أدخل اسم قائمة التشغيل

# #16013
source: Enter new filename
ar: أدخل اسم الملف الجديد

# #16014
source: Enter folder name
ar: أدخل اسم المجلد

# #16015
source: Enter directory
ar: أدخل الدليل

# #16016
source: Available options: %A, %T, %N, %B, %D, %G, %Y, %F, %S
ar: %A, %T, %N, %B, %D, %G, %Y, %F, %S الخيارات المتاحة:

# #16017
source: Enter search string
ar: أدخل نص البحث

# #16018
source: None
ar: بلا

# #16019
source: Auto select
ar: اختيار تلقائي

# #16020
source: De-interlace
ar: تشابك

# #16021
source: Bob
ar: بوب

# #16022
source: Bob (inverted)
ar: بوب مزدوج

# #16024
source: Canceling...
ar: يلغي...

# #16025
source: Enter the artist name
ar: أدخل اسم الفنان

# #16026
source: Playback failed
ar: فشل القراءة

# #16027
source: One or more items failed to play.
ar: فشل قراءة عنصر واحد أو أكثر

# #16028
source: Enter value
ar: إدخال قيمة

# #16029
source: Check the log file for details.
ar: سجل التحقق

# #16030
source: Party mode aborted.
ar: تم إلغاء وضع الطرف

# #16031
source: No matching songs in the library.
ar: .لا توجد أغاني مطابقة في المكتبة

# #16032
source: Could not initialize database.
ar: لم يتمكن من تهيئة قاعدة بيانات

# #16033
source: Could not open database.
ar: .لم يتمكن من فتح قاعدة بيانات

# #16034
source: Could not get songs from database.
ar: لم يتمكن الحصول على الأغاني من قاعدة البيانات

# #16035
source: Party mode playlist
ar: قائمة تشغيل وضع الطرف

# #16036
source: De-interlace (Half)
ar: تشابك(نصف)

# #16037
source: Deinterlace video
ar: تشابك فيديو

# #16038
source: Deinterlace method
ar: تشابك طريقة

# #16039
source: Off
ar: معطلة

# #16040
source: Auto
ar: التلقائية

# #16041
source: On
ar: النشطة

# #16100
source: All Videos
ar: كل الفيديو

# #16101
source: Unwatched
ar: غير مشاهدة

# #16102
source: Watched
ar: شوهدت

# #16103
source: Mark as watched
ar: أشر إليها على أنها شوهدت

# #16104
source: Mark as unwatched
ar: أشر إليها على أنها لم تشاهد
