Repository: xbmc/xbmc
Catalog: language/Arabic/strings.po
Languages: ar

# #21805
source: Resolution
ar: الدقة

# #21806
source: Comment
ar: التعليقات

# #21807
source: Colour/B&W
ar: أسود/أبيض اللون

# #21808
source: JPEG process
ar: عملية JPEG

# #21820
source: Date/Time
ar: الوقت/التاريخ

# #21821
source: Description
ar: الوصف

# #21822
source: Camera make
ar: الشركة المصنعة للكاميرا

# #21823
source: Camera model
ar: طراز الكاميرا

# #21824
source: EXIF comment
ar: EXIF ​​تعليق

# #21825
source: Firmware
ar: الثابتة

# #21826
source: Aperture
ar: الفتحة

# #21827
source: Focal length
ar: البؤري

# #21828
source: Focus distance
ar: مسافة التركيز

# #21829
source: Exposure
ar: التعرض

# #21830
source: Exposure time
ar: وقت التعرض

# #21831
source: Exposure bias
ar: كشف انحياز

# #21832
source: Exposure mode
ar: نمط التعرض

# #21833
source: Flash used
ar: الفلاش المستخدمة

# #21834
source: White-balance
ar: موازنة البياض

# #21835
source: Light source
ar: مصدر الضوء

# #21836
source: Metering mode
ar: وضع القياس

# #21838
source: Digital zoom
ar: التقريب الرقمي

# #21839
source: CCD width
ar: CCD عرض

# #21840
source: GPS latitude
ar: GPS خطوط عرض

# #21841
source: GPS longitude
ar: GPS خطوط طول

# #21842
source: GPS altitude
ar: GPS ارتفاع

# #21843
source: Orientation
ar: التوجه

# #21860
source: Supplemental categories
ar: أكثر الفئات

# #21861
source: Keywords
ar: كلمات دالة

# #21862
source: Caption
ar: تفسير الكلمات

# #21863
source: Author
ar: الكاتب

# #21864
source: Headline
ar: العنوان

# #21865
source: Special instructions
ar: تعليمات خاصة

# #21866
source: Category
ar: الفئات

# #21867
source: Byline
ar: الخط الثانوي

# #21868
source: Byline title
ar: عنوان الخط الثانوي

# #21869
source: Credit
ar: الائتمان

# #21870
source: Source
ar: المصدر

# #21871
source: Copyright notice
ar: حقوق التأليف

# #21872
source: Object name
ar: اسم الكائن

# #21873
source: City
ar: المدينة

# #21874
source: State
ar: البلد

# #21875
source: Country
ar: البلد

# #21876
source: Original Tx Reference
ar: إشارة TX أصلية

# #21877
source: Date created
ar: تاريخ الإنشاء

# #21878
source: Copyright flag
ar: علم حقوق المؤلف

# #21879
source: Country code
ar: رمز البلد

# #21880
source: Reference service
ar: خدمة إشارة

# #21881
source: Allow control of XBMC via UPnP
ar: UPnP عبر XBMC سماح تحكم

# #21882
source: Attempt to skip introduction before DVD menu
ar: DVD محاولة لتخطي الادوار التمهيدية قبل قائمة

# #21883
source: Saved music
ar: الموسيقى المحفوظة

# #21884
source: Query info for all artists
ar: تحقق لجميع الفنانين

# #21885
source: Downloading album information
ar: تحميل معلومات الألبوم

# #21886
source: Downloading artist information
ar: تحميل معلومات الفنان

# #21887
source: Biography
ar: السيرة الذاتية

# #21889
source: Searching artist
ar: يبحث عن فنان

# #21890
source: Select artist
ar: اختر الفنان

# #21891
source: Artist information
ar: معلومات الفنان

# #21892
source: Instruments
ar: آلات

# #21893
source: Born
ar: ولد

# #21894
source: Formed
ar: أنشأ

# #21895
source: Themes
ar: مواضيع

# #21896
source: Disbanded
ar: صرف النظر

# #21897
source: Died
ar: توفي

# #21898
source: Years active
ar: سنوات النشاط

# #21899
source: Label
ar: شركة الإنتاج

# #21900
source: Born/Formed
ar: ولد / أنشأ

# #22000
source: Update library on startup
ar: تحديث المكتبة عند بدء تشغيل

# #22001
source: Hide progress of library updates
ar: إخفاء تحديث المكتبة في الخلفية

# #22002
source: - DNS suffix
ar: لاحقة DNS

# #22004
source: Delayed by: %2.3fs
ar: متأخر بـ: %2.3fs

# #22005
source: Ahead by: %2.3fs
ar: متقدم بـ: %2.3fs

# #22006
source: Subtitle offset
ar: موازنة الترجمة

# #22007
source: OpenGL vendor:
ar: مزود OpenGL:

# #22008
source: OpenGL renderer:
ar: عارض GL مفتوح

# #22009
source: OpenGL version:
ar: نسخة OpenGL:

# #22010
source: GPU temperature:
ar: درجة حرارة CPU:

# #22011
source: CPU temperature:
ar: درجة حرارة GPU:

# #22012
source: Total memory
ar: إجمالي الذاكرة

# #22013
source: Profile data
ar: البيانات الشخصية

# #22014
source: Use dim if paused during video playback
ar: استخدام التعتيم عند التوقف أثناء تشغيل الفيديو

# #22015
source: All recordings
ar: جميع التسجيلات

# #22016
source: By title
ar: ​​حسب العنوان

# #22017
source: By group
ar: حسب المجموعة

# #22018
source: Live channels
ar: قنوات مباشرة

# #22019
source: Recordings by title
ar: تسجيل حسب العنوان

# #22020
source: Guide
ar: الدليل

# #22021
source: Allowed error in aspect ratio to minimize black bars
ar: سماح الأخطاء في ما يتعلق بنسبة الجوانب وذلك للحد من الخطوط السوداء

# #22022
source: Show video files in listings
ar: عرض ملفات الفيديو في قوائم

# #22023
source: DirectX vendor:
ar: :DirectX مزود

# #22024
source: Direct3D version:
ar: :Direct3D نسخة

# #22030
source: Font
ar: الخط

# #22031
source: - Size
ar: الحجم

# #22032
source: - Colours
ar: الألوان

# #22033
source: - Charset
ar: تعيين الأحرف

# #22034
source: Export karaoke titles as HTML
ar: HTML تصدير عناوين الكاريوكي مثل

# #22035
source: Export karaoke titles as CSV
ar: CSV تصدير عناوين الكاريوكي مثل

# #22036
source: Import karaoke titles...
ar: استيراد عناوين الكاريوكي...

# #22037
source: Show song selector automatically
ar: إظهار مؤشر الأغنية تلقائياً

# #22038
source: Export karaoke titles...
ar: تصدير عناوين الكاريوكي...

# #22039
source: Enter song number
ar: أدخل رقم الأغنية

# #22040
source: white/green
ar: أبيض/أخضر

# #22041
source: white/red
ar: أبيض/أحمر

# #22042
source: white/blue
ar: أبيض/أزرق

# #22043
source: black/white
ar: أسود/أبيض

# #22079
source: Default select action
ar: اختيار الإجراء الافتراضي

# #22080
source: Choose
ar: اختر

# #22081
source: Show Information
ar: عرض المعلومات

# #22082
source: More...
ar: المزيد...

# #22083
source: Play all
ar: تشغيل الكل

# #23049
source: Teletext not available
ar: قناة المعلومات غير متاحة

# #23050
source: Activate Teletext
ar: تنشيط النص

# #23051
source: Part %i
ar: جزء %i

# #23052
source: Buffering %i bytes
ar: تخزين %i بايت

# #23053
source: Stopping
ar: توقف

# #23054
source: Running
ar: %i جزء

# #23100
source: External Player Active
ar: تنشيط المشغل الخارجي

# #23101
source: Click OK to terminate the player
ar: انقر موافق لتعطيل المشغل

# #23104
source: Click OK when playback has ended
ar: انقر موافق عند انتهاء التشغيل

# #24000
source: Add-on
ar: الملحق

# #24001
source: Add-ons
ar: الملحقات

# #24002
source: Add-on options
ar: خيارات الملحقات

# #24003
source: Add-on Information
ar: معلومات الملحقات

# #24005
source: Media sources
ar: مصادر الوسائط

# #24007
source: Movie information
ar: معلومات الفيلم

# #24008
source: Screensaver
ar: مؤقت الشاشة

# #24009
source: Script
ar: سيناريو

# #24010
source: Visualization
ar: التصور

# #24011
source: Add-on repository
ar: مخزن الملحقات

# #24012
source: Subtitles
ar: الترجمات

# #24013
source: Lyrics
ar: كلمات الأغاني

# #24014
source: TV information
ar: معلومات التلفزيون

# #24015
source: Music video information
ar: معلومات الفيديو كليب

# #24016
source: Album information
ar: معلومات الألبوم

# #24017
source: Artist information
ar: معلومات الفنان

# #24018
source: Services
ar: الخدمات

# #24019
source: PVR clients
ar: عملاء PVR

# #24020
source: Configure
ar: التكوين

# #24021
source: Disable
ar: تعطيل

# #24022
source: Enable
ar: تمكين

# #24023
source: Add-on disabled
ar: الموقع

# #24027
source: Weather
ar: الطقس

# #24028
source: Weather.com (standard)
ar: Weather.com (قياسي)

# #24030
source: This Add-on can not be configured
ar: لايمكن تعديل هذا الملحق

# #24031
source: Error loading settings
ar: خطأ في تحميل الإعدادت

# #24032
source: All Add-ons
ar: كافة الملحقات

# #24033
source: Get Add-ons
ar: احصل على إضافات...

# #24034
source: Check for updates
ar: تحقق من وجود تحديثات

# #24035
source: Force refresh
ar: تحديث

# #24036
source: Change log
ar: سجل التغييرات

# #24037
source: Uninstall
ar: إزالة التثبيت

# #24038
source: Install
ar: تثبيت

# #24039
source: Disabled Add-ons
ar: إضافات معطلة

# #24040
source: (Clear the current setting)
ar: (إزالة الإعدادات الموجودة)

# #24041
source: Install from zip file
ar: تثبيت من ملف مضغوط

# #24042
source: Downloading %i%%
ar: %i%% تحميل

# #24043
source: Available Updates
ar: التحديثات متوفرة

# #24044
source: Dependencies not met
ar: عدم توافق التطابقات

# #24045
source: Add-on does not have the correct structure
ar: تركيبة الملحق غير صحيحة

# #24046
source: %s is used by the following installed add-on(s)
ar: %s مستخدم من قبل الملحق المثبت

# #24047
source: This add-on cannot be uninstalled
ar: لايمكن إزالة هذا الملحق

# #24048
source: Rollback
ar: العودة

# #24050
source: Available Add-ons
ar: الملحقات المتوفرة

# #24051
source: Version:
ar: الإصدار:

# #24052
source: Disclaimer
ar: تنويه

# #24053
source: License:
ar: :الترخيص

# #24054
source: Changelog
ar: سجل التغييرات

# #24059
source: Would you like to enable this Add-on?
ar: هل تريد تمكين هذا الملحق؟

# #24060
source: Would you like to disable this Add-on?
ar: هل تريد تعطيل هذا الملحق؟

# #24061
source: Add-on update available!
ar: !تحديث الملحق متوفر

# #24062
source: Enabled Add-ons
ar: الملحقات المثبته

# #24063
source: Auto update
ar: التحديث التلقائي

# #24064
source: Add-on enabled
ar: الملحق المثبته

# #24065
source: Add-on updated
ar: الملحق محدث

# #24066
source: Cancel Add-on download?
ar: إلغاء تحميل الملحق؟

# #24067
source: Currently downloading Add-ons
ar: يتم تحميل الملحق حاليا

# #24068
source: Update available
ar: التحديث متوفر

# #24069
source: Update
ar: تحديث

# #24070
source: Add-on could not be loaded.
ar: لم يتمكن من تحميل الملحق

# #24071
source: An unknown error has occurred.
ar: .حدث خطأ غير معروف

# #24072
source: Settings required
ar: تتطلب إعدادات

# #24073
source: Could not connect
ar: لم يتمكن من الإتصال

# #24074
source: Needs to restart
ar: يحتاج الى إعادة تشغيل

# #24075
source: Disable
ar: تعطيل

# #24076
source: Add-on Required
ar: يتطلب ملحق

# #24080
source: Try to reconnect?
ar: محاولة إعادة الاتصال؟

# #24089
source: Add-on restarts
ar: إعادة تشغيل الملحق

# #24090
source: Lock Add-on manager
ar: قفل إدارة الملحق

# #24094
source: (current)
ar: (الحالي)

# #24095
source: (blacklisted)
ar: (القائمة السوداء)

# #24096
source: Add-on has been marked as broken in repository.
ar: ملحوظة المكونات غير صالحة في المخزن

# #24097
source: Would you like to disable it on your system?
ar: تريد تعطيله من النظام؟

# #24098
source: Broken
ar: غير صالحة

# #24099
source: Would you like to switch to this skin?
ar: هل تريد التحويل الى هذا الغلاف؟

# #24100
source: To use this feature you must download an Add-on:
ar: هل تريد التبديل الى هذه الخلفية؟

# #24101
source: Would you like to download this Add-on?
ar: هل تريد تحميل هذا الملحق؟

# #24102
source: Unable to load skin
ar: لايمكن تحميل الغلاف

# #24103
source: Skin is missing some files
ar: بعض ملفات الغلاف مفقودة

# #25000
source: Notifications
ar: الإشعارات

# #25001
source: Hide foreign
ar: غخفاء الغريب

# #25002
source: Select from all titles ...
ar: حدد من جميع العناوين,,,

# #25003
source: Show bluray menus
ar: اظهار قوائم البلوراي

# #25004
source: Play main title: %d
ar: عنوان التشغيل الرئيسي: %d

# #25005
source: Title: %d
ar: عنوان:%d

# #25006
source: Select playback item
ar: تحديد موضوع تشغيل

# #29800
source: Library Mode
ar: وضع المكتبة

# #29801
source: QWERTY keyboard
ar: QWERTY لوحة مفاتيح

# #29802
source: Passthrough Audio in use
ar: عبور الصوت مستخدم

# #33001
source: Trailer quality
ar: جودة المقطع

# #33002
source: Stream
ar: بث

# #33003
source: Download
ar: تحميل

# #33004
source: Download & play
ar: تحميل والتشغيل

# #33005
source: Download & save
ar: تحميل وحفظ

# #33006
source: Today
ar: اليوم

# #33007
source: Tomorrow
ar: غدا

# #33008
source: Saving
ar: يحفظ

# #33009
source: Copying
ar: ينسخ

# #33010
source: Set download directory
ar: تعيين مجلد التنزيلات

# #33011
source: Search duration
ar: أثناء البحث

# #33012
source: Short
ar: قصيرة

# #33013
source: Long
ar: طويلة

# #33014
source: Use DVD player instead of regular player
ar: استخدام مشغل دي في دي بدلا من المشغل العادي

# #33015
source: Ask for download before playing video
ar: اسأل للتحميل قبل تشغيل الفيديو

# #33016
source: Clips
ar: المقاطع

# #33017
source: Restart plugin to enable
ar: إعادة تشغيل الملحق لتمكينه

# #33018
source: Tonight
ar: ليلة

# #33019
source: Tomorrow Night
ar: غداً ليلاً

# #33020
source: Condition
ar: الحالة

# #33021
source: Precipitation
ar: هطول

# #33022
source: Precip
ar: هطول

# #33023
source: Humid
ar: رطب

# #33025
source: Observed
ar: ملاحظ

# #33026
source: Departure from normal
ar: خارج عن المعتاد

# #33027
source: Sunrise
ar: شروق الشمس

# #33028
source: Sunset
ar: غروب الشمس

# #33029
source: Details
ar: التفاصيل

# #33030
source: Outlook
ar: التوقعات

# #33032
source: Translate text
ar: ترجمة النص

# #33033
source: Map list %s category
ar: قائمة الخريطة %s فئة

# #33034
source: 36 Hour
ar: 36 ساعة

# #33035
source: Maps
ar: الخرائط

# #33036
source: Hourly
ar: كل ساعة

# #33037
source: Weekend
ar: نهاية الاسبوع

# #33038
source: %s day
ar: %s اليوم

# #33049
source: Alert
ar: إنذار

# #33050
source: Alerts
ar: إنذارات

# #33051
source: Choose Your
ar: اختر

# #33052
source: Check
ar: تحقق

# #33053
source: Configure the
ar: تعيين

# #33054
source: Seasons
ar: مواسم

# #33055
source: Use your
ar: استخدم

# #33056
source: Watch your
ar: شاهد

# #33057
source: Listen to
ar: الاستماع إلى

# #33058
source: View your
ar: عرض

# #33059
source: Configure the
ar: تكوين

# #33060
source: Power
ar: الطاقة

# #33061
source: Menu
ar: القائمة

# #33062
source: Play the
ar: تشغيل

# #33063
source: Options
ar: الخيارات

# #33065
source: Editor
ar: المحرر

# #33066
source: About your
ar: حول

# #33067
source: Star rating
ar: ابدأ التقييم

# #33068
source: Background
ar: الخلفية

# #33069
source: Backgrounds
ar: الخلفية

# #33070
source: Custom background
ar: خلفية مخصصة

# #33071
source: Custom backgrounds
ar: الخلفيات المخصصة

# #33072
source: View Readme
ar: Readme عرض الملف

# #33073
source: View Changelog
ar: عرض ملف سجل التغييرات

# #33074
source: This version of %s requires an
ar: يتطلب %s هذا الاصدار من

# #33075
source: XBMC revision of %s or greater to run.
ar: أو أكثر للتشغيل %s XBMC revision يتطلب

# #33076
source: Please update XBMC.
ar: XBMC يرجى تحديث

# #33077
source: No data found!
ar: !لم يتم العثور على البيانات

# #33078
source: Next page
ar: الصفحة التالية

# #33079
source: Love
ar: الحب

# #33080
source: Hate
ar: الكراهية

# #33081
source: This file is stacked, select the part you want to play from.
ar: هذا الملف ينتمي إلى كشط. حدد نقطة التشغيل

# #33082
source: Path to script
ar: مسار للنص

# #33083
source: Enable custom script button
ar: تمكين زر تخصيص نصي

# #33100
source: Failed to start
ar: فشل البدء

# #33101
source: Webserver
ar: خادم الويب

# #33102
source: Event Server
ar: خادم الحدث

# #33103
source: Remote communication server
ar: خادم الدخول عن بعد

# #33200
source: Detected New Connection
ar: كشف اتصال جديد

# #34000
source: Lame
ar: ضعيف

# #34100
source: Speaker Configuration
ar: إعداد المكبر

# #34120
source: Play GUI sounds
ar: تشغيل أصوات GUI

# #34121
source: Only when playback stopped
ar: عند توقف إعادة التشغيل فقط

# #34122
source: Always
ar: دائما

# #34123
source: Never
ar: أبداً

# #34201
source: Can't find a next item to play
ar: لا يمكن العثور على العنصر التالي للتشغيل

# #34202
source: Can't find a previous item to play
ar: لا يمكن العثور على العنصر السابق للتشغيل

# #34300
source: Failed to start zeroconf
ar: فشل تشغيل zeroconf

# #34301
source: Is Apple's Bonjour Service installed? See log for more info.
ar: هل تم تنصيب خدمة ابل بونجور؟ راجع السجل لمزيد من المعلومات.

# #34400
source: Video Rendering
ar: عرض فيديو

# #34401
source: Failed to init video filters/scalers, falling back to bilinear scaling
ar: فشل تهيئة منقي/محجم الفيديو, الفشل عائد لتحجيم ثنائي

# #34402
source: Failed to initialize audio device
ar: فشل تهيئة جهاز الصوت

# #34403
source: Check your audiosettings
ar: فحص إعدادات الصوت الخاصة بك

# #34404
source: Use gestures for navigation:
ar: استخدام إشارات للملاحة:

# #34405
source: 1 finger swipe left,right,up,down for cursors
ar: 1 حركة الإصبع يسار, يمين, فوق, تحت للمؤشرات

# #34406
source: 2 finger swipe left for backspace
ar: 2 حركة الإصبع يسار للحذف

# #34407
source: 1 finger single tap for enter
ar: 1 نقرة إصبع للإدخال

# #34408
source: 2 finger single tap or 1 finger long press for contextmenu
ar: 2 نقرة إصبع أو 1 ضغطة طويلة لقائمة السياق

# #35000
source: Peripherals
ar: الأجهزة الطرفية

# #35001
source: Generic HID device
ar: العام HID جهاز

# #35002
source: Generic network adapter
ar: محول الشبكة العام

# #35003
source: Generic disk
ar: القرص العام

# #35004
source: There are no settings available for this peripheral.
ar: .أي إعدادات لهذا الجهاز

# #35005
source: New device configured
ar: تم تعيين جهاز جديد

# #35006
source: Device removed
ar: تم إزالة الجهاز

# #35007
source: Keymap to use for this device
ar: خارطة مفاتيح للاستخدام لهذا الجهاز

# #35008
source: Keymap enabled
ar: خارطة المفاتيح ممكنة

# #35009
source: Do not use the custom keymap for this device
ar: لا تستخدم تخصيص خارطة المفاتيح لهذا الجهاز

# #35100
source: Enable joystick and gamepad support
ar: تمكين دعم المقود و لوحة اللعب

# #35500
source: Location
ar: الموقع

# #35501
source: Class
ar: التصنيف

# #35502
source: Name
ar: الاسم

# #35503
source: Vendor
ar: المزود

# #35504
source: Product ID
ar: معرف المنتج

# #36006
source: Could not open the adapter
ar: لم يتمكن من فتح المحول

# #36007
source: Devices to power on when starting XBMC
ar: XBMC تشغيل التلفزيون عند بدء

# #36008
source: Devices to power off when stopping XBMC
ar: XBMC إيقاف التلفزيون عند إيقاف

# #36009
source: Put devices in standby mode when activating screensaver
ar: وضع الأجهزة في وضع الاستعداد عند تنشيط شاشة التوقف

# #36011
source: Could not detect the CEC com port. Set it up manually.
ar: لا يمكن كشف مدخل كوم الـCEC. قم بإعداده يدويا.

# #36012
source: Could not initialise the CEC adapter. Please check your settings.
ar: لا يمكن تهيئة محول الـCEC. يرجى فحص إعداداتك.

# #36015
source: HDMI port number
ar: HDMI رقم منفذ

# #36016
source: Connected
ar: متصل

# #36017
source: Could not initialise the CEC adapter: libCEC was not found on your system.
ar: غير قادر على بدأ CEC adapter: مكتبة libCEC غير موجودة على النظام

# #36018
source: Use the TV's language setting
ar: استخدام إعدادات لغة للتلفزيون

# #36019
source: Connected to HDMI device
ar: تم الربط بجهاز عبر HDMI

# #36020
source: Make XBMC the active source when starting
ar: اجعل XBMC مصدر نشط عند البدء

# #36022
source: COM port (leave empty unless needed)
ar: مدخل COM (دعه فارغ ما لم يلزم)

# #36023
source: Configuration updated
ar: تم تحديث التكوين

# #36024
source: Failed to set the new configuration. Please check your settings.
ar: تعيين تكوين جديدة. يرجى التحقق من إعدادات

# #36025
source: Send 'inactive source' command when stopping XBMC
ar: أرسل أمر مصدر غير نشط عند توقف XBMC

# #36026
source: Put devices in standby mode when putting the PC in standby
ar: ضع الأجهزة في وضع الإستعداد عند وضع الحاسب في وضع الإستعداد

# #36027
source: This device needs servicing
ar: هذا الجهاز يحتاج إلى خدمة

# #36028
source: Ignore
ar: تجاهل

# #36029
source: When the TV is switched off
ar: عند اغلاق التلفاز

# #36030
source: Connection lost
ar: انقطع الإتصال

# #36031
source: This user does not have permissions to open the CEC adapter
ar: هذا المستخدم ليس لديه تصريح لفتح محول الـCEC

# #36032
source: The port is busy. Only one program can access the CEC adapter
ar: المدخل مشغول. برنامج واحد فقط يمكنه الوضول لمحول الـCEC

# #36033
source: Pause playback when switching to another source
ar: أوقف التشغيل مؤقتا عند التبديل لمصدر اخر

# #36035
source: Always
ar: دائما

# #36036
source: On start/stop
ar: إبدأ/توقف
