Repository: xbmc/xbmc
Catalog: language/Arabic/strings.po
Languages: ar

# #16105
source: Edit title
ar: تحرير عنوان

# #16200
source: Operation was aborted
ar: تم إحباط التشغيل

# #16201
source: Copy failed
ar: فشل النسخ

# #16202
source: Failed to copy at least one file
ar: فشل في نسخ ملف واحد على الأقل

# #16203
source: Move failed
ar: فشل النقل

# #16204
source: Failed to move at least one file
ar: فشل في نقل ملف واحد على الأقل

# #16205
source: Delete failed
ar: فشل الحذف

# #16206
source: Failed to delete at least one file
ar: فشل في حذف ملف واحد على الأقل

# #16300
source: Video scaling method
ar: فيديو طريقة تصوير

# #16301
source: Nearest neighbour
ar: أقرب جار

# #16302
source: Bilinear
ar: ثنائي

# #16307
source: Bicubic (software)
ar: Bicubic (برنامج)

# #16308
source: Lanczos (software)
ar: Lanczos (برنامج)

# #16309
source: Sinc (software)
ar: Sinc (برنامج)

# #16310
source: Temporal
ar: مؤقت

# #16311
source: Temporal/Spatial
ar: مؤقت/مكاني

# #16312
source: (VDPAU)Noise Reduction
ar: (VDPAU)تخفيض الإزعاج

# #16313
source: (VDPAU)Sharpness
ar: (VDPAU)حدة

# #16314
source: Inverse Telecine
ar: مواقع تصوير معكوسة

# #16315
source: Lanczos3 optimized
ar: Lanczos3 أمثل

# #16316
source: Auto
ar: التلقائية

# #16317
source: Temporal (Half)
ar: مؤقت(نصف)

# #16318
source: Temporal/Spatial (Half)
ar: مؤقت/مكاني(نصف)

# #16320
source: DXVA Bob
ar: DXVA تمايل

# #16321
source: DXVA Best
ar: DXVA ممتاز

# #16322
source: Spline36
ar: شريحة36

# #16323
source: Spline36 optimized
ar: شريحة36 مثالية

# #16324
source: Software Blend
ar: برنامج مزج

# #16325
source: Auto - ION Optimized
ar: ION محسن الي

# #16400
source: Post-processing
ar: ما بعد المعالجة

# #17500
source: Display sleep timeout
ar: عرض مهلة النوم

# #17997
source: %i MByte
ar: %i ميغابايت

# #17998
source: %i hours
ar: %i ساعات

# #17999
source: %i days
ar: %i أيام

# #19000
source: Switch to channel
ar: تبديل الى القناة

# #19001
source: Separate the search words by using AND, OR and/or NOT.
ar: افصل كلمات البحث باستخدام و, أو أو ليس

# #19002
source: or use phrases to find an exact match, like "The wizard of Oz".
ar: أو استخدم عبارات لايجاد توافق معين, مثل "ساحر Oz".

# #19004
source: Importing EPG from clients
ar: استيراد EPG من العملاء

# #19005
source: PVR stream information
ar: مسار معلومات PVR

# #19006
source: Receiving device
ar: جهاز استقبال

# #19007
source: Device status
ar: حالة الجهاز

# #19008
source: Signal quality
ar: جودة الإشارة

# #19012
source: PVR Backend
ar: خلفية PVR

# #19013
source: Free to air
ar: مجاني

# #19014
source: Fixed
ar: صالح

# #19015
source: Encryption
ar: تشفير

# #19017
source: TV recordings
ar: تسجيلات TV

# #19018
source: Default folder for PVR thumbnails
ar: مصدر افتراضي لصور PVR مصغرة

# #19019
source: Channels
ar: محطات

# #19021
source: Radio
ar: إذاعة

# #19022
source: Hidden
ar: مخفي

# #19023
source: TV channels
ar: محطات TV

# #19024
source: Radio channels
ar: محطات الإذاغة

# #19025
source: Upcoming recordings
ar: تسجيلات قادمة

# #19026
source: Add timer...
ar: إضافة مؤقت...

# #19027
source: No search results
ar: لا يوجد نتائج بحث

# #19028
source: No EPG entries
ar: لا يوجد مقالات EPG

# #19029
source: Channel
ar: محطة

# #19030
source: Now
ar: الان

# #19031
source: Next
ar: التالي

# #19032
source: Timeline
ar: جدول الزمن

# #19033
source: Information
ar: معلومة

# #19034
source: Already started recording on this channel
ar: بدء التسجيل على هذه المحطة

# #19035
source: This channel cannot be played. Check the log for details.
ar: لا يمكن تشغيل هذه المحطة. افحص السجل للتفاصيل.

# #19036
source: This recording cannot be played. Check the log for details.
ar: لا يمكن تشغيل هذا التسجيل. افحص السجل للتفاصيل.

# #19037
source: Show signal quality
ar: عرض جودة الإشارة

# #19038
source: Not supported by the PVR backend.
ar: غير مدعوم من PVr

# #19039
source: Are you sure you want to hide this channel?
ar: هل أنت متأكد تريد إخفاء هذه المحطة؟

# #19040
source: Timer
ar: مؤقت

# #19041
source: Are you sure you want to rename this recording?
ar: هل أنت متأكد تريد إعادة تسمية هذا التسجيل؟

# #19042
source: Are you sure you want to rename this timer?
ar: هل أنت متأكد تريد إعادة تسمية هذا المؤقت؟

# #19043
source: Recording
ar: تسجيل

# #19044
source: Please check your configuration or check the log for details.
ar: يرجى فحص ترتيبك أو فحص السجل للتفاصيل

# #19045
source: No PVR clients have been started yet. Wait for the PVR clients to start up or check the log for details.
ar: لم يبدأ عملاء PVR بعد. انتظر حتى يبدأ عملاء PVR أو افحص السجل للتفاصيل

# #19046
source: New channel
ar: محطة جديدة

# #19047
source: Programme info
ar: معلومات البرنامج

# #19048
source: Group management
ar: إدارة مجموعة

# #19049
source: Show channel
ar: عرض محطة

# #19050
source: Show visible channels
ar: عرض محطات مرئية

# #19051
source: Show hidden channels
ar: عرض محطات مخفية

# #19052
source: Move channel to:
ar: نقل المحطة إلى:

# #19053
source: Recording information
ar: معلومات التسجيل

# #19054
source: Hide channel
ar: إخفاء محطة

# #19055
source: No information available
ar: لايوجد معلومات متوفرة

# #19056
source: New timer
ar: مؤقت جديد

# #19057
source: Edit timer
ar: تحرير المؤقت

# #19058
source: Timer enabled
ar: تمكين المؤقت

# #19059
source: Stop recording
ar: إيقاف التسجيل

# #19060
source: Delete timer
ar: حذف مؤقت

# #19061
source: Add timer
ar: إضافة مؤقت

# #19062
source: Sort by: Channel
ar: فرز حسب: المحطة

# #19063
source: Go to begin
ar: ذهاب للبداية

# #19064
source: Go to end
ar: ذهاب للنهاية

# #19065
source: Default EPG window
ar: نافذة EPG افتراضية

# #19067
source: This event is already being recorded.
ar: هذا الحدث مسجل أساسا.

# #19068
source: This recording could not be deleted. Check the log for details.
ar: لا يمكن كشف هذا التسجيل. افحص السجل للتفاصيل.

# #19071
source: EPG update interval
ar: مدة تحديث EPG

# #19072
source: Do not store the EPG in the database
ar: لا تفرز الـEPG في قاعدة البيانات

# #19074
source: Active:
ar: تفعيل:

# #19075
source: Name:
ar: اسم

# #19076
source: Folder:
ar: مجلد:

# #19077
source: Radio:
ar: إذاعة:

# #19078
source: Channel:
ar: محطة:

# #19079
source: Day:
ar: يوم:

# #19080
source: Begin:
ar: بدء:

# #19081
source: End:
ar: نهاية:

# #19082
source: Priority:
ar: أولوية:

# #19083
source: Lifetime (days):
ar: حياى (أيام):

# #19084
source: First day:
ar: اليوم الأول:

# #19085
source: Unknown channel %u
ar: محطة غير معروفة %u

# #19086
source: Mo-__-__-__-__-__-__
ar: الإثنين-__-__-__-__-__-__

# #19088
source: __-__-We-__-__-__-__
ar: __-__-نحن-__-__-__-__

# #19090
source: __-__-__-__-Fr-__-__
ar: __-__-__-__-الجمعة-__-__

# #19091
source: __-__-__-__-__-Sa-__
ar: __-__-__-__-__-السبت-__

# #19092
source: __-__-__-__-__-__-Su
ar: __-__-__-__-__-__-الأحد

# #19093
source: Mo-Tu-We-Th-Fr-__-__
ar: الإثنين-الثلاثاء-الأربعاء-الخميس-الجمعة-__-__

# #19094
source: Mo-Tu-We-Th-Fr-Sa-__
ar: الإثنين-الثلاثاء-الأربعاء-الخميس-الجمعة-السبت-__

# #19095
source: Mo-Tu-We-Th-Fr-Sa-Su
ar: الإثنين-الثلاثاء-الأربعاء-الخميس-الجمعة-السبت-الأحد

# #19096
source: __-__-__-__-__-Sa-Su
ar: __-__-__-__-__-السبت-الأحد

# #19097
source: Enter the name for the recording
ar: أدخل اسم التسجيل

# #19098
source: Warning
ar: تحذير

# #19102
source: Please switch to another channel.
ar: انتقل لمحطة أخرى

# #19104
source: Enter the name of the folder for the recording
ar: أدخل اسم مجلد التسجيل

# #19106
source: Next timer on
ar: المؤقت التالي يعمل

# #19107
source: at
ar: في

# #19109
source: Couldn't save timer. Check the log for details.
ar: لم يتم حفظ المؤقت. افحص السجل للتفاصيل

# #19110
source: An unexpected error occurred. Try again later or check the log for details.
ar: حدث خطأ غير متوقع. حاول لاحقا أو افحص السجل للتفاصيل.

# #19111
source: PVR backend error. Check the log for details.
ar: PVR خطأ خلفية. افحص السجل للتفاصيل.

# #19114
source: Version
ar: إصدار

# #19115
source: Address
ar: عنوان

# #19116
source: Disksize
ar: حجم القرص

# #19117
source: Search for channels
ar: بحث عن محطات

# #19118
source: Cannot use PVR functions while searching.
ar: لا يمكن استخدام وظائف PVR خلال البحث

# #19119
source: On which server you want to search?
ar: على أي مخدم تريد البحث

# #19120
source: Client number
ar: رقم العميل

# #19121
source: Avoid repeats
ar: تفادا الإعادات

# #19122
source: This timer is still recording. Are you sure you want to delete this timer?
ar: هذا المؤقت لا يزال يسجل. هل أنت متأكد بأنك تريد حذف هذا المؤقت؟

# #19123
source: Free to air channels only
ar: للقنوات المجانية فقط

# #19124
source: Ignore present timers
ar: تجاهل التوقيت الحالي

# #19125
source: Ignore present recordings
ar: تجاهل التسجيلات الحالية

# #19126
source: Start time
ar: وقت البدء

# #19127
source: End time
ar: وقت الانتهاء

# #19128
source: Start date
ar: تاريخ البدء

# #19129
source: End date
ar: تاريخ الانتهاء

# #19130
source: Minimum duration
ar: أقصر مدة

# #19131
source: Maximum duration
ar: أقصى مدة

# #19132
source: Include unknown genres
ar: شمل أنواع غير معروفة

# #19133
source: Search string
ar: صف البحث

# #19134
source: Include description
ar: شمل وصف

# #19135
source: Case sensitive
ar: حالة حساسة

# #19136
source: Channel unavailable
ar: محطة غير متوفرة

# #19137
source: No groups defined
ar: لا يوجد مجموعات معرفة

# #19138
source: Please create a group first
ar: الرجاء انشاء مجموعة أولا

# #19139
source: Name of the new group
ar: اسم المجموعة الجديدة

# #19141
source: Group
ar: مجموعة

# #19142
source: Search guide
ar: دليل البحث

# #19143
source: Group management
ar: إدارة المجموعة

# #19144
source: No groups defined
ar: لا يوجد مجموعات معرفة

# #19145
source: Grouped
ar: جمع

# #19146
source: Groups
ar: مجموعات

# #19147
source: The PVR backend does not support this action. Check the log for details.
ar: خلفية PVR لا تدعم هذا الإجراء. غفحص السجل للتفاصيل.

# #19148
source: Channel
ar: محطة

# #19149
source: Mo
ar: الإثنين

# #19151
source: We
ar: نحن

# #19153
source: Fr
ar: الجمعة

# #19154
source: Sa
ar: السبت

# #19155
source: Su
ar: الأحد

# #19156
source: from
ar: من

# #19157
source: Next recording
ar: التسجيل التالي

# #19158
source: Currently recording
ar: يسجل حاليا

# #19159
source: from
ar: من

# #19160
source: to
ar: إلى

# #19162
source: Recording active
ar: التسجيل فعال

# #19163
source: Recordings
ar: التسجيلات

# #19164
source: Cannot start recording. Check the log for details.
ar: لا يمكنك تشغيل التسجيل. افحص السجل للتفاصيل

# #19165
source: Switch
ar: غير

# #19166
source: PVR information
ar: معلومات PVR

# #19167
source: Scan for missing icons
ar: بحث عن أيقونات مفقودة

# #19168
source: Switch channel without pressing OK
ar: تغيير المحطة دون الضغط على ok

# #19169
source: Hide video information box
ar: إخفاء صندوق معلومات الفيديو

# #19171
source: Start playback minimized
ar: بدأ التشغيل مصغرا

# #19172
source: Instant recording duration
ar: مدة التسجيل الفوري

# #19173
source: Default recording priority
ar: اولوية التسجيل الافتراضية

# #19174
source: Default recording lifetime
ar: عمر التسجيل الافتراضي

# #19175
source: Margin at the start of a recording
ar: الهامش عند بدأ التسجيل

# #19176
source: Margin at the end of a recording
ar: الهامش عند انتهاء التسجيل

# #19177
source: Playback
ar: توليف

# #19178
source: Show channel information when switching channels
ar: اظهار معلومات القناة عند تغيير القنوات

# #19179
source: Automatically hide channel information
ar: أخف معلومات المحطة تلقائيا

# #19181
source: Menu/OSD
ar: شريط التشغيل

# #19182
source: Days to display in the EPG
ar: الايام الظاهرة في دليل القنوات

# #19184
source: Channel information duration
ar: مدة ظهور معلوات القناة

# #19186
source: All data in the PVR database is being erased
ar: تم مسح كل البيانات في قاعدة بيانات PVR

# #19187
source: Reset the EPG database
ar: اعادة تعيين بيانات دليل القنوات EPG

# #19188
source: EPG is being reset
ar: يتم استعادة دليل القنوات

# #19189
source: Continue last channel on startup
ar: الرجوع لآخر قناة عند بداية التشغيل

# #19190
source: Minimized
ar: تصغير

# #19191
source: PVR service
ar: خدمة تسجيل الفيديو

# #19193
source: The channel scan cannot be started. Check the log for details.
ar: لا يمكن بدء مسح المحطة. افحص السجل للتفاصيل.

# #19194
source: Continue?
ar: متابعة؟

# #19199
source: Channel manager
ar: مدير القنوات

# #19200
source: EPG source:
ar: مصدر دليل القنوات

# #19201
source: Channel name:
ar: اسم القناة

# #19202
source: Channel icon:
ar: ايقونة القناة

# #19203
source: Edit channel
ar: تعديل القناة

# #19204
source: New channel
ar: قناة جديدة

# #19205
source: Group management
ar: ادارة المجموعة

# #19206
source: Activate EPG:
ar: تفعيل EPG:

# #19207
source: Group:
ar: مجموعة

# #19208
source: Enter the name of the new channel
ar: ادخل اسم القناة الجديدة

# #19209
source: XBMC virtual backend
ar: خلفية XBMC ظاهرية

# #19210
source: Client
ar: عميل

# #19211
source: Delete channel
ar: حذف القناة

# #19212
source: This list contains changes
ar: هذه القائمة تحوي تغييرات

# #19213
source: Select backend
ar: تحديد خلفية

# #19214
source: Enter a valid URL for the new channel
ar: ادخل عنوان (URL) للقناة الجديدة

# #19215
source: The PVR backend does not support timers.
ar: خلفية PVR لا تدعم المؤقت.

# #19216
source: All radio channels
ar: كل محطات الإذاعة

# #19217
source: All TV channels
ar: كل محطات TV

# #19218
source: Visible
ar: مرئي

# #19219
source: Ungrouped channels
ar: محطات مجمعة

# #19220
source: Channels in
ar: القنوات في

# #19221
source: Synchronise channel groups with backends
ar: مزامنة مجموعات المحطات مع الخلفيات

# #19222
source: EPG
ar: دليل القنوات EPG

# #19223
source: No PVR add-on could be enabled. Check your settings or the log for more info.
ar: قد لا تتوفر إضافة PVR. افحص إعداداتك أو السجل لمزيد من المعلومات.

# #19224
source: Recording aborted
ar: تم ايقاف التسجيل

# #19225
source: Recording scheduled
ar: تم جدولة التسجيل

# #19226
source: Recording started
ar: بدأ التسجيل

# #19227
source: Recording completed
ar: اكتمل التسجيل

# #19228
source: Recording deleted
ar: حذف التسجيل

# #19229
source: Close channel OSD after switching channels
ar: اغلق معلومات القناة بعد الانتقال اليها

# #19230
source: Prevent EPG updates while playing a TV stream
ar: منع تحديث دليل القنوات EPG خلال مشاهدة التلفاز

# #19231
source: Always use the channel order from the backend(s)
ar: دائما إبدأ ترتيب المحكة من الخلفية(الخلفيات)

# #19232
source: Clear search results
ar: مسح نتائج البحث

# #19233
source: Display a notification on timer updates
ar: عرض ملاحظة عن تحديث المؤقت

# #19234
source: Use backend channels numbers (only works with 1 enabled PVR addon)
ar: استخدام أرقام محطات خلفية ( تمكين ملحق PVR عند تشغيل 1 فقط)

# #19235
source: PVR manager is starting up
ar: مدير PVR يبدأ العمل

# #19236
source: Loading channels from clients
ar: تحميل محطات من العملاء

# #19237
source: Loading timers from clients
ar: تحميل مؤقت من العملاء

# #19238
source: Loading recordings from clients
ar: تحميل تسجيلات من العملاء

# #19239
source: Starting background threads
ar: بدء مواضيع الخلفية

# #19240
source: No PVR add-on enabled
ar: لا يوجد إضافة PVR ممكنة

# #19241
source: The PVR manager has been enabled without any
ar: تم تمكين مدير PVR بدو أي

# #19242
source: enabled PVR add-on. Enable at least one add-on
ar: تمكين إضافة PVR. تمكين إضاقة واحدة على الأقل

# #19243
source: in order to use the PVR functionality.
ar: بناء على استخدام وظائف PVR.

# #19244
source: Backend idle time
ar: وقت الخمول

# #19245
source: Set wakeup command (cmd [timestamp])
ar: ضبط أمر الاستيقاظ (cmd [timestamp])

# #19246
source: Wakeup before recording
ar: استيقظ قبل التسجيل

# #19247
source: Daily wakeup
ar: تأخير الاستيقاظ

# #19248
source: Daily wakeup time (HH:MM:SS)
ar: تأخير وقت الاستيقاظ (HH:MM:SS)

# #19249
source: Filter channels
ar: تصفية القنوات

# #19250
source: Loading EPG from database
ar: تحميل EPG من قاعدة البيانات

# #19251
source: Update EPG information
ar: تحديث معلومات EPG

# #19252
source: Schedule EPG update for this channel?
ar: جدول تحديث EPG لهذه القناة

# #19253
source: EPG update scheduled for channel
ar: جدول تحديث EPG لقناة

# #19254
source: EPG update failed for channel
ar: فشل تحديث EPG القناة

# #19255
source: Start recording
ar: بدء التسجيل

# #19256
source: Stop recording
ar: وقف التسجيل

# #19257
source: Lock channel
ar: قفل محطة

# #19258
source: Unlock channel
ar: فتح محطة

# #19259
source: Parental control
ar: تحكم الأهل

# #19260
source: Unlock duration
ar: فتح مدة

# #19261
source: Change PIN
ar: تغيير PIN

# #19262
source: Parental control. Enter PIN:
ar: تحكم الأهل. أدخل PIN:

# #19263
source: Locked channel. Enter PIN:
ar: قناة مقفلة. أدخل PIN:

# #19264
source: Incorrect PIN
ar: PIN غير صحيح

# #19265
source: The entered PIN number was incorrect.
ar: رقم PIN المدخل غير صحيح.

# #19266
source: Parental locked
ar: مقفول ضد الاطفال

# #19267
source: Parental locked:
ar: قفل الاطفال:

# #19268
source: Do not show 'no information available' labels
ar: لا تظهر مربعات "لا يوجد معلومات متوفرة"

# #19269
source: Do not show 'connection lost' warnings
ar: لا تظهر تحذيرات "فقد الاتصال"

# #19270
source: * All recordings
ar: * كل التسجيلات

# #19271
source: No PVR add-ons could be found
ar: لم يتم العثور على أي إضافات PVR.

# #19272
source: You need a tuner, backend software, and an
ar: تحتاج معدل, برنامج خلفية, و

# #19273
source: add-on for the backend to be able to use PVR.
ar: إضافة للخلفية لتكون قادر على استخدام PVR

# #19274
source: Please visit xbmc.org/pvr to learn more.
ar: الرجاء زيارة xbmc.org/pvr لمعرفة المزيد

# #19499
source: Other/Unknown
ar: اخر/غير معلوم

# #19500
source: Movie/Drama
ar: فيلم/دراما

# #19501
source: Detective/Thriller
ar: تحري/حماس

# #19502
source: Adventure/Western/War
ar: مغامرة/أفلام الغرب الأمريكي/حرب

# #19503
source: Science Fiction/Fantasy/Horror
ar: خيال علمي/خيالي/ رعب

# #19504
source: Comedy
ar: كوميدي

# #19506
source: Romance
ar: رومانسي

# #19507
source: Serious/Classical/Religious/Historical Movie/Drama
ar: جدي/كلاسيكي/ديني/فيلم تاريخي/دراما

# #19508
source: Adult Movie/Drama
ar: فيلم/دراما راشد

# #19517
source: News/Weather Report
ar: اخبار/ تقارير الطقس

# #19518
source: News Magazine
ar: مجلة الاخبار

# #19519
source: Documentary
ar: وثائقي

# #19520
source: Discussion/Interview/Debate
ar: مناقشة/مقابلة/مناظرة

# #19532
source: Show/Game Show
ar: عرض/عرض العاب

# #19533
source: Game Show/Quiz/Contest
ar: عرض العاب/اسئلة/مـسابقة

# #19534
source: Variety Show
ar: برنامج منوعات

# #19535
source: Talk Show
ar: برنامج حديث

# #19548
source: Sports
ar: الرياضة

# #19549
source: Special Event
ar: حدث خاص

# #19550
source: Sport Magazine
ar: مجلة الرياضة

# #19551
source: Football
ar: كرة القدم

# #19552
source: Tennis/Squash
ar: تينيس/سكواتش

# #19553
source: Team Sports
ar: فرق رياضية

# #19554
source: Athletics
ar: ألعاب رياضية

# #19555
source: Motor Sport
ar: رياضة محركات

# #19556
source: Water Sport
ar: رياضة مائية

# #19557
source: Winter Sports
ar: رياضات الشتاء

# #19559
source: Martial Sports
ar: رياضة الدفاع عن النفس

# #19564
source: Children's/Youth Programmes
ar: أطفال/برامج صغار

# #19566
source: Entertainment Programmes for 6 to 14
ar: برامج مسلية للاعمار 6 الى 14

# #19567
source: Entertainment Programmes for 10 to 16
ar: برامج مسلية للاعمار 10 الى 16

# #19580
source: Music/Ballet/Dance
ar: موسيقى/باليه/رقص

# #19581
source: Rock/Pop
ar: روك/بوب

# #19582
source: Serious/Classical Music
ar: موسيقى تقليدية/كلاسيكية

# #19583
source: Folk/Traditional Music
ar: اغاني شعبية/فـلكلور

# #19584
source: Musical/Opera
ar: موسيقي/اوبيرا

# #19585
source: Ballet
ar: باليه

# #19596
source: Arts/Culture
ar: فنون/ثقافة

# #19597
source: Performing Arts
ar: فنون استعراضية

# #19599
source: Religion
ar: الدين

# #19601
source: Literature
ar: ادب

# #19602
source: Film/Cinema
ar: فيلم سينمائي

# #19606
source: Arts/Culture Magazines
ar: مجلات فنون/ثقافة

# #19607
source: Fashion
ar: الموضة

# #19630
source: Technology/Natural Sciences
ar: علوم الطبيعع/التكنولوجيا

# #19635
source: Languages
ar: لغات

# #19645
source: Tourism/Travel
ar: سياحة/سفر

# #19649
source: Cooking
ar: طبخ

# #19650
source: Advertisement/Shopping
ar: إعلان/تسوق

# #19663
source: Unpublished
ar: غير منشور

# #19676
source: Drama
ar: دراما

# #19677
source: Detective/Thriller
ar: تحري/حماس

# #19678
source: Adventure/Western/War
ar: مغامرة/أفلام الغرب الأمريكي/حرب

# #19679
source: Science Fiction/Fantasy/Horror
ar: خيال علمي/خيالي/رعب

# #19680
source: Comedy
ar: كوميدي

# #19682
source: Romance
ar: رومانسي

# #19684
source: Adult
ar: راشد

# #20000
source: Saved music folder
ar: مجلد موسيقى محفوظ

# #20001
source: Use external DVD player
ar: استخدم مشغل دي في دي خارجي

# #20002
source: External DVD player
ar: الخارجية لاعب دي في دي

# #20003
source: Trainers folder
ar: مجلد المربين

# #20004
source: Screenshot folder
ar: مجلد لقطات الشاشة

# #20006
source: Playlists folder
ar: مجلد قوائم التشغيل

# #20007
source: Recordings
ar: التسجيلات

# #20008
source: Screenshots
ar: اللقطات

# #20009
source: Use XBMC
ar: XBMC استخدام

# #20011
source: Music playlists
ar: قوائم تشغيل الموسيقى

# #20012
source: Video playlists
ar: قوائم تشغيل الفيديو

# #20013
source: Do you wish to launch the game?
ar: هل تريد تشغيل اللعبة؟

# #20014
source: Sort by: Playlist
ar: ترتيب حسب: قائمة التشغيل

# #20015
source: Remote thumb
ar: ريموت المصغرة

# #20016
source: Current thumb
ar: ​​المصغرة الحالية

# #20017
source: Local thumb
ar: المحلية المصغرة

# #20018
source: No thumb
ar: المصغرة الحرة

# #20019
source: Choose thumbnail
ar: حدد صورة مصغرة

# #20023
source: Conflict
ar: التناقض

# #20024
source: Scan new
ar: تفحص الجديد

# #20025
source: Scan all
ar: تفحص كافة

# #20026
source: Region
ar: المنطقة

# #20037
source: Summary
ar: الملخص

# #20038
source: Lock music window
ar: قفل نافذة الموسيقى

# #20039
source: Lock videos window
ar: قفل نافذة الفيديو

# #20040
source: Lock pictures window
ar: قفل نافذة الصور

# #20041
source: Lock programs & scripts windows
ar: قفل نافذة البرامج والبرامج النصية

# #20042
source: Lock file manager
ar: قفل إدارة الملف

# #20043
source: Lock settings
ar: إعدادات القفل

# #20044
source: Start fresh
ar: البدء من جديد

# #20045
source: Enter master mode
ar: إدخال إلى الوضع الرئيسي

# #20046
source: Leave master mode
ar: إنهاء الوضع الرئيسي

# #20047
source: Create profile '%s'?
ar: ؟ '% s' إنشاء ملف

# #20048
source: Start with fresh settings
ar: ابدأ مع الإعدادات الجديدة

# #20049
source: Best available
ar: أفضل المتوفر

# #20050
source: Auto-switch between 16x9 and 4x3
ar: 4x3 and 16x3 التبديل تلقائيا بين

# #20051
source: Treat stacked files as single file
ar: تعامل مع الملفات المكدسة كملف واحد

# #20052
source: Caution
ar: حذر

# #20053
source: Left master mode
ar: غادر الوضع الرئيسي

# #20054
source: Entered master mode
ar: في الوضع الرئيسي

# #20055
source: Allmusic.com thumb
ar: Allmusic.com مصغرة

# #20057
source: Remove thumbnail
ar: إزالة الصورة المصغرة

# #20058
source: Add profile...
ar: أضف ملف شخصي...

# #20059
source: Query info for all albums
ar: استعلام معلومات جميع الألبومات

# #20060
source: Media info
ar: معلومات الوسائط

# #20061
source: Separate
ar: فصل

# #20062
source: Shares with default
ar: مساهمة افتراضية

# #20063
source: Shares with default (read only)
ar: مساهمة افتراضية (للقراءة فقط)

# #20064
source: Copy default
ar: نسخ الافتراضية

# #20065
source: Profile picture
ar: الصورة الشخصية

# #20066
source: Lock preferences
ar: قفل التفضيلات

# #20067
source: Edit profile
ar: تحرير الملف الشخصي

# #20068
source: Profile lock
ar: قفل الملف الشخصي

# #20069
source: Could not create folder
ar: لا يتمكن من إنشاء المجلد

# #20070
source: Profile directory
ar: دليل الملف الملف الشخصي

# #20071
source: Start with fresh media sources
ar: ابدأ مع مصادر الوسائط الجديدة

# #20072
source: Make sure the selected folder is writable
ar: تأكد من أن المجلد المحدد قابل للكتابة

# #20073
source: and that the new folder name is valid
ar: وأن اسم المجلد الجديد صالحا

# #20074
source: MPAA rating
ar: :MPAA تصنيف

# #20075
source: Enter master lock code
ar: إدخال رمز القفل الرئيسي عند بداية التشغيل
