Repository: xbmc/xbmc
Catalog: language/Arabic/strings.po
Languages: ar

# #611
source: Enter number
ar: إدخال رقم

# #612
source: Bits/Sample
ar: عينه/فئات

# #613
source: Sample Frequency
ar: عينة التردد

# #620
source: Audio CDs
ar: قرص الصوت

# #621
source: Encoder
ar: التشفير

# #622
source: Quality
ar: الجودة

# #623
source: Bitrate
ar: معدل بت

# #624
source: Include track number
ar: تضمين رقم المسار

# #625
source: All songs of
ar: كل الأغاني من

# #626
source: In progress TV shows
ar: عروض TV قيد التشغيل

# #629
source: View mode
ar: وضع العرض

# #630
source: Normal
ar: عادي

# #631
source: Zoom
ar: تكبير

# #632
source: Stretch 4:3
ar: 4:3 امتداد

# #633
source: Wide Zoom
ar: 14:09 امتداد

# #634
source: Stretch 16:9
ar: امتداد 16:09

# #635
source: Original Size
ar: الحجم الأصلي

# #636
source: Custom
ar: فريد

# #637
source: Replay gain
ar: إعادة العائدات

# #638
source: Replaygain volume adjustments
ar: إعادة العائدات للكمية المتناسبة

# #639
source: Use track levels
ar: استخدام مستويات المسار

# #640
source: Use album levels
ar: استخدام مستويات الألبوم

# #641
source: PreAmp Level - Replay gained files
ar: مستوى ما قبل مكبر للصوت -- زيادة عائدات ملفات اللحن

# #642
source: PreAmp Level - Non replay gained files
ar: مستوى ما قبل مكبر للصوت -- لا إعادة لملفات العائدات

# #643
source: Avoid clipping on replay gained files
ar: منع سرعة زيادة عوائد ملفات اللحن

# #644
source: Crop black bars
ar: قص الأشرطة السوداء

# #645
source: Need to unpack a big file. Continue?
ar: يحتاج إلى فتح ملف كبير. مواصلة؟

# #646
source: Remove from library
ar: إزالة من المكتبة

# #647
source: Export video library
ar: تصدير مكتبة الفيديو...

# #648
source: Import video library
ar: استيراد مكتبة الفيديو...

# #649
source: Importing
ar: استيراد

# #650
source: Exporting
ar: تصدير

# #651
source: Browse for library
ar: تصفح للمكتبة

# #652
source: Years
ar: سنوات

# #653
source: Update library
ar: تحديث المكتبة

# #654
source: Show debug info
ar: تصحيح عرض معلومات

# #655
source: Browse for executable
ar: تصفح لملف تنفيذي

# #656
source: Browse for playlist
ar: تصفح لقائمة التشغيل

# #657
source: Browse for folder
ar: تصفح للملفات

# #658
source: Song information
ar: معلومات الأغنية

# #659
source: Non-linear stretch
ar: امتداد لاخطي

# #660
source: Volume amplification
ar: مقدار التكبير

# #661
source: Choose export folder
ar: اختار ملف التصدير

# #662
source: This file is no longer available.
ar: هذا الملف لم يعد متوفرا

# #663
source: Would you like to remove it from the library?
ar: هل ترغب في إزالته من المكتبة؟

# #664
source: Browse for Script
ar: التصفح النصي

# #665
source: Compression level
ar: مستوى الضغط

# #700
source: Cleaning up library
ar: تنظيف قاعدة البيانات

# #701
source: Removing old songs from the library
ar: حذف الأغاني القديمة من المكتبة

# #702
source: This path has been scanned before
ar: تم فحص هذا المسار من قبل

# #705
source: Network
ar: الشبكة

# #706
source: - Server
ar: - الخادم

# #708
source: Use an HTTP proxy server to access the internet
ar: استخدام وكيل HTTP للوصول الإنترنت

# #712
source: Invalid port specified. Value must be between 1 and 65535.
ar: منفذ غير صحيح. يجب أن تكون القيمة بين 1 و 65535.

# #713
source: HTTP proxy
ar: وكيل HTTP

# #715
source: - Assignment
ar: إحالة

# #716
source: Automatic (DHCP)
ar: التلقائي (DHCP)

# #717
source: Manual (Static)
ar: يدوي (ثابت)

# #719
source: - IP address
ar: عنوان IP

# #720
source: - Netmask
ar: قناع الشبكة

# #721
source: - Default gateway
ar: البوابة الإفتراضية

# #722
source: - DNS server
ar: خادم DNS

# #723
source: Save & restart
ar: حفظ وإعادة

# #724
source: Invalid address specified. Value must be AAA.BBB.CCC.DDD
ar: عنوان خاطئ. يجب أن يكون في AAA.BBB.CCC.DDD

# #725
source: with numbers between 0 and 255.
ar: مع الأرقام من 0 إلى 255.

# #726
source: Changes not saved. Continue without saving?
ar: لم يتم حفظ التغييرات. مواصلة بدون حفظ؟

# #727
source: Web server
ar: خادم ويب

# #728
source: FTP server
ar: FTP خادم

# #730
source: - Port
ar: - المنفذ

# #732
source: Save & apply
ar: حفظ وتطبيق

# #733
source: - Password
ar: - كلمة المرور

# #734
source: No pass
ar: لا مرور

# #735
source: - Character set
ar: -وضع الأحرف

# #736
source: - Style
ar: - النمط

# #737
source: - Colour
ar: - اللون

# #738
source: Normal
ar: عادي

# #739
source: Bold
ar: عريض

# #740
source: Italics
ar: مائلة

# #741
source: Bold italics
ar: عريض مائلة

# #742
source: White
ar: أبيض

# #743
source: Yellow
ar: أصفر

# #744
source: Files
ar: ملفات

# #745
source: No scanned information for this view
ar: لاتوجد معلومات مفحوصة لهذا العرض

# #746
source: Please turn off library mode
ar: الرجاء إيقاف وضع المكتبة

# #747
source: Error loading image
ar: خطأ في تحميل الصورة

# #748
source: Edit path
ar: تعديل مسار

# #749
source: Mirror image
ar: صورة مرآتية

# #750
source: Are you sure?
ar: هل أنت متأكد؟

# #751
source: Removing source
ar: إزالة مصدر

# #754
source: Add program link
ar: إضافة رابط برنامج

# #755
source: Edit program path
ar: تحرير مسار برنامج

# #756
source: Edit program name
ar: تحرير اسم برنامج

# #757
source: Edit path depth
ar: تحرير عمق مسار

# #759
source: View: Big list
ar: عرض: قائمة كبيرة

# #760
source: Yellow
ar: أصفر

# #761
source: White
ar: أبيض

# #762
source: Blue
ar: أزرق

# #763
source: Bright green
ar: أخضر ساطع

# #764
source: Yellow green
ar: أصفر أخضر

# #765
source: Cyan
ar: أزرق

# #766
source: Light grey
ar: رمادي فاتح

# #767
source: Grey
ar: رمادي

# #770
source: Error %i: share not available
ar: خطأ %i: لاتوجد مشاركة

# #772
source: Audio output
ar: مخرج الصوت

# #773
source: Seeking
ar: يبحث

# #774
source: Slideshow folder
ar: مجلد عرض الشرائح

# #775
source: Network interface
ar: واجهة شبكة الاتصال

# #776
source: - Wireless network name (ESSID)
ar: - اسم الشبكة اللاسلكية (ESSID)

# #777
source: - Wireless password
ar: - كلمة مرور الشبكة اللاسلكية

# #778
source: - Wireless security
ar: - حماية الشبكة اللاسلكية

# #779
source: Save and apply network interface settings
ar: حفظ إعدادات واجهة الشبكة

# #780
source: No encryption
ar: لاتشفير

# #784
source: Applying network interface settings. Please wait.
ar: تطبيق إعدادات واجهة الشبكة. يرجى الانتظار.

# #785
source: Network interface restarted successfully.
ar: إعادة تشغيل واجهة الشبكة بنجاح

# #786
source: Network interface did not start successfully.
ar: لم يتم تشغيل واجهة الشبكة بنجاح

# #787
source: Interface disabled
ar: الواجهة معطلة

# #788
source: Network interface disabled successfully.
ar: واجهة الشبكة معطلة بنجاح

# #789
source: Wireless network name (ESSID)
ar: اسم الشبكة اللاسلكية (ESSID)

# #790
source: Remote control
ar: تحكم عن بعد

# #791
source: Allow programs on this system to control XBMC
ar: سماح البرامج على هذا النظام للتحكم على XBMC

# #792
source: Port
ar: المنفذ

# #793
source: Port range
ar: نطاق المنفذ

# #794
source: Allow programs on other systems to control XBMC
ar: سماح برامج على أنظمة أخرى للتحكم على XBMC

# #795
source: Initial repeat delay (ms)
ar: تكرار تأخير أولي(ms)

# #796
source: Continuous repeat delay (ms)
ar: نكرار تأخير مستمر(ms)

# #797
source: Maximum number of clients
ar: الحد الأقصى لعدد من العملاء

# #798
source: Internet access
ar: الوصول إلى الإنترنت

# #799
source: Library Update
ar: تحديق المكتبة

# #800
source: Music library needs to rescan art from tags
ar: مكتبة الموسيقى تحتاج لإعادة مسح الفن من العلامات

# #801
source: Would you like to scan now?
ar: هل ترغب بالمسح الان؟

# #850
source: Invalid port number entered
ar: رقم المنفذ المدخل غير صالح

# #851
source: Valid port range is 1-65535
ar: نطاق المنفذ الصالح هو 1-65535

# #852
source: Valid port range is 1024-65535
ar: نطاق المنفذ السليم هو 1024-65535

# #998
source: Add Music...
ar: إضافة موسيقى...

# #999
source: Add Videos...
ar: إضافة فيديو...

# #1000
source: - Preview
ar: معاينة

# #1001
source: Unable to connect
ar: غير قادر على الاتصال

# #1002
source: XBMC was unable to connect to the network location.
ar: XBMC فشل في الاتصال إلى موقع الشبكة.

# #1003
source: This could be due to the network not being connected.
ar: قد يكون هذا بسبب عدم توصيل الشبكة.

# #1004
source: Would you like to add it anyway?
ar: هل تريد إضافته على أي حال؟

# #1006
source: IP address
ar: IP عنوان

# #1007
source: Add network location
ar: إضافة موقع شبكة

# #1008
source: Protocol
ar: بروتوكول

# #1009
source: Server address
ar: عنوان الخدمة

# #1010
source: Server name
ar: اسم الخدمة

# #1011
source: Remote path
ar: مسار بعيد

# #1012
source: Shared folder
ar: مجلد مشترك

# #1013
source: Port
ar: المنفذ

# #1014
source: Username
ar: اسم المستخدم

# #1015
source: Browse for network server
ar: تصفح لخادم الشبكة

# #1016
source: Enter the network address of the server
ar: أدخل عنوان الشبكة من الخادم

# #1017
source: Enter the path on the server
ar: أدخل المسار على الخادم

# #1018
source: Enter the port number
ar: أدخل رقم المنفذ

# #1019
source: Enter the username
ar: أدخل اسم المستخدم

# #1020
source: Add %s source
ar: %s إضافة مصدر

# #1021
source: Enter the paths or browse for the media locations.
ar: أدخل المسار أو تصفح موقع الوسائط.

# #1022
source: Enter a name for this media Source.
ar: أدخل اسم لمصدر الوسائط.

# #1023
source: Browse for new share
ar: تصفح لمشاركة جديد

# #1024
source: Browse
ar: تصفح

# #1025
source: Could not retrieve directory information.
ar: لايتمكن من استرجاع معلومات الدليل

# #1026
source: Add source
ar: إضافة مصدر...

# #1027
source: Edit source
ar: تحرير مصدر

# #1028
source: Edit %s source
ar: %s تحرير مصدر

# #1029
source: Enter the new label
ar: أدخل علامة جديد

# #1030
source: Browse for image
ar: تصفح للصور

# #1031
source: Browse for image folder
ar: تصفح لمجلد الصور

# #1032
source: Add network location...
ar: إضافة موقع شبكة...

# #1033
source: Browse for file
ar: تصفح لملف

# #1034
source: Submenu
ar: قائمة ثانوية

# #1035
source: Enable submenu buttons
ar: تمكين أزرار القائمة الثانوية

# #1036
source: Favourites
ar: المفضلات

# #1037
source: Video Add-ons
ar: ملحقات الفيديو

# #1038
source: Music Add-ons
ar: ملحقات الموسيقى

# #1039
source: Picture Add-ons
ar: ملحقات الصور

# #1040
source: Loading directory
ar: تحميل الدليل

# #1041
source: Retrieved %i items
ar: استرجاع %i عناصر

# #1042
source: Retrieved %i of %i items
ar: استرجاع %i من %i عناصر

# #1043
source: Program Add-ons
ar: ملحقات البرامج

# #1044
source: Set plugin thumb
ar: تعيين صورة مصغرة للملحق

# #1045
source: Add-on settings
ar: إعدادت الملحق

# #1046
source: Access points
ar: نقاط الوصول

# #1047
source: Other...
ar: أخرى...

# #1048
source: - Username
ar: - اسم المستخدم

# #1049
source: Script settings
ar: إعدادت النصية

# #1050
source: Singles
ar: الأفراد

# #1051
source: Enter web address
ar: أدخل عنوان ويب

# #1200
source: SMB client
ar: SMB عميل

# #1202
source: Workgroup
ar: SMB فريق العمل

# #1203
source: Default username
ar: SMB اسم المستخدم

# #1204
source: Default password
ar: SMB كلمة السر

# #1207
source: WINS server
ar: SMB WINS خادم

# #1208
source: Mount SMB shares
ar: SMB مشاركة

# #1210
source: Remove
ar: إزالة

# #1211
source: Music
ar: موسيقى

# #1212
source: Video
ar: فيديو

# #1213
source: Pictures
ar: صور

# #1214
source: Files
ar: ملفات

# #1215
source: Music & video
ar: الموسيقى والفيديو

# #1216
source: Music & pictures
ar: الموسيقى والصور

# #1217
source: Music & files
ar: الموسيقى والملفات

# #1218
source: Video & pictures
ar: فيديو وصور

# #1219
source: Video & files
ar: ملفات الفيديو

# #1220
source: Pictures & files
ar: الصور والملفات

# #1221
source: Music & video & pictures
ar: الموسيقى والفيديو والصور

# #1222
source: Music & video & pictures & files
ar: الموسيقى والفيديو والصور والملفات

# #1223
source: Disabled
ar: معطلة

# #1226
source: Files & music & video
ar: الملفات والموسيقى والفيديو

# #1227
source: Files & pictures & music
ar: الملفات والصور والموسيقى

# #1228
source: Files & pictures & video
ar: الملفات والصور والفيديو

# #1229
source: Music & programs
ar: الموسيقى والبرامج

# #1230
source: Video & programs
ar: الفيديو والبرامج

# #1231
source: Pictures & programs
ar: الصور والبرامج

# #1232
source: Music & video & pictures & programs
ar: الموسيقى والفيديو والصور والبرامج

# #1233
source: Programs & video & music
ar: البرامج والفيديو والموسيقى

# #1234
source: Programs & pictures & music
ar: البرامج والصور والموسيقى

# #1235
source: Programs & pictures & video
ar: البرامج والصور والفيديو

# #1260
source: Announce these services to other systems via Zeroconf
ar: أعلن هذه الخدمات لأنظمة أخرى عبر Zeroconf

# #1270
source: Allow XBMC to receive AirPlay content
ar: السماح لـXBMC استقبال مضمون البث

# #1271
source: Device name
ar: اسم الجهاز

# #1272
source: - Use password protection
ar: -- استخدام حماية كلمة المرور

# #1273
source: AirPlay
ar: البث

# #1300
source: Custom audio device
ar: جهاز صوت مخصص

# #1301
source: Custom passthrough device
ar: جهاز عبور مخصص

# #1396
source: Drifting
ar: ينجرف

# #1397
source: and
ar: و

# #1398
source: Freezing
ar: يتجمد

# #1399
source: Late
ar: متأخر

# #1400
source: Isolated
ar: معزولة

# #1401
source: Thundershowers
ar: رعد ومطر

# #1402
source: Thunder
ar: رعد

# #1403
source: Sun
ar: شمس

# #1404
source: Heavy
ar: كثيفة

# #1405
source: in
ar: في

# #1406
source: the
ar: في

# #1407
source: Vicinity
ar: كثب

# #1408
source: Ice
ar: جليد

# #1409
source: Crystals
ar: بلورات

# #1410
source: Calm
ar: هدوء

# #1411
source: with
ar: مع

# #1412
source: windy
ar: عاصفة

# #1414
source: Thunderstorm
ar: عواصف رعدية

# #1415
source: Drizzle
ar: رذاذ

# #1416
source: Foggy
ar: ضباب

# #1417
source: Grains
ar: حبيبات

# #1420
source: Moderate
ar: متوسط

# #1421
source: Very High
ar: عالية جدا

# #1422
source: Windy
ar: عاصفة

# #1423
source: Mist
ar: ضباب

# #1450
source: Put display to sleep when idle
ar: مراقبة دخول في وضع السكون عند الخمول

# #2050
source: Runtime
ar: وقت التشغيل:

# #2100
source: Script failed! : %s
ar: فشل النصية! %s

# #2101
source: Newer version needed - See log
ar: بحاجة إلى نسخة جديدة - انظر السجل

# #4501
source: Enable LCD/VFD
ar: تشغيل LCD / VFD

# #10000
source: Home
ar: الرئيسية

# #10001
source: Programs
ar: برامج

# #10002
source: Pictures
ar: صور

# #10003
source: File manager
ar: إدارة الملفات

# #10004
source: Settings
ar: الإعدادات

# #10005
source: Music
ar: موسيقى

# #10006
source: Videos
ar: فيديو

# #10007
source: System information
ar: معلومات النظام

# #10008
source: Settings - General
ar: العامة - الإعدادات

# #10009
source: Settings - Screen
ar: الشاشة - إعدادات

# #10010
source: Settings - Appearance - GUI Calibration
ar: معايرة واجهة المستخدم الرسومية - المظهر - إعدادات

# #10011
source: Settings - Videos - Screen Calibration
ar: معايرة الشاشة - الفيديو - إعدادات

# #10012
source: Settings - Pictures
ar: الصور - إعدادات

# #10013
source: Settings - Programs
ar: البرامج - إعدادات

# #10014
source: Settings - Weather
ar: الطقس - إعدادات

# #10015
source: Settings - Music
ar: الموسيقى - إعدادات

# #10016
source: Settings - System
ar: النظام - إعدادات

# #10017
source: Settings - Videos
ar: الفيديو - إعدادات

# #10018
source: Settings - Network
ar: الشبكة - إعدادات

# #10019
source: Settings - Appearance
ar: المظهر - إعدادات

# #10020
source: Scripts
ar: النصية

# #10021
source: Web Browser
ar: متصفح ويب

# #10025
source: Videos
ar: الفيديو

# #10028
source: Videos/Playlist
ar: فيديو / قائمة التشغيل

# #10029
source: Login screen
ar: شاشة الدخول

# #10034
source: Settings - Profiles
ar: إعدادات ملف المستخدم -

# #10040
source: Addon browser
ar: ملحق المتصفح

# #10100
source: Yes/No dialog
ar: حوار نعم/لا

# #10101
source: Progress dialog
ar: تقدم الحوار

# #10210
source: Looking for subtitles...
ar: يبحث عن الترجمات...

# #10211
source: Looking for or caching subtitles...
ar: يبحث عن أو تخزين مؤقت للترجمة...

# #10212
source: terminating
ar: يلغي

# #10213
source: buffering
ar: تخزين المعلومات

# #10214
source: Opening stream
ar: يفتح البث

# #10500
source: Music/Playlist
ar: موسيقى / قائمة التشغيل

# #10501
source: Music/Files
ar: الموسيقى / ملفات

# #10502
source: Music/Library
ar: الموسيقى / الدليل

# #10503
source: Playlist editor
ar: محرر قائمة التشغيل

# #10504
source: Top 100 songs
ar: أفضل 100 أغنية

# #10505
source: Top 100 albums
ar: أفضل 100 البوم

# #10506
source: Programs
ar: برامج

# #10507
source: Configuration
ar: إعدادات

# #10508
source: Weather forecast
ar: حالة الطقس

# #10509
source: Network gaming
ar: ألعاب الشبكة

# #10510
source: Extensions
ar: ملحقات

# #10511
source: System info
ar: معلومات النظام

# #10516
source: Music - Library
ar: موسيقى -- مكتبة

# #10517
source: Now Playing - Music
ar: التشغيل الآن -- موسيقى

# #10522
source: Now Playing - Videos
ar: التشغيل الآن -- فيديو

# #10523
source: Album info
ar: معلومات الألبوم

# #10524
source: Movie info
ar: معلومات الفيلم

# #12000
source: Select dialog
ar: تحديد الحوار

# #12001
source: Music/Info
ar: الموسيقى/معلومات

# #12002
source: Dialog OK
ar: حوار موافق

# #12003
source: Videos/Info
ar: الفيديو/معلومات

# #12004
source: Scripts/Info
ar: النصية / معلومات

# #12005
source: Fullscreen video
ar: وضع الفيديو في ملء الشاشة

# #12006
source: Audio visualization
ar: تصور الصوت

# #12008
source: File stacking dialog
ar: كومة من الملفات

# #12009
source: Rebuild index...
ar: إعادة مؤشر...

# #12010
source: Return to music window
ar: عودة إلى الموسيقى

# #12011
source: Return to videos window
ar: عودة إلى الفيديو

# #12021
source: Start from beginning
ar: ابدأ من البداية

# #12022
source: Resume from %s
ar: استئناف من %s

# #12321
source: Ok
ar: موافق

# #12325
source: Locked! Enter code...
ar: مقفل! أدخل كلمة الكود...

# #12326
source: Enter password
ar: أدخل كلمة المرور

# #12327
source: Enter master code
ar: أدخل الكود الرئيسي

# #12328
source: Enter unlock code
ar: أدخل رمز القفل

# #12329
source: or press C to cancel
ar: أو اضغط C للإلغاء

# #12330
source: Enter gamepad button combo and
ar: أدخل أزرار السرد وانقر

# #12331
source: press OK, or Back to cancel
ar: اضغط موافق, أو الخلف للإلغاء

# #12332
source: Set lock
ar: ضع قفل

# #12333
source: Unlock
ar: القفل

# #12334
source: Reset lock
ar: إعادة تعيين القفل

# #12335
source: Remove lock
ar: إزالة القفل

# #12337
source: Numeric password
ar: كلمة سر رقمية

# #12338
source: Gamepad button combo
ar: تحكم تركيبة الزر

# #12339
source: Full-text password
ar: كلمة السر كاملة نصيا

# #12340
source: Enter new password
ar: إدخال كلمة السر الجديدة

# #12341
source: Re-Enter new password
ar: إدخال كلمة المرور مرة أخرى

# #12342
source: Incorrect password,
ar: كلمة مرور خاطئة ،

# #12343
source: retries left
ar: غادر المحاولة

# #12344
source: Passwords entered did not match.
ar: كلمة المرور غير متطابقة.

# #12345
source: Access denied
ar: الدخول محظور

# #12346
source: Password retry limit exceeded.
ar: فشل العديد من محاولات تسجيل الدخول.

# #12347
source: The system will now shut off.
ar: النظام سوف يغلق الان.

# #12348
source: Item locked
ar: العنصر مقفل

# #12353
source: Reactivate lock
ar: تنشيط قفل

# #12356
source: Change lock
ar: تغيير قفل

# #12357
source: Source lock
ar: قفل مصدر

# #12358
source: Password entry was blank. Try again.
ar: حقل كلمة المرور فارغة. الرجاء المحاولة مرة أخرى.

# #12360
source: Master lock
ar: الإغلاق الرئيسي

# #12362
source: Shutdown system if Master Lock retries exceeded
ar: إيقاف تشغيل النظام إذا تجاوز القفل الرئيسي المحاولات

# #12367
source: Master code is not valid
ar: الرمز الرئيسي غير متطابق

# #12368
source: Please enter a valid master code
ar: الرجاء إدخال رمز رئيسي صحيح

# #12373
source: Settings & file manager
ar: إعدادت إدارة الملف

# #12377
source: This will reset any previously saved values
ar: هذا سوف تعيين أية قيم تم حفظها سابقا

# #12378
source: Amount of time to display each image
ar: مقدار الوقت لعرض كل صورة

# #12379
source: Use pan and zoom effects
ar: استخدام بان وتأثيرات التكبير

# #12383
source: 12 hour clock
ar: 12 ساعة

# #12384
source: 24 hour clock
ar: 24 ساعة على مدار الساعة

# #12385
source: Day/Month
ar: اليوم / الشهر

# #12386
source: Month/Day
ar: شهر / يوم

# #12390
source: System uptime
ar: وقت النظام النشط

# #12391
source: Minutes
ar: دقائق

# #12392
source: Hours
ar: ساعات

# #12393
source: Days
ar: أيام

# #12394
source: Total uptime
ar: النشاط الكلي

# #12395
source: Battery level
ar: مستوى البطارية

# #12600
source: Weather
ar: الطقس

# #12900
source: Screensaver
ar: شاشة

# #12901
source: Fullscreen OSD
ar: شاشة كاملة OSD

# #13000
source: System
ar: النظام

# #13001
source: Immediate HD spindown
ar: Hardisk مزج على الفور

# #13002
source: Video only
ar: فيديو فقط

# #13003
source: - Delay
ar: - تأخير

# #13004
source: - Minimum file duration
ar: - مدة الحد الأدنى للملف

# #13005
source: Shutdown
ar: إغلاق

# #13008
source: Shutdown function
ar: عملية الإغلاق

# #13009
source: Quit
ar: اخرج

# #13010
source: Hibernate
ar: إسبات

# #13011
source: Suspend
ar: أجل

# #13012
source: Exit
ar: إنهاء

# #13013
source: Reboot
ar: إعادة تشغيل

# #13014
source: Minimize
ar: تصغير

# #13015
source: Power button action
ar: زر إيقاف العمل

# #13016
source: Power off System
ar: إيقاف تشغيل النظام ​​

# #13017
source: Inhibit idle shutdown
ar: منع إغلاق الخامل

# #13018
source: Allow idle shutdown
ar: سماح إغلاق الخامل

# #13020
source: Is another session active, perhaps over ssh?
ar: هل جلسة العمل الأخرى نشطة, ربما خلال ssh?

# #13021
source: Mounted removable harddrive
ar: الأقراص المحمولة متصلة

# #13022
source: Unsafe device removal
ar: ليست آمنة لإزالة جهاز محمول

# #13023
source: Successfully removed device
ar: نجحت في إزالة الجهاز

# #13024
source: Joystick plugged
ar: جويستيك متصلة

# #13025
source: Joystick unplugged
ar: جويستيك غير متصلة

# #13050
source: Running low on battery
ar: يعمل على البطارية المنخفضة

# #13100
source: Flicker filter
ar: تصفية Flicker

# #13101
source: Let driver choose (requires restart)
ar: اسمح للسواقه الاختيار (يتطلب إعادة تشغيل )

# #13105
source: Vertical blank sync
ar: مزامنة رأسية فارغة

# #13106
source: Disabled
ar: تزامن رأسي فارغ

# #13107
source: Enabled during video playback
ar: ممكن خلال تشغيل الفيديو

# #13108
source: Always enabled
ar: ممكن دائما

# #13109
source: Test & apply resolution
ar: اختبار وتطبيق الدقة

# #13110
source: Save resolution?
ar: حفظ الدقة؟

# #13111
source: Would you like to keep this resolution?
ar: هل ترغب في الحفاظ على هذه الدقة؟

# #13112
source: High quality upscaling
ar: رفع مستوى جودة عالية

# #13113
source: Disabled
ar: معطلة

# #13114
source: Enabled for SD content
ar: SD ممكن لمحتوى

# #13115
source: Always enabled
ar: دائما ممكن

# #13116
source: Upscaling method
ar: طريقة التوسيع

# #13121
source: VDPAU HQ Upscaling level
ar: رفع مستوى VDPAU HQ

# #13122
source: VDPAU Studio level color conversion
ar: تحويل لون مستوى استوديو VDPAU

# #13130
source: Blank other displays
ar: أفرغ العروض الاخرى

# #13131
source: Disabled
ar: معطلة

# #13132
source: Blank displays
ar: عرض فارغ

# #13140
source: Active connections detected!
ar: الكشف عن اتصالات نشطة!

# #13141
source: If you proceed, you might not be able to control XBMC
ar: إذا استمر ، قد تكون غير قادر على التحكم في XBMC المزيد

# #13142
source: any longer. Are you sure you want to stop the Event server?
ar: ؟EventServer هل أنت متأكد تريد إيقاف

# #13144
source: Change Apple Remote mode?
ar: تغير نمط أبل البعيد؟

# #13145
source: If you are currently using the Apple Remote to control
ar: إذا كنت تستخدم حاليا ابل للتحكم عن بعد

# #13146
source: XBMC, changing this setting might affect your ability
ar: XBMC, تغيير هذا الإعداد قد يؤثر بقدرتك

# #13147
source: to continue controlling it. Do you want to proceed?
ar: لمتابعة التحكم به. هل تريد المتابعة؟

# #13159
source: Subnet mask
ar: قناع الشبكة

# #13160
source: Gateway
ar: DNS

# #13162
source: Initialize failed
ar: فشلت التهيئة

# #13170
source: Never
ar: أبداً

# #13171
source: Immediately
ar: فوراٌ

# #13172
source: After %i secs
ar: بعد %i ثواني

# #13173
source: HDD install date:
ar: تاريخ تثبيت القرص القلب:

# #13174
source: HDD power cycle count:
ar: عد دورة قوة HDD

# #13200
source: Profiles
ar: الملفات الشخصية

# #13201
source: Delete profile '%s'?
ar: حذف ملف شخصي '%s'?
