Repository: xbmc/xbmc
Catalog: language/Arabic/strings.po
Languages: ar

# #0
source: Programs
ar: البرامج

# #1
source: Pictures
ar: الصور

# #2
source: Music
ar: الموسيقى

# #3
source: Videos
ar: الفيديو

# #4
source: TV-Guide
ar: دليل التلفزيون

# #5
source: Settings
ar: الإعدادات

# #6
source: XBMC SVN
ar: XBMC النسخة المستقرة

# #7
source: File manager
ar: إدارة الملفات

# #8
source: Weather
ar: الطقس

# #9
source: xbmc media center
ar: xbmc مركز وسائط

# #11
source: Monday
ar: الاثنين

# #12
source: Tuesday
ar: الثلاثاء

# #13
source: Wednesday
ar: الاربعاء

# #14
source: Thursday
ar: الخميس

# #15
source: Friday
ar: الجمعة

# #16
source: Saturday
ar: السبت

# #17
source: Sunday
ar: الاحد

# #21
source: January
ar: يناير

# #22
source: February
ar: فبراير

# #23
source: March
ar: مارس

# #24
source: April
ar: أبريل

# #25
source: May
ar: مايو

# #26
source: June
ar: يونيو

# #27
source: July
ar: يوليو

# #28
source: August
ar: أغسطس

# #29
source: September
ar: سبتمبر

# #30
source: October
ar: أكتوبر

# #31
source: November
ar: نوفمبر

# #32
source: December
ar: ديسمبر

# #41
source: Mon
ar: اثنين

# #42
source: Tue
ar: ثلاثاء

# #43
source: Wed
ar: اربعاء

# #44
source: Thu
ar: خميس

# #45
source: Fri
ar: جمعة

# #46
source: Sat
ar: سبت

# #47
source: Sun
ar: أحد

# #51
source: Jan
ar: يناير

# #52
source: Feb
ar: فبراير

# #53
source: Mar
ar: مارس

# #54
source: Apr
ar: أبريل

# #55
source: May
ar: مايو

# #56
source: Jun
ar: يونيو

# #57
source: Jul
ar: يوليو

# #58
source: Aug
ar: أغسطس

# #59
source: Sep
ar: سبتمبر

# #60
source: Oct
ar: أكتوبر

# #61
source: Nov
ar: نوفمبر

# #62
source: Dec
ar: ديسمبر

# #71
source: N
ar: شمال

# #72
source: NNE
ar: شمال/شمال شرقي

# #73
source: NE
ar: شمال شرقي

# #74
source: ENE
ar: شرق/شمال شرقي

# #75
source: E
ar: شرق

# #76
source: ESE
ar: شرق/جنوب شرقي

# #77
source: SE
ar: جنوب شرقي

# #78
source: SSE
ar: جنوب/جنوب شرقي

# #79
source: S
ar: جنوب

# #80
source: SSW
ar: جنوب/جنوب غربي

# #81
source: SW
ar: جنوب غربي

# #82
source: WSW
ar: غرب/جنوب غربي

# #83
source: W
ar: غرب

# #84
source: WNW
ar: غرب/شمال غربي

# #85
source: NW
ar: شمال غربي

# #86
source: NNW
ar: شمال/شمال غربي

# #98
source: View: Auto
ar: عرض: تلقائية

# #99
source: View: Auto big
ar: عرض: تلقائية كبيرة

# #100
source: View: Icons
ar: عرض: رموز

# #101
source: View: List
ar: عرض: قائمة

# #102
source: Scan
ar: فحص

# #103
source: Sort by: Name
ar: ترتيب حسب: الإسم

# #104
source: Sort by: Date
ar: ترتيب حسب: التاريخ

# #105
source: Sort by: Size
ar: ترتيب حسب: الحجم

# #106
source: No
ar: لا

# #107
source: Yes
ar: نعم

# #108
source: Slideshow
ar: عرض الشرائح

# #109
source: Create thumbs
ar: إنشاء مصغرات

# #110
source: Create thumbnails
ar: إنشاء مصغرات

# #111
source: Shortcuts
ar: اختصارات

# #112
source: Paused
ar: متوقف

# #113
source: Update failed
ar: فشل التحديث

# #114
source: Installation failed
ar: فشل التثبيت

# #115
source: Copy
ar: نسخ

# #116
source: Move
ar: تحريك

# #117
source: Delete
ar: حذف

# #118
source: Rename
ar: إعادة تسمية

# #119
source: New folder
ar: مجلد جديد

# #120
source: Confirm file copy
ar: تأكيد نسخ ملف

# #121
source: Confirm file move
ar: تأكيد نقل ملف

# #122
source: Confirm file delete?
ar: تأكيد حذف ملف؟

# #123
source: Copy these files?
ar: نسخ هذه الملفات؟

# #124
source: Move these files?
ar: تحريك هذه الملفات؟

# #125
source: Delete these files? - Deleting files cannot be undone!
ar: حذف هذه الملفات؟ - لايمكن التراجع بعد حذف هذه الملفات!

# #126
source: Status
ar: الحالة

# #127
source: Objects
ar: كائنات

# #128
source: General
ar: عام

# #129
source: Slideshow
ar: عرض الشرائح

# #130
source: System info
ar: معلومات النظام

# #131
source: Display
ar: عرض

# #132
source: Albums
ar: البومات

# #133
source: Artists
ar: الفنانين

# #134
source: Songs
ar: الأغاني

# #135
source: Genres
ar: الأنواع

# #136
source: Playlists
ar: قوائم التشغيل

# #137
source: Search
ar: بحث

# #138
source: System Information
ar: معلومات النظام

# #139
source: Temperatures:
ar: درجات الحرارة:

# #140
source: CPU:
ar: وحدة المعالجة:

# #141
source: GPU:
ar: معالج الرسومات:

# #142
source: Time:
ar: الوقت:

# #143
source: Current:
ar: الحالي:

# #144
source: Build:
ar: النسخة:

# #145
source: Network:
ar: الشبكة:

# #146
source: Type:
ar: النوع:

# #147
source: Static
ar: ثابت

# #149
source: MAC address
ar: عنوان التحكم بالوصول إلى الوسائط MAC

# #150
source: IP address
ar: عنوان الآي بي IP

# #151
source: Link:
ar: الربط:

# #154
source: Storage
ar: سعة التخزين

# #155
source: Drive
ar: السواقة

# #156
source: Free
ar: الخالية

# #157
source: Video
ar: الفيديو

# #158
source: Free memory
ar: الذاكرة

# #159
source: No link
ar: لايوجد رابط

# #160
source: Free
ar: الخالية

# #161
source: Unavailable
ar: تعطيل

# #162
source: Tray open
ar: فتح علبة

# #163
source: Reading
ar: قراءة

# #164
source: No disc
ar: لايوجد قرص

# #165
source: Disc present
ar: القرص الحالي

# #166
source: Skin
ar: الغلاف

# #169
source: Resolution
ar: دقة

# #170
source: Adjust display refresh rate to match video
ar: ضبط معدل تحديث الشاشة لتتناسب مع الفيديو

# #172
source: Release date
ar: تاريخ الإصدار

# #173
source: Display 4:3 videos as
ar: عرض 4:3 فيديو مثل

# #175
source: Moods
ar: الأمزجة

# #176
source: Styles
ar: الأنماط

# #179
source: Song
ar: الأغنية

# #180
source: Duration
ar: المدة

# #181
source: Select album
ar: اختر الألبوم

# #182
source: Tracks
ar: المسارات

# #183
source: Review
ar: مراجعة

# #184
source: Refresh
ar: تحديث

# #185
source: Searching album
ar: بحث ألبوم

# #186
source: OK
ar: موافق

# #187
source: No albums found!
ar: لا توجد ألبومات

# #188
source: Select all
ar: حدد الكل

# #189
source: Scanning media info
ar: فحص معلومات الوسائط

# #190
source: Save
ar: حفظ

# #191
source: Shuffle
ar: خلط

# #192
source: Clear
ar: مسح

# #193
source: Scan
ar: فحص

# #194
source: Searching...
ar: بحث...

# #195
source: No info found!
ar: لا توجد معلومات

# #196
source: Select movie:
ar: اختر الفلم:

# #197
source: Querying %s info
ar: %s معلومات الإستعلام

# #198
source: Loading movie details
ar: تحميل تفاصيل الفيلم

# #199
source: Web interface
ar: واجهة ويب

# #202
source: Tagline
ar: إشعار

# #203
source: Plot outline
ar: موجز الرواية

# #205
source: Votes
ar: اصوات

# #206
source: Cast
ar: طرح

# #207
source: Plot
ar: الرواية

# #208
source: Play
ar: تشغيل

# #209
source: Next
ar: التالي

# #210
source: Previous
ar: السابق

# #213
source: Calibrate user interface...
ar: معايرة واجهة المستخدم...

# #214
source: Video calibration...
ar: معايرة الفيديو...

# #215
source: Soften
ar: تنعيم

# #216
source: Zoom amount
ar: مقدار التكبير

# #217
source: Pixel ratio
ar: نسبة عنصر الصورة

# #218
source: DVD drive
ar: DVD محرك أقراص

# #219
source: Please insert disc
ar: الرجاء إدراج القرص

# #220
source: Remote share
ar: مشاركة عن بعد

# #221
source: Network is not connected
ar: لم يتم توصيل الشبكة

# #222
source: Cancel
ar: إلغاء

# #224
source: Speed
ar: سرعة

# #225
source: Vertical Shift
ar: تحول عمودي

# #226
source: Test patterns...
ar: اختبار النماذج...

# #227
source: Lookup audio CD track names from freedb.org
ar: بحث أسماء مسارات الاسطوانة الصوتية من freedb.org

# #228
source: Shuffle playlist on load
ar: خلط قائمة التشغيل على التحميل

# #229
source: HDD spindown time
ar: وقت راحة الهاردسك

# #230
source: Video filters
ar: تصفية الفيديو

# #231
source: None
ar: بلا

# #232
source: Point
ar: نقطة

# #233
source: Linear
ar: طولي

# #234
source: Anisotropic
ar: تباين

# #235
source: Quincunx
ar: تخميس

# #236
source: Gaussian cubic
ar: غاوسي مكعب

# #237
source: Minification
ar: تقليل

# #238
source: Magnification
ar: تكبير

# #239
source: Clear playlist on finish
ar: مسح التشغيل على الانتهاء

# #240
source: Display Mode
ar: طريقة العرض

# #241
source: Full Screen #%d
ar: #%d شاشة كاملة

# #242
source: Windowed
ar: إطارات

# #243
source: Refresh Rate
ar: معدل التحديث

# #244
source: Full screen
ar: شاشة كاملة

# #245
source: Sizing: (%i,%i)->(%i,%i) (Zoom x%2.2f) AR:%2.2f:1 (Pixels: %2.2f:1) (VShift: %2.2f)
ar: تحجيم: (%i,%i)->(%i,%i) (تقريب x%2.2f) AR:%2.2f:1 (%بكسل: 2.2f:1) (VShift: %2.2f)

# #247
source: Scripts
ar: النصية

# #248
source: Language
ar: اللغة

# #249
source: Music
ar: موسيقى

# #250
source: Visualization
ar: التصور

# #251
source: Select destination directory
ar: حدد دليل الوجهة

# #252
source: Output stereo to all speakers
ar: إخراج النظام الصوتي لجميع المكبرات

# #253
source: Number of channels
ar: عدد القنوات

# #254
source: - DTS capable receiver
ar: - DTS قدرة استقبال

# #256
source: Fetching CD information
ar: إحضار المعلومات الإسطوانة

# #257
source: Error
ar: خطأ

# #258
source: Enable tag reading
ar: تمكين علامة القراءة

# #259
source: Opening
ar: جاري الفتح

# #260
source: Shoutcast
ar: شوتكاست

# #261
source: Waiting for start...
ar: انتظار للبدء...

# #262
source: Scripts output
ar: مخرجات النصية

# #263
source: Allow control of XBMC via HTTP
ar: سماح تحكم XBMC عبر HTTP

# #264
source: Record
ar: تسجيل

# #265
source: Stop Rec.
ar: إيقاف التسجيل

# #266
source: Sort by: Track
ar: ترتيب حسب: المسار

# #267
source: Sort by: Time
ar: ترتيب حسب: الوقت

# #268
source: Sort by: Title
ar: ترتيب حسب: العنوان

# #269
source: Sort by: Artist
ar: ترتيب حسب: الفنان

# #270
source: Sort by: Album
ar: ترتيب حسب: ألبوم

# #271
source: Top 100
ar: أعلى 100

# #272
source: Top-Left overscan compensation
ar: تعويض زيادة الفحص أعلى اليسار

# #273
source: Bottom-Right overscan compensation
ar: تعويض زيادة الفحص أسفل اليمين

# #274
source: Subtitle positioning
ar: توضيع الترجمة

# #275
source: Pixel ratio adjustment
ar: تكييف نسبة البكسل

# #276
source: Adjust the arrow to change the amount of overscan
ar: ضبط السهم لتغيير مقدار زيادة الفحص

# #277
source: Adjust the bar to change the subtitles position
ar: ضبط الشريط لتغيير موضع الترجمات

# #278
source: Adjust the rectangle so it is perfectly square
ar: ضبط المستطيل بحيث يكون مربع تماما

# #279
source: Unable to load settings
ar: غير قادر على تحميل الإعدادات

# #280
source: Using default settings
ar: استخدام الإعدادات الافتراضية

# #281
source: Please check the XML files
ar: يرجى التحقق من ملفات XML

# #282
source: Found %i items
ar: العثور %i عل بنود

# #283
source: Search results
ar: نتائج البحث

# #284
source: No results found
ar: لا توجد نتائج

# #285
source: Preferred audio language
ar: لغة الصوت المفضلة

# #286
source: Preferred subtitle language
ar: لغة الترجمة المفضلة

# #287
source: Subtitles
ar: الترجمات

# #288
source: Font
ar: الخط

# #289
source: - Size
ar: - الحجم

# #290
source: Dynamic range compression
ar: ضغط النطاق الديناميكي

# #291
source: Video
ar: فيديو

# #292
source: Audio
ar: صوت

# #293
source: Browse for subtitles
ar: تصفح للبحث عن الترجمة

# #294
source: Create bookmark
ar: إنشاء علامة

# #296
source: Clear bookmarks
ar: مسح العلامات

# #297
source: Audio offset
ar: توازن الصوت

# #298
source: Bookmarks
ar: العلامات

# #299
source: - AAC capable receiver
ar: -- AAC قدرة استقبال

# #300
source: - MP1 capable receiver
ar: -- MP1 قدرة استقبال

# #301
source: - MP2 capable receiver
ar: -- MP2 قدرة استقبال

# #302
source: - MP3 capable receiver
ar: -- MP3 قدرة استقبال

# #303
source: Delay
ar: تأخير

# #304
source: Language
ar: اللغة

# #305
source: Enabled
ar: ممكن

# #306
source: Non-interleaved
ar: غير معشق

# #308
source: Original stream's language
ar: مجرى اللغة الأصلي

# #309
source: User Interface language
ar: لغة واجهة المستخدم

# #313
source: Cleaning database
ar: تنظيف قاعدة بيانات

# #314
source: Preparing...
ar: إعداد...

# #315
source: Database error
ar: خطأ في قاعدة بيانات

# #316
source: Searching songs...
ar: بحث الأغاني...

# #317
source: Cleaned database successfully
ar: قاعدة البيانات منظفة بنجاح

# #318
source: Cleaning songs...
ar: تنظيف الأغاني...

# #319
source: Error cleaning songs
ar: خطأ تنظيف الأغاني

# #320
source: Cleaning artists...
ar: تنظيف الفنانين...

# #321
source: Error cleaning artists
ar: خطأ تنظيف الفنانين

# #322
source: Cleaning genres...
ar: تنظيف الأنواع...

# #323
source: Error cleaning genres
ar: خطأ تنظيف الأنواع

# #324
source: Cleaning paths...
ar: تنظيف مسارات...

# #325
source: Error cleaning paths
ar: خطأ تنظيف المسارات

# #326
source: Cleaning albums...
ar: تنظيف ألبومات...

# #327
source: Error cleaning albums
ar: خطأ تنظيف ألبومات

# #328
source: Writing changes...
ar: كتابة تغييرات...

# #329
source: Error writing changes
ar: خطأ كتابة التغييرات

# #330
source: This may take some time...
ar: هذا قد يستغرق بعض الوقت...

# #331
source: Compressing database...
ar: ضغط قاعدة بيانات...

# #332
source: Error compressing database
ar: خطأ ضغط قاعدة بيانات

# #333
source: Do you want to clean the library?
ar: هل تريد تنظيف المكتبة؟

# #334
source: Clean library...
ar: تنطيف المكتبة...

# #335
source: Start
ar: ابدأ

# #336
source: Framerate conversion
ar: تحويل فراميرات

# #337
source: Audio output
ar: مخرج الصوت

# #338
source: Analog
ar: النظير

# #339
source: Optical/Coax
ar: بصري/محوري

# #340
source: Various artists
ar: فنانين مختلفين

# #341
source: Play disc
ar: تشغيل القرص

# #342
source: Movies
ar: أفلام

# #343
source: Adjust framerate
ar: ضبط فراميرات

# #344
source: Actors
ar: الممثلين

# #345
source: Year
ar: السنة

# #346
source: Boost volume level on downmix
ar: دفع مستوى الصوت على downmix

# #347
source: - DTS-HD capable receiver
ar: مستقبل - DTS-HD مؤهل

# #348
source: - Multichannel LPCM capable receiver
ar: مستقبل قنوات LPCM مستقبل مؤهل

# #349
source: - TrueHD capable receiver
ar: مستقبل HD حقيقي مؤهل

# #350
source: Programs
ar: برامج

# #351
source: Off
ar: معطلة

# #352
source: Dim
ar: خافت

# #353
source: Black
ar: أسود

# #354
source: Matrix trails
ar: مسارات ماتركيس

# #355
source: Screensaver time
ar: وقت شاشة التوقف

# #356
source: Screensaver mode
ar: وضع شاشة التوقف

# #357
source: Shutdown function timer
ar: مؤقت عملية الإغلاق

# #358
source: All albums
ar: جميع الألبومات

# #359
source: Recently added albums
ar: ألبومات مضافة مؤخرا

# #360
source: Screensaver
ar: شاشة التوقف

# #361
source: R. Slideshow
ar: R. عرض شرائح

# #362
source: Screensaver dim level
ar: مستوى خفت شاشة التوقف

# #363
source: Sort by: File
ar: ترتيب حسب: ملف

# #364
source: - Dolby Digital (AC3) capable receiver
ar: -Dolby Digital (AC3) قدرة استقبال

# #365
source: Sort by: Name
ar: ترتيب حسب : الإسم

# #366
source: Sort by: Year
ar: ترتيب حسب : السنة

# #367
source: Sort by: Rating
ar: ترتيب حسب: التصنيف

# #369
source: Title
ar: العنوان

# #370
source: Thunderstorms
ar: :عواصف رعدية

# #371
source: Partly
ar: :جزئيا

# #372
source: Mostly
ar: :غالبيا

# #373
source: Sunny
ar: :مشمس

# #374
source: Cloudy
ar: :غائم

# #375
source: Snow
ar: :ثلج

# #376
source: Rain
ar: :ممطر

# #377
source: Light
ar: :خفيفة

# #378
source: AM
ar: صباحا

# #379
source: PM
ar: مساءاً

# #380
source: Showers
ar: :زخات مطر

# #381
source: Few
ar: :قليل

# #382
source: Scattered
ar: :غيوم

# #383
source: Wind
ar: :رياح

# #384
source: Strong
ar: :قوي

# #385
source: Fair
ar: :عادل

# #386
source: Clear
ar: :صافي

# #387
source: Clouds
ar: :غائم

# #388
source: Early
ar: مبكر

# #389
source: Shower
ar: :ممطر

# #390
source: Flurries
ar: :موجات

# #391
source: Low
ar: الصغرى

# #392
source: Medium
ar: :متوسطة

# #393
source: High
ar: العظمى

# #394
source: Fog
ar: :ضباب

# #395
source: Haze
ar: :ضباب رقيق

# #396
source: Select location
ar: حدد موقع

# #397
source: Refresh time
ar: تحديث الوقت

# #398
source: Temperature units
ar: وحدات درجة الحرارة

# #399
source: Speed units
ar: وحدات السرعة

# #400
source: Weather
ar: الطقس

# #401
source: Temp
ar: درجة الحرارة

# #404
source: Wind
ar: :رياح

# #405
source: Dew point
ar: :نقطة ندى

# #406
source: Humidity
ar: :رطوبة

# #409
source: Defaults
ar: الافتراضية

# #410
source: Accessing weather service
ar: خدمة الوصول الى الطقس

# #411
source: Getting weather for:
ar: الحصول على طقس:

# #412
source: Unable to get weather data
ar: تعذر الحصول على بيانات الطقس

# #413
source: Manual
ar: يدوي

# #414
source: No review for this album
ar: لاتوجد استعراضات لهذا الألبوم

# #415
source: Downloading thumbnail...
ar: ...تحميل المصغرة

# #416
source: Not available
ar: غير متاح

# #417
source: View: Big icons
ar: عرض: رموز كبيرة

# #418
source: Low
ar: الصغرى

# #419
source: High
ar: العظمى

# #422
source: Delete album info
ar: حذف معلومات الألبوم

# #423
source: Delete CD information
ar: CD حذف معلومات

# #424
source: Select
ar: اختر

# #425
source: No album information found
ar: لا توجد معلومات الألبوم

# #426
source: No CD information found
ar: CD لا توجد معلومات

# #427
source: Disc
ar: القرص

# #428
source: Insert correct CD/DVD
ar: الصحيح CD/DVD إدراج

# #429
source: Please insert the following disc:
ar: :الرجاء إدراج القرص التالي

# #430
source: Sort by: DVD#
ar: DVD# :ترتيب بواسطة

# #431
source: No cache
ar: لاتوجد ذاكرة مؤقته

# #432
source: Remove movie from library
ar: إزالة الفيلم من المكتبة

# #433
source: Really remove '%s'?
ar: ؟'%s' حقا إزالة

# #434
source: From %s at %i %s
ar: %s في %i %s من

# #435
source: No optical disc drive detected
ar: لم يتم العثور على محرك قرص ضوئي

# #436
source: You need an optical disc drive to play this video
ar: تحتاج لحرك أقراص ضوئية لتشغيل هذا الفيديو

# #437
source: Removable disk
ar: القرص قابل للإزالة

# #438
source: Opening file
ar: جاري فتح الملف

# #439
source: Cache
ar: ذاكرة تخزين مؤقته

# #440
source: Harddisk
ar: القرص الصلب

# #442
source: Local network
ar: الشبكة المحلية

# #443
source: Internet
ar: الإنترنت

# #444
source: Video
ar: فيديو

# #445
source: Audio
ar: صوت

# #447
source: Autorun media
ar: وسائط تشغيل تلقائية

# #449
source: Enabled
ar: ممكن

# #450
source: Columns
ar: أعمدة

# #451
source: Row 1 address
ar: عنوان الصف 1

# #452
source: Row 2 address
ar: عنوان الصف 2

# #453
source: Row 3 address
ar: عنوان الصف 3

# #454
source: Row 4 address
ar: عنوان الصف 4

# #455
source: Rows
ar: الصفوف

# #456
source: Mode
ar: الوضع

# #457
source: Switch view
ar: تبديل االعرض

# #459
source: Subs
ar: الترجمات

# #460
source: Audio stream
ar: تدفق الصوت

# #461
source: [active]
ar: [نشط]

# #462
source: Subtitle
ar: الترجمة

# #463
source: Backlight
ar: الاضاءة الخلفية

# #464
source: Brightness
ar: السطوع

# #465
source: Contrast
ar: التباين

# #466
source: Gamma
ar: غاما

# #467
source: Type
ar: النوع

# #468
source: Move the bar to change the OSD position
ar: تحريك الشريط لتغيير وضعية OSD

# #469
source: OSD position
ar: وضعية OSD

# #470
source: Credits
ar: الاعتمادات

# #474
source: Off
ar: معطلة

# #475
source: Music only
ar: موسيقى فقط

# #476
source: Music & video
ar: الموسيقى والفيديو

# #477
source: Unable to load playlist
ar: غير قادر على تحميل قائمة التشغيل

# #479
source: Skin & language
ar: الغلاف واللغة

# #480
source: Appearance
ar: المظهر

# #481
source: Audio options
ar: خيارات الصوت

# #482
source: About XBMC
ar: XBMC حول

# #485
source: Delete album
ar: حذف الألبوم

# #486
source: Repeat
ar: إعادة

# #487
source: Repeat one
ar: إعادة مرة واحدة

# #488
source: Repeat folder
ar: إعادة المجلد

# #489
source: Play the next song automatically
ar: تشغيل الأغنية القادمة تلقائيا

# #491
source: - Use big icons
ar: -- استخدام الرموز الكبيرة

# #492
source: Resize VobSubs
ar: إعادة تحجيم VobSubs

# #493
source: Advanced options (Experts Only!)
ar: (!خيارات متقدمة - (للخبراء فقط

# #494
source: Overall audio headroom
ar: Overall Audio Headroom (dB)

# #495
source: Upsample videos to GUI resolution
ar: إعادة تشكيل دقة عرض الفيديو

# #496
source: Calibration
ar: المعايرة

# #497
source: Show file extensions
ar: عرض ملحقات الملف

# #498
source: Sort by: Type
ar: ترتيب حسب: النوع

# #499
source: Unable to connect to online lookup service
ar: غير قادر على اتصال خدمة البحث على الانترنت

# #500
source: Downloading album information failed
ar: فشل تحميل معلومات الألبوم

# #501
source: Looking for album names...
ar: يبحث عن أسم الألبوم...

# #502
source: Open
ar: فتح

# #503
source: Busy
ar: مشغول

# #504
source: Empty
ar: خالي

# #505
source: Loading media info from files...
ar: تحميل معلومات الوسائط من الملفات...

# #507
source: Sort by: Usage
ar: ترتيب حسب: الإستخدام

# #510
source: Enable visualizations
ar: تمكين التصور

# #511
source: Enable video mode switching
ar: تمكين تغيير وضع الفيديو

# #512
source: Startup window
ar: نافذة بدء التشغيل

# #513
source: Home window
ar: النافذة الرئيسية

# #514
source: Manual settings
ar: الإعدادات اليدوية

# #515
source: Genre
ar: النوع

# #517
source: Recently played albums
ar: ألبومات أجريت مؤخرا

# #518
source: Launch
ar: تشغيل

# #519
source: Launch in...
ar: تشغيل في..

# #521
source: Compilations
ar: التجميعات

# #522
source: Remove source
ar: إزالة مصدر

# #523
source: Switch media
ar: تغيير الوسائط

# #524
source: Select playlist
ar: اختر قائمة التشغيل

# #525
source: New playlist...
ar: قائمة تشغيل جديدة...

# #526
source: Add to playlist
ar: أضف الى قائمة التشغيل

# #527
source: Manually add to library
ar: يدويا أضف إلى المكتبة

# #528
source: Enter title
ar: أدخل عنوان

# #529
source: Error: Duplicate title
ar: خطأ: عنوان مكرر

# #530
source: Select genre
ar: اختر النوع

# #531
source: New genre
ar: نوع جديد

# #532
source: Manual addition
ar: إضافة يدويا

# #533
source: Enter genre
ar: أدخل النوع

# #534
source: View: %s
ar: عرض: %s

# #535
source: List
ar: قائمة

# #536
source: Icons
ar: رموز

# #537
source: Big list
ar: قائمة كبير

# #538
source: Big icons
ar: رموز كبيرة

# #539
source: Wide
ar: واسع

# #540
source: Big wide
ar: واسع كبيرة

# #541
source: Album icons
ar: رموز الألبوم

# #542
source: DVD icons
ar: DVD رموز

# #544
source: Media info
ar: معلومات الوسائط

# #545
source: Audio output device
ar: جهاز إخراج الصوت

# #546
source: Passthrough output device
ar: جهاز عبور الصوت

# #547
source: No biography for this artist
ar: لا سيرة ذاتية لهذا الفنان

# #548
source: Downmix multichannel audio to stereo
ar: مزج صوت القنوات المتعددة الى ستيريو

# #550
source: Sort by: %s
ar: ترتيب حسب: %s

# #551
source: Name
ar: الإسم

# #552
source: Date
ar: التاريخ

# #553
source: Size
ar: الحجم

# #554
source: Track
ar: المسار

# #555
source: Time
ar: الوقت

# #556
source: Title
ar: العنوان

# #557
source: Artist
ar: الفنان

# #558
source: Album
ar: الألبوم

# #559
source: Playlist
ar: قائمة التشغيل

# #560
source: ID
ar: المعرف

# #561
source: File
ar: ملف

# #562
source: Year
ar: السنة

# #563
source: Rating
ar: التقييم

# #564
source: Type
ar: النوع

# #565
source: Usage
ar: الاستخدام

# #566
source: Album artist
ar: البوم الفنان

# #567
source: Play count
ar: عدد المرات التي أجريت

# #568
source: Last played
ar: أجريت مؤخراً

# #569
source: Comment
ar: تعليق

# #570
source: Date added
ar: تاريخ الإضافة

# #571
source: Default
ar: الافتراضي

# #572
source: Studio
ar: ستوديو

# #573
source: Path
ar: مسار

# #574
source: Country
ar: البلد

# #575
source: In progress
ar: في المعالجة

# #576
source: Times played
ar: مرات أجريت

# #580
source: Sort direction
ar: اتجاه الفرز

# #581
source: Sort method
ar: طريقة الفرز

# #582
source: View mode
ar: عرض الوضع

# #583
source: Remember views for different folders
ar: تذكر العرض لمختلف المجلدات

# #584
source: Ascending
ar: تصاعدي

# #585
source: Descending
ar: تنازلي

# #586
source: Edit playlist
ar: تحرير قائمة التشغيل

# #587
source: Filter
ar: تصفية

# #588
source: Cancel party mode
ar: إلغاء وضع الطرف

# #589
source: Party mode
ar: وضع الطرف

# #590
source: Random
ar: عشوائي

# #591
source: Off
ar: معطلة

# #592
source: One
ar: واحدة

# #593
source: All
ar: الكل

# #594
source: Off
ar: معطلة

# #595
source: Repeat: Off
ar: الإعادة: معطلة

# #596
source: Repeat: One
ar: إعادة: واحدة

# #597
source: Repeat: All
ar: إعادة: الكل

# #600
source: Rip audio CD
ar: نسخ اسطوانة صوت

# #601
source: Medium
ar: متوسطة

# #602
source: Standard
ar: قياسي

# #603
source: Extreme
ar: أقصى

# #604
source: Constant bitrate
ar: ثبات معدل البت

# #605
source: Ripping...
ar: ينسخ...

# #607
source: To:
ar: إلى:

# #608
source: Could not rip CD or track
ar: لايمكن نسخ القرص أو المسار

# #609
source: CDDARipPath is not set.
ar: CDDARipPath لم يتم تعريف

# #610
source: Rip audio track
ar: نسخ مسار الصوت
