Repository: xbmc/xbmc
Catalog: addons/service.xbmc.versioncheck/resources/language/Catalan/strings.po
Languages: ca

# #32001
source: We would like to recommend you to upgrade.
ca: En agradaria recomanar-te actualitzar.

# #32002
source: Visit XBMC.org for more information.
ca: Visita XBMC.org per més informació.

# #32004
source: You are still using an older RC version of XBMC.
ca: Encara estàs fent servir una versió RC de XBMC vella.

# #32005
source: You are still using an older beta version of XBMC.
ca: Encara estàs fent servir una versió beta de XBMC vella.

# #32006
source: You are still using an older alpha version of XBMC.
ca: Encara estàs fent servir una versió alpha de XBMC vella.

# #32007
source: You are still using an older monthly version of XBMC.
ca: Encara estàs fent servir una versió mensual de XBMC vella.

# #32008
source: You are still using an older non stable version of XBMC.
ca: Encara estàs fent servir una versió no estable de XBMC vella.

# #32009
source: Would you like to remove this reminder?
ca: Vols eliminar aquest recordatori?

# #32010
source: You can enable/disable it through addon settings.
ca: Pots habilitar/inhabilitar mitjançant les propietats del complement.

# #32011
source: Use your package manager(apt) to upgrade.
ca: Utilitza el gestor de paquets (apt) per actualitzar.

# #32012
source: A new version is available, do you want to upgrade now?
ca: Una nova versió esta disponible, vol actualitzar ara?

# #32013
source: Upgrade successful
ca: Actualització realitzada correctament.

# #32014
source: Do you want to restart Xbmc to finish the upgrade?
ca: Vols reiniciar XBMC per finalitzar la actualització?

# #32015
source: Do you want to check the repository for a new version?
ca: Vols comprovar el repositori per buscar una versió nova?

# #32021
source: Enable XBMC version check?
ca: Habilitar comprovació de versió XBMC?

# #32022
source: Please enter your password
ca: Si us plau indtroduïu la contrasenya

# #32023
source: Linux: Upgrade complete system
ca: Linux: Actualitzar tot el sistema
