Repository: xbmc/xbmc
Catalog: addons/pvr.team-mediaportal.tvserver/resources/language/Hungarian/strings.po
Languages: hu

# Addon Summary
source: XBMC frontend for the MediaPortal TV Server (ffmpeg + tsreader version)
hu: XBMC felület, MediaPortal TV szerverrel (ffmpeg + tsreader verzió)

# Addon Description
source: MediaPortal TV Server frontend. Supports streaming of Live TV &amp; Recordings, listening to Radio channels, EPG and Timers. This addon combines the former ffmpeg and tsreader addons.
hu: MediaPortal TV Szerver felület. Támogatja a stream-elt élő TV adást, a felvett műsorok visszanézését, a rádiócsatornák meghallgatását, a műsorújságot (EPG) és az időzítőket. Ez a kiegészítő egyesíti a korábbi tsreader és ffmpeg kiegészítőket.

# Addon Disclaimer
source: This is unstable software! The authors are in no way responsible for failed recordings, incorrect timers, wasted hours, or any other undesirable effects.
hu: Ez egy nem végleges szoftver! A készítők semmilyen felelősséget nem vállalnak az esetlegesen nem jól működő időzítőért, vagy egyéb nem kívánatos esetek miatt.

# #30000
source: Mediaportal Hostname
hu: MediaPortal Kiszolgálónév

# #30001
source: Mediaportal XBMC plugin Port
hu: MediaPortal XBMC bővítmény

# #30002
source: Free-to-air only
hu: Csak szabadon-fogható

# #30003
source: Include Radio
hu: Tartalmaz Rádiót

# #30004
source: Fast channel switching (don't stop timeshift)
hu: Gyors csatornaváltás (ne hagyja abba az időeltolás (Timeshift) funkció használatát)

# #30005
source: Connect timeout (s)
hu: A kapcsolat időtúllépési értéke (mp.)

# #30006
source: Import only TV Channels from group
hu: TV csatornák importálása csoportokba

# #30007
source: Import only Radio Channels from group
hu: Rádió csatornák importálása csoportokba

# #30008
source: Convert hostname to IP-adress
hu: Kiszolgálónév konvertálása IP címre

# #30009
source: EPG: Read genre strings (slow)
hu: EPG: Olvassa ki a műfaj sztingeket (lassú)

# #30010
source: Wait time after tuning a channel (ms)
hu: Ennyi várakozási idő után hangolja a csatornákat (milliszekundum)

# #30015
source: Streaming method
hu: Streaming módszer

# #30016
source: Windows user account (SMB)
hu: Windows felhasználói fiók (SMB)

# #30017
source: Windows password (SMB)
hu: Windows jelszó (SMB)

# #30018
source: Use RTSP streaming
hu: Használja az RTSP streaming-et

# #30040
source: Connection
hu: Kapcsolat

# #30042
source: Playback
hu: Lejátszás

# #30050
source: Your TVServerXBMC version '%s' is too old. Please upgrade to '%s' or higher!
hu: A TVServerXBMC verzió '%s' túl régi. Kérem frissítse a '%s' vagy magasabbra!

# #30051
source: Your TVServerXBMC version is too old. Please upgrade to '%s' or higher!
hu: A TVServerXBMC verziója túl régi. Kérem frissítse a '%s' vagy magasabbra!

# #30052
source: Recording playback failed. Empty URL of filename.
hu: Felvétel lejátszása nem sikerült. Üres URL fájlnév.

# #30060
source: All cards are busy
hu: Minden kártya foglalt

# #30061
source: Channel is scrambled
hu: A csatorna kódolva van

# #30062
source: No video or audio detected
hu: Nincs észlelt kép és/vagy hang

# #30063
source: No signal detected
hu: Nincs jel

# #30064
source: Unknown error
hu: Ismeretlen hiba

# #30065
source: Unable to start graph
hu: Nem lehet elindítani graph-t

# #30066
source: Unknown channel
hu: Ismeretlen csatorna

# #30067
source: No tuning details
hu: Nincsenek hangolással kapcsolatos részletek

# #30068
source: Channel is not mapped to any card
hu: A csatorna nincs hozzárendelve semmilyen kártyához

# #30069
source: Card is disabled
hu: A kártya le van tiltva

# #30070
source: Connection to slave failed
hu: A csatlakozás nem sikerült

# #30071
source: Not the owner
hu: Nem tulajdonos

# #30072
source: Graph building failed
hu: Graph építése nem sikerült

# #30073
source: SW Encoder missing
hu: Szoftveres enkóder hiányzik

# #30074
source: No free disk space
hu: Nincs elég hely a lemezen

# #30075
source: No PMT found
hu: Nem találtam programleképezési táblát
