Repository: xbmc/xbmc
Catalog: addons/weather.wunderground/resources/language/Macedonian/strings.po
Languages: mk

# #32101
source: Location setup
mk: Подесување на локација

# #32102
source: Advanced options
mk: Напредни опции

# #32111
source: Location 1
mk: Локација 1

# #32112
source: Location 2
mk: Локација 2

# #32113
source: Location 3
mk: Локација 3

# #32114
source: Location 1 display name
mk: Име на Локација 1

# #32115
source: Location 2 display name
mk: Име на Локација 2

# #32116
source: Location 3 display name
mk: Име на Локација 3

# #32117
source: Location 1 id
mk: ИД на Локација 1

# #32118
source: Location 2 id
mk: ИД на Локација 2

# #32119
source: Location 3 id
mk: ИД на Локација 3

# #32120
source: Enable logging
mk: Овозможи логови

# #32121
source: Weekend
mk: Викенд

# #32122
source: Saturday/Sunday
mk: Сабота/Недела

# #32123
source: Friday/Saturday
mk: Петок/Сабота

# #32124
source: Thursday/Friday
mk: Четврток/Петок

# #32125
source: Map zoom level
mk: Ниво на зум на мапа

# #32126
source: Animated map
mk: Анимирана мапа

# #32501
source: New Moon
mk: Млад месец

# #32503
source: First Quarter
mk: Прв квартал

# #32505
source: Full Moon
mk: Полн месец

# #32507
source: Last Quarter
mk: Последен квартал

# #32510
source: Warning
mk: Предупредување

# #32511
source: Watch
mk: Поглед

# #32512
source: Advisory
mk: Совети

# #32513
source: Statement
mk: Изјава

# #32514
source: Outlook
mk: Аутлук

# #32515
source: Forecast
mk: Прогноза

# #32516
source: Synopsis
mk: Синопсис
